{
  "TeenWolfToo(1987)": [
    {
      "title": " I don't even know where to begin.",
      "review": "I am going to start out by admitting that even though I think the original Teen Wolf is a pretty stupid movie, I actually like it quite a bit.  I don't know what it is about it that I like, but for the last couple of months I've found myself watching my copy of Teen Wolf about once a week.I decided to purchase (you gotta OWN these titles, that's the fun of it.) a copy of Teen Wolf Too on eBay for $4.  The only other time I had seen this movie was when I was in 4th grade, which was over a decade ago.  I didn't remember much about it, save a couple of moments involving Chubby.I just finished watching the movie for the first time in 11 years, and I can say with complete certainty that this is one of the worst movies I've seen in a LONG time.  In many ways, this is the *perfect* bad sequel...  The first film wasn't especially good or commercially successful, so it seems pointless to have even considered making another chapter in the Teen Wolf saga.  They also weren't able to get the big star of the first movie (Michael J. Fox) to come back, so they instead focused on his cousin, whose personality is almost exactly the same.  Even further, they decided to bring back a few of the characters from the first movie, only two of which are played by the same actors.  Stiles, who was corny but funny in Teen Wolf, has been replaced by an actor who isn't nearly as convincing or amusing. Coach Finstock, who was the only genuinely funny character in the first film, is now played by a man whose line delivery made me laugh exactly zero times throughout the course of the film.These discrepancies aside, the plot of this film is crap.  It's basically exactly the same as the original, only even more sketchy.  Anyone who hasn't seen Teen Wolf will probably not be able to make sense of the plot, not that any of them would actually watch this ridiculous film in its entirety.I could probably write a fairly long essay on the problems with this movie, but I'm limited to 1000 words here.  I would comment more on the many specific elements that make this movie stupid, but I don't want to waste more of anyone's time.  And since I'm trying to keep you from wasting your time, then I will recommend that you do not watch this movie.  Ever. Anyone who says that this movie is not that bad is wrong."
    },
    {
      "title": " Sweet Merciful God Why?",
      "review": "After a lifetime of watching movies and searching for the greatest moment in cinematic history, I've finally found it.  Is it Orson Welles' breathless death-rattle of `. . . rosebud.' In Citizen Kane?  No.  How about Al Pacino giving Fredo the kiss of death in Godfather II?  Try again.  What about Peter Finch screaming into the Network camera `I'm mad as hell, and I'm not gonna take it ANYMORE!' . . . not even close.Are you ready?  Here it is:  the greatest moment in contemporary motion picture history is . . . in Teen Wolf Too when Jason Bateman (as the Wolf) runs across the park, leaps through the air in slow motion, and comes down with a Frisbee in his mouth-all without losing that stupid hat he had on!Oh, but this film is peppered with other fantastic gems.  Like the part where the Wolf and Chubby where cruising around in the University Corvette (what, your school didn't have one?) and they almost ran that guy on the bike over and the Wolf just kept laughing and laughing--good times; or what about when Chubby was in the ring and he bounced the smaller guy into the ropes, put his hand on his hip, twirled his fist and knocked the kid out; ew! ew! ew!  I know!  What about when the Wolf was singing `Do You Love Me!' Remember?  When he had that little suit on and he was strutting his choreographed stuff with the team of wannabe Solid Gold Dancers?  Box office dynamite!I don't remember a huge portion of this film, because the part of my brain that controls my higher cognitive functions shut down somewhere between the part where Chubby farts and Stiles sits in the smell and the part where the science teacher walks away from Gomez Addams with a tail wagging from under her skirt.  Just thinking about it makes my lobes tingle and go numb.If there was one thing worse than the moron who played Stiles in Teen Wolf, it has got to be the guy that played Stiles in Teen Wolf Too.  Oh my God that guy was horrible.  The only highlight of this movie was when Stiles gets punched-out in between rounds of the big climactic fight scene-I like it because I've convinced myself that it was an outtake and he REALLY got hit.  Take THAT Stuart Fratkin!  What was he thinking?  `Yeah, I landed a SWEET gig on Teen Wolf Too-I'm STILES!  Just the springboard my career needs!'  Yeah, look out DeNiro, here comes Stuart Fratkin.My buddy Marc brought this movie over to my house and I'm not sure what to think.  This is the same friend that exposed me to Pumpkinhead 2.  The only thing I can figure is that he is one of many alien infiltrators sent to Earth to use bad movies to brainwash people into a zombie-like trance, making way for an alien take over.  To those in a similar circumstance, I say RESIST!  You're not taking my soul with Teen Wolf Too, Marc!  I'm on to you fella!"
    },
    {
      "title": " Ouch",
      "review": "It's a sad truth that there are a lot of bad werewolf movies out there. But there are a few that really stand out as being among the worst of the worst ... and \"Teen Wolf Too\" is undoubtedly one of them.It follows pretty much the same plot as the first movie, which was itself a recycled formula. Todd Howard (cousin of Scott from the first movie), a hard-working science student, arrives in college wanting to work towards becoming a vet. But there's one snag -- he's there under a sports scholarship, and unless he performs well in the boxing tournament his place in the college is at stake. Thankfully, he finds himself succumbing to his cousin's lycanthropic curse and becomes a popular and agile werewolf. But in the process he, of course, forgets who his real friends are.There are numerous recurring characters from the first movie, some of whom have inexplicably moved to this college. There are Scott's high school chums, Chubby and Stiles -- Stiles is this time played by Stuart Fratkin, who also appeared in an episode of the TV show \"Werewolf\" the same year (\"A Material Girl\"). Scott's dad also makes a few appearances, as well as the Scott's coach, who is also played by a different actor this time. But of course, none of this matters ... without Michael J Fox, this movie was pretty much doomed from the start. He was pretty much the only thing that saved \"Teen Wolf\" from being a flop.The dialogue is unbearable, the directing is clumsy, and the acting in places is downright appalling. Since this is basically a remake of the first movie, there's absolutely no reason to watch it. Just watch the original, and forget about this one altogether. There's hardly anything good to say about it at all. And believe it or not, it still made money. In fact it's very surprising that we didn't see a \"Teen Wolf Three\" the next year. Thank heavens for small blessings ..."
    },
    {
      "title": " Realistic and funny",
      "review": "Unfortunately Teen Wolf Too Is neither. I know what you're thinking, 'it's a film about a teenage who can turn into a werewolf, or course it's not meant to be realistic'. Fair point, but I know that whenever I see a person turn into a werewolf I at least react, usually by saying 'what the s**t is going on here?' That's the main problem I have with film. Jason Bateman turns into the werewolf in the middle of a boxing bout and the whole school starts cheering for the wolf, without even thinking 'wow, a dude just turned into a werewolf, that's a little unique'. THEY DIDN'T EVEN GIVE IT A SECOND THOUGHT. Possibly because the cast had seen the original Teen Wolf and knew that it is possible for college sports stars to morph into werewolves when they face adversity. Unfortunately the rest of the film is pretty weak, with alleged jokes misfiring at regular intervals and Teen Wolf singing 'do you love me'. Don't really have to say anymore about thatI wont give away the end, just in case people are reading this and thinking 'wow, its been out for 18 years but it's only now that I feel the need to get amongst this cinematic masterpiece', but will Teen wolf decide to face the world as himself or as the wolf? Only time will tell."
    },
    {
      "title": " Sucks",
      "review": "Teen Wolf 2 is a pale copy of teen wolf. The first movie is great the second one just boring, not funny, and it sucks. The characters are faked and the plot is just the same as it is in Teen Wolf 1. I fell asleep when I first saw it, and I'm not going to see again ever."
    },
    {
      "title": " This is cash-in sequeling at it's worst.",
      "review": "And to think that people complained that Return of the Jedi was too much like Star Wars...They obviously hadn't seen this movie, which is basically the exact plot of the original with different actors. Not even a token piece of originality.This is cash-in sequeling at it's worst, equalled only by the likes of Grease 2. Avoid it, or you'll think you're watching the original with new voices dubbed over the top."
    },
    {
      "title": " what a blast!",
      "review": "If you like Teen Wolf, you'll like Teen Wolf Too practically almost the same amount. It's a great movie, really. You just have to be able to make fun of it. It's one of those great bad movies.Jason Bateman's hair basically makes the movie worth your while, as does the shoddy special effects and semi-awful wolf costume.Particularly notable moments include the horrible sound editing during the first boxing match, and the moment in which Todd first transforms.Plus, there's a musical number! C'MON PEOPLE!I bought it because of Jason Bateman. But I loved it because of it's heart, humor, and generically bland plot and stunning clichés.But I really did actually enjoy it.Seriously.I'm not even being sarcastic.I sort of wish they'd gotten rid of those suspenders Jason was so fond of though."
    },
    {
      "title": " Teen Wolf Too: The Neutering",
      "review": "If werewolf movies have taught us anything, it's that werewolves make the absolute BEST boxers! From Lon Chaney Jr in \"The Wolfman\" to Benicio Del Toro (also in \"The Wolfman\" but not the same \"The Wolfman\"), boxing has been a major theme throughout ALL werewolf movies, no matter what their countries of origin.*checks with her sources* Oh, wait... werewolves DON'T box?! Werewolves are the ones that bite, claw and scratch, right? All are maneuvers NOT allowed in boxing (unless you're Mike Tyson, then biting seems to be okay).This stink-burger should've closed the book on Jason Bateman's career. I'm just glad that he was able to redeem himself with \"Mr. Magorium's Wonder Emporium\" (I loved him as \"the Mutant\").Teen Wolf had that dopey Wolfman Dance, but it was still a watchable movie.\"Teen Wolf Too\" is just... bad. And it's not a GOOD bad. You know, the GOOD bad movies where you sit with your friends and a nice sugar rush and riff the snot out of a bad movie? There's nothing to riff with this. You watch it and wind up commenting on books that you have on the coffee table, or you look around for something else to do... something that could POSSIBLY hold your attention, because \"Teen Wolf Too\" does not."
    },
    {
      "title": " A sequel that shouldn't have been made",
      "review": "Does Hollywood ever learn? You can't top a film like 'Teen Wolf.' All you can do is defile its existence by producing a sequel like this. The movie isn't worth watching unless you're a Jason Bateman fanatic or a masochist.The plot from the first movie is reduxed here, and poorly. The message is the same. The moral is the same. The only thing that's changed is the faces, because the majority of the cast from the first movie was wise to avoid this bomb. The dad from 'Teen Wolf' makes an appearance, and that's all I can remember (without checking the listing). A forgettable flop."
    },
    {
      "title": " \"Too\" much of a bad thing....",
      "review": "Jason Bateman is no Michael J. Fox.  Ouch.And \"Teen Wolf Too\" is not as good as \"Teen Wolf\".  BIG ouch.Not that the original had anything going for it except for Fox, but this sequel doesn't even try.  Just a change of locale and a COUSIN in the same family (explaining Hampton's appearance here) who gets on the boxing team as the wolf in question, forcing his grades to suffer, and blah and blah and blah....Give me a break.  For a comedy as insubstantial as this one to expound on the virtues of education is like Joey Buttafuoco talking about celibacy. I'm sorry, but \"Teen Wolf Too\" is just a bad excuse for a sequel to a movie that wasn't that great to begin with.  Forget about it.No stars and no excuses for \"Teen Wolf Too\": the movie that proves a movie about a wolf can just as easily turn into a dog."
    },
    {
      "title": " Notable only for how cheap it is and how little effort was put into it across the board",
      "review": "Although he is Scott's cousin, Todd Howard has managed to dodge the \"family problem\" and is a perfectly normal young man starting a promising college career. Despite being very weedy and interested in becoming a vet, Todd has managed to get a sports scholarship without being sure why. Turns out that the Dean has assumed that Todd can do for the college boxing team what Scott did for his high school basketball team what with him being a werewolf and everything. Todd discovers this quickly and is keen to disappoint but his genes betray him as the \"family problem\" manifests itself suddenly. Overnight Todd is a star in the ring and on the campus – but can he manage this sudden change?When I read overly negative reviews of the first Teen Wolf film I can only silently shake my head and wonder what the same viewer makes of the sequel. I say this because, as basic as the original film is, Teen Wolf Too/Two/2/whatever is like the makers condensed the original film to the basics and then just put that out on as little money, time and effort as possible. It shows in all areas of the film but I have to start somewhere so I will do so with the actual story. The flow of it is this (a) studious kid doesn't really fit into school/college, (b) kid becomes werewolf, (c) kid becomes popular but also a major a**hole, (d) kid learns life lesson. OK, so you can see it is essentially the same film as the first time, with the sport and setting different. In terms of the telling of the story though, we literally jump between these parts without any gradual development between them. I'm not saying it needed a lot of complexity but maybe just one or two scenes bridging the gap between the elements – instead it will literally have 1 scene of him becoming a werewolf for the first time, then the next scene is him popular and doing a 50's twist (for some reason) at a party – not even a bridge which shows him winning over an initially hesitant campus. This is the same across the whole film and it makes it weaker as a film – a problem considering it would still have not been great with these scenes.This slapdash approach is reflected in the whole film and it is no surprise that the script is poor. The dialogue matches the \"good enough\" approach to the narrative – ie lines are clunky, obvious and lacking anything that would make you care enough to listen. However, producing even this level of trash was clearly too much for the writers because they appear to have been too busy to get laughs, fun or energy into the script. Visually it looks cheap. The sets are faded and unconvincing while the aim appears to have been to try and pull off \"crowd\" scenes with as few extras as possible. The wolf makeup is also really bad – never great of course but in Too it looks like a mask purchased at a corner store.With all this it is no surprise that the cast can do nothing with it. I feel sorry for Bateman but he is poor here and cannot do anything with the material handed to him. He has almost zero chemistry with Chandler as well – again neither of them helped by the material having no bridge between \"oh hi\" and \"you are the love of my life\". Astin must have hoped for more but, even though he has a glint in his eyes that suggests a fun role in the film, he does nothing and has nothing to do. Fratkin and Holton are both annoying and deliver nothing in the way of laughs that the writers clearly just assumed they would do on their own (wackiy guy and fat guy – practically writes itself.....errr, no, no it doesn't).The end product is not so much a terrible film in that everything was misjudged but rather a terrible film because nobody seems to have given a single, flying f**k about it from conception to final delivery. The plot is the same as the first film but yet so much worse and basic, with similar dialogue. The \"feel\" of the film is likewise cheap and \"make-do\" and it is no surprise that nobody in the cast can do much of anything with the whole affair. The only value the sequel has is making the first Teen Wolf film seem more fresh and filled with fun that it was."
    },
    {
      "title": " Dear God, Why?",
      "review": "This one ranks up there with Mannequin 2 and Weekend at Bernie's 2 as the worst sequels of all time. As if the cheesy first film starring Michael J Fox wasn't bad enough, some dink in Hollywood decided that a second must be made despite the fact that there were many obvious signs not to make it. Shouldn't the signs be clear when you can't get star of the film back, or half the rest of the cast who realized they'd be doomed to the C circuit forever?This is just a poor rehash of an already terrible idea. Geek (Jason Bateman) going to school, is somehow into athletics when he should really be into studying and insects, is in love with the hot chick on campus but doesn't notice the blistering crush the longtime girl friend has on him. He turns into a wolf, parties, gets really good at sports, learns a lesson, and then wins as himself instead of using the magic powers Oden inferred upon him and discovers that the longtime girl friend is the hottest chick in the movie. yay. I only have a few thoughts on this flick though. Why did they feel the need to bring back Mr Howard? I mean, they could have made a clean break, cast all new people and just made it another film that had a similar 'plot'. But instead, they bring back incidental characters from the first film that weren't that entertaining then. They bring back Scott's friend Stiles. How does he know Todd (Bateman)? I'm not really sure. I'm kind of surprised he knew him since this Stiles looks completely different do to either complete facial reconstruction or a casting change. Not that it matters, as the annoying character he is, the less you remember his face, the more better off you are. Why is Chubby in this film? I mean, talk about bringing back a character that brought nothing to the table. The only thing he did in the first film was eat jello from a girls cleavege. Sure, we all want to do that just once, but it still shouldn't mean getting into another film.And why Boxing? I mean, what colleges have a boxing circuit? And does Bateman look like he could hurt a fly? At least basketball, football or even baseball could pass. Hell, track and field!! But, alas, they decided Boxing was the way to go. Another great choice by these people. I'm shocked they're still working after all this.At least Bateman has redeemed himself by doing some good work on Arrested Development. But it'll take an Oscar for me to ever forgive this horrendous film. Avoid it like the plague and thank the lord above if you've never seen it. Amen."
    },
    {
      "title": " Awful...but Jason is adorable!",
      "review": "This movie borders on unwatchable from it's duplication of the original to the horrid acting (yes, even from Jason Bateman) to the clumsy direction. I really liked Teen Wolf but after watching this movie I realized it was the charm of the star and the novelty of the concept that made that movie entertaining.If you are a Jason Bateman fan like I am though it is nice to see him in his early days when his talent was getting formed. Oh yeah, and he is gorgeous!!!Watch at your own risk. I repeat, watch at your own risk (what is it with the 10 lines of text rule???)"
    },
    {
      "title": " 'Hey thanks, you got any fries'",
      "review": "When i was a boy in the late 80s, I used to rent out videos from my local store. One such one was Teen Wolf Too. I seem to remember enjoying it, probably cos it was about boxing and i liked fight films at that age like any boy (my favourite movie series was the Karate Kid). I didn't remember much about it, but must have liked it cos I then rented Teen Wolf, the original, to see where it had come from. Low and behold the main character was Michael J Fox, my favourite actor at the time. Then I fell in love with THAT film, perhaps even forgetting it all started with Teen Wolf Too.Years later, with newly installed Sky, I see that Teen Wolf Too in on Sci-Fi channel one afternoon. 'I'll watch that, I loved those films when i was a kid, it's like walking down memory lane'. I was shocked at how bad it was (more on this later). Was I that clueless as a kid? Anyway, a week later I saw that the original Teen Wolf was on, and thought 'Hey, let's truly confirm my poor taste as a child'. I was again shocked. Because it was good. Okay, it's not really, it's actually stupid and I still don't know why: A) Scott/Todd turn into a werewolf. A little explanation is all I ask, not a realistic one, just a little.B) Scott/Todd just accept what happens to them.C) No one else goes 'That's a werewolf, that's both freaky and unusual, quick, run!' (Instead they all go 'Yay, go Wolfie! We love you and your furriness!') D) Why being a werewolf helps you be good at Basketball/Boxing.Saying all that, Teen Wolf is okay. Its entertaining, has morals, quite amusing, has energetic and sympathetic characters, and Fox's phone in performance is still very likable. I must have watched it so much as a kid, i could remember so many lines. Only the Karate kid matches that.Teen Wolf Too though, is dreadful. People are saying remake/copy, and i agree, except that's too kind. If it was remade properly, it would be close to having the story of the original. But it's like they took the main plot points of the original and said 'Okay, we got that scene, well let's set it here but make as little effort as possible, i mean we're only remaking Teen Wolf, no one cares if it's good.' The result is a mess of awkward, tired, unfunny scenes that only make sense when you see the original and realise that's what they were trying to achieve. In particular, 'Do you love me' was such a terrible, forced, illogical copy of 'Surf's Up' it was painful. But i'm glad i saw them the wrong way round again, because this really makes Teen Wolf look like Back to the Future.Oh, and the point of my story is that I then realised my taste as a kid was obviously not that bad, cos I had seen this twice and then stopped. I had watched Teen Wolf again and again, that's why i knew so many lines even now. The only line I could remember in this was: 'Thanks, you got any fries.'"
    },
    {
      "title": " An Underrated Masterpiece",
      "review": "This is indeed a masterwork. There's so many layers that it's difficult to know where to begin! But, let's start with the brilliant title. Teen Wolf...TOO. As in: Teen Wolf, Also. Or Teen Wolf, As Well. This sly and ingenious inside joke no doubt refers to the once controversial and now celebrated decision to cast Jason Bateman in the leading role as opposed to Michael J. Fox. The title seems to be saying....yes, Michael J. Fox shone brightly as Scott. But, guess what, world? There's ANOTHER Teen Wolf. Yes, Jason Bateman along with his indelible creation, Todd, is a Teen Wolf too.And what a Teen Wolf he was! Bateman inhabits the role of Todd. It's impossible to distinguish where the actor and the character begins. Which is a nice segue into the remarkable make-up and effects. When Todd finally transforms in a beautifully paced scene racked with tension, we are transported by the make-up. Here we are, looking at a teen wolf! And yet, Bateman's performance is so committed, so brave and so genuine, that we never forget....(can't believe I'm actually getting emotional writing this)....it's still Todd in there.I find it hilarious that critics of this film claim that it's a rehash of the first film. First of all, Todd is a completely different Teen Wolf as the title states right out of the gate. Secondly, boxing and basketball have nothing in common other than the fact that they're both sports. I suppose The Natural and Kingpin are identical films as well? Spare me. As Syd Field can tell you, all films follow a similar formula. It's short-sightedness and bias that prevent folks from appreciating just how strikingly different Teen Wolf Too is."
    },
    {
      "title": " a piece of cinematic excellence",
      "review": "Whoahoho! There is no other word to describe this wonderfully delightful film of a college student who learns he can turn into a wolf whenever he wants!!! If you thought Teenwolf was good, just you wait and see how his cousin, played by Justin Bateman ,portrays a new role for the howlingly funny series of movies! One would think that Michael J Fox was an irreplaceble figure in this series, but not so fast my good friend! Justin Bateman was downright hilarious, and I was shocked to find that he was not nominated for an Oscar for this performance. This movie absolutely needed to be made! I'd say the high point of the movie comes when the wolf, with all his new college buddies, dances to a musical montage of \"Do you love me (now that I can dance)\"....Here's to hoping for a Teenwolf Three coming out soon!!!!"
    },
    {
      "title": " Lacks the 'bite' of the original.",
      "review": "I saw this movie once in 1987 and I watched it a second time in 2003 and I still think that this is one sequel that should not have been made. Jason Bateman has always been considered a cut-rate Michael J. Fox and this movie proves that theory to be true.Teen Wolf Too is a text book example of how to make a horrible sequel to an average movie. None of the elements that made the original film enjoyable were present in this piece of work. I can understand the reason they had to go with a new lead character. I can understand the reason they changed the location to a college campus. However, I don't understand why they attempted to include the characters of 'Styles' and Coach Finstock, especially since the actors who portrayed them in Teen Wolf didn't reprise their roles.Jerry Levine and Jay Tarses are two of the elements that added charm to Teen Wolf. They complimented Michael J. Fox and their characters were amusing. In Teen Wolf Too, the actors who portray 'Styles' and Coach Finstock seem as if they are actors who are doing bad imitations of Jerry Levine and Jay Tarses.Once I got past all of the returning characters being re-cast (with the exception of Harold Howard and Chubby), I still couldn't enjoy this movie because the story is no different than it was in the first movie. Like the first film, they cover up the lack of plot by including several montages of Teen Wolf Too doing amazing things and being loved by his peers.  The footage seemed to work in the first movie, but it doesn't really fly here. Maybe basketball highlights and breakdancing are more exciting that boxing highlights and frisbee catching.I don't know why the screenwriter didn't choose to elevate the \"teenage werewolf\" theme and concentrate on some of the difficulties of dealing with that type of situation when in doesn't involve winning in sports. Why not introduce a female 'teen wolf' and show us the problems associated with her situation.I could go on and on about how it could have been done, but unfortunately, they have already wasted my time with this piece of trash. The only thing good about the DVD is that you can flip it over and watch the original Teen Wolf. On the other hand, the worst thing about the original Teen Wolf DVD is that this waste of time is on the flip side of it."
    },
    {
      "title": " Revenge of the 80's meets the Dustbin Dwellers: Meaningless sequels that are so bad that they have no entertainment value.",
      "review": "Teen Wolf Too (1987) bites. Why on earth did they make a sequel to a marginally \"successful\" movie. The original lame movie spawned a Saturday morning cartoon series and this god awful movie. It's so terrible. If you thought part one was bad you ain't seen nothing yet. Teen Wolf Too is so bad that it makes part one look like an Academy Award winning film. Dude, why did they make this movie? What were the film-makers thinking? I know that this movie was made during the 80's and they made an obligatory sequel (they were mandatory during the 80's, if a film made the slightest of profit a sequel was on it's way).I can't express my displeasure in this movie. There was no reason for it to ever see the light of day. I can't find one. Can you?Bad movie, beyond words...Runaway! Runaway!!"
    },
    {
      "title": " Teen Wolf Remake",
      "review": "This sequel is REMARKABLE. It's note for note the exact same film as Teen Wolf, with boxing replacing basketball (and Jason Bateman as a fourth string Michael J Fox)But more importantly, I'm one of the four people in this country who saw this in the theaters. In fact, that night I was recovering from surgery on my left shoulder, and my friend's lab had just bitten my right hand. We went to Teen Wolf too thinking the day could not have gotten worse. Whoops.Instead of renting this, I recommend getting bitten by a dog. Or watch the last scene of Teen Wolf 1. A guy has his pants unbuttoned and tries desperately to cover up in the last shot. L Man"
    },
    {
      "title": " This is a very, very bad movie.",
      "review": "Whew, this movie stinks!I think the other reviewers here have covered most of the...highlights. But you know, this was just a cheapy money maker. It's just a reboot of the first one, even including the putt-putt golf scene, which is just shameless. The only new thing is: boxing and a meth-head-looking Stylez.I've been watching arrested development so much lately I thought I'd give TWT a shot, because I'm just hangin around the house tonight.Funny, I texted a few friends that I was watching this movie, and everyone said, \"Oh man that movie sucks.\" Boy, do I agree. It's horrible.The three-in-a-row montage thing really is priceless. I'm actually still watching it right now, and it's on the third song. So funny!Styles looks like...jeez, I'm not sure. His \"Missouri Compromise\" hairdo sure does work for him though. And yes, Chubby is on the fencing team. A sport for nimble, slim, quick guys. Yeah. A guy named Chubby got a fencing scholarship.This movie is to Teen Wolf what Saved by the Bell: The College Years was to Saved by the Bell - a painful reminder that this show sucks. \"Frog fighting in my lab?\" Yes! What a half-hearted effort. The script is garbage. That's where the main fault lies - this script is totally, totally ridiculous it's so bad. Wouldn't a human who could turn into a wolf attract some kind of media attention? I mean sure they didn't have Twitter in the 80s, but you'd think ESPN or something might pick up on it. Just sayin'.Oh yeah, I also like how Bateman and his girlfriend both speak Latin and know graduate-level biology. In case you hadn't checked, most freshman are idiots who don't read anything at all. I guess it just wasn't believable.Last thought - do colleges really have boxing teams?"
    },
    {
      "title": " horribly bad sequel that doesn't add anything new",
      "review": "Think of the first movie then take away good acting (except Chubby's character played by Mark Holton - he was funny) take away humor and throw originality out too. In the first movie we saw Michael J Fox's wolf rise to fame, here we see his cousin (what a lame excuse to make another film when the original actor doesn't want to do another) first fail as a wolf then decide he doesn't even want to be a wolf. The sporting storyline is almost exactly like the first film except it's boxing, not basketball this time. I was most annoyed that none of the original actors were there (didn't that tell the film makers something when none of the originals wanted to do another?) but the same characters were present with different names (stiles is different and has a mullet, the attractive popular girl is different, as is the true love). The idea of a teen aged were wolf may have had a little live left in it if all the same actors signed and more time was given to writing a decent story and script. Like the first film there was lots of 80s clichés but then it is 80s so maybe that can be excused. The first one made in 1985 made the 80s look cool but this one makes it look horribly dated and retains none of the charm (I think Michael J Fox had a lot to do with making it charming so the new actor didn't help)."
    },
    {
      "title": " Just had my 500th viewing",
      "review": "This is the greatest movie about a werewolf who becomes the star of his college boxing team. What Teen Wolf Too provides:Chubby and Uncle Howard return for the sequel - The worst rendition of \"Do you love me\" ever recorded, then lip-synced by Teen Wolf Too at a party where he jumps 30 feet in the air, backwards, onto a balcony * One of the great movie mullets of all time - thank you Stuart Fratkin * Frog fight * John Rocker's acting debut * Will Smith's acting debut * Two-sport athlete Chubby goes undefeated as team's heavyweight boxer and is on the fencing team, giving us the most far-fetched dual-sporting career for a college athlete * Teen Wolf Too catches a frisbee in his mouth, then signs autographs * Three consecutive montage scenes with no dialogue * Professor Tonya Brooks * The \"I'd like to change some classes\" scene. Better than the last scene of Casablanca * Teen Wolf Too loses his virginity to \"send me an angel\" * Teen Wolf Too punches someone so hard that he flies 15 feet in the air and out of the boxing ring, destroying the press tableIf I had to give it a rating on a scale of 1-10, I'd give it a 4,531,899,376.Derwood Morris"
    },
    {
      "title": " They shouldn't have made a sequel",
      "review": "Well, I love Teen Wolf, and I absolutely hate this movie.  I hate the way they got different actors for Coach Finstock and Stiles. The plot is nowhere near as interesting, the dialogue is not funny, and the musical numbers are terrible.I think that Jason Batemen could have had a decent career if not for the failure of this lousy movie.  I thought that it was much more interesting in the first movie for a boy to find out that he was a werewolf when he thought werewolves were a myth than in this film were a college guy finds out he's a werewolf when he thought he wasn't like all the other freaks in the family.The other thing this film lacked was an endearing love story like the charming affair between Boof and Scott.Save yourself some pain--watch Teen Wolf twice instead of watching Teen Wolf Too."
    },
    {
      "title": " why, God, why",
      "review": "The movie Teen Wolf was amazing. It ranks in my all time top 10 80s films. Michael J. Fox was brilliant as Scott Howard. It was so magnificent when he turned into the wolf and became a basketball player.However, the sequel was terrible. Jason Bateman was awful. The most disappointing part, however was the new Stiles. Like Jerry Levine didn't have anything better to do in 1987.The only reason I ever watched this movie is because it is on the reverse side of Teen Wolf, and I once accidentally put the wrong side in.Your time would be better spent watching Teen Wolf one in Spanish or French, than watching Teen Wolf Too."
    },
    {
      "title": " Why?????",
      "review": "I dont know whats more disturbing the fact that this movie was ever made or the fact that i've actually seen it.... Teen Wolf was a cute, warm hearted and fun little movie that had some nice little moments and the added bonus of the always reliable Michael J Fox starring in it. This cheap little sequel has absolutely no redeeming features and in all fairness should never have been made. I think that the thing that bugs me most about this film is the fact that someone somewhere thought that the great cinema going public would be that sad and that stupid that we wouldn't see this for the 'lets milk this and run' movie that it actually is. Firstly the only reason the first film was such a success is that Mr. Fox was in it so you'd have thought that no Fox would mean no sequel. But no, some bright spark thought 'Hey lets use another character and why dont we make him Scotts cousin and lets make him completely devoid of charm, and hey while were at it lets replace funny Stiles with a new unfunny and rather annoying Stiles.'....bah!!!!! Annoyingly Teen Wolf Too is included on the Teen Wolf DVD which is a shame as i'd rather have seen some special features, extras etc from the first movie instead of valuable space being taken up by this sorry sequel. I could go on and on about how poor this movie actually is but as it's already ranking in the worst movies of all time list i guess everybody already knows."
    },
    {
      "title": " Truly a waste of film.",
      "review": "The first teen wolf was not bad.  A new idea.  This movie, however, had nothing new at all.  It was almost identical to the first, with a different actor and a terrible story.  Kudos to Michael J. Fox for taking a BIG pass at this one!"
    },
    {
      "title": " great as usual",
      "review": "This is another great 80s piece of garbage.  The best role here is Chubby (Mark Holton), who is back from the original.  In my opinion, he is one of the best actors of the 80s and should have won an Oscar for Buxton in Pee Wee Big Adventure.  When you add a fat slob like Holton to a great, highly realistic script, bad hair, porn moustaches and feathers, and mesh hats, what more can you say than this movie is funny.  It is not funny because it's good, but because it is so bad, and yet so realistic.  I feel like doing handstands on cargo vans after this flick.  Please, watch this and take special note of Holton as Chubby and then rent Pee Wees Big Adventure, then kill yourself because you obviously are an idiot!  Mark Holton rocks!"
    },
    {
      "title": " If you weren't there you won't understand",
      "review": "So, before there was Internet , Hulu , Netflix,- back when cable TV was something for rich people- there were video rental stores. These were vast warehouse like buildings filled with videocassette tapes ( yeah this was before DVD ) that you could rent for 24 hrs for about $4.00. If you are too young to remember this then you probably don't believe me. Ask an old person, they'll verify these facts. You can understand that this was a huge, profitable industry. Therefore it was necessary to have thousands of titles to fill the shelves. As a result thousands of puzzlingly worthless films were produced in this era. If you watch teen wolf too expecting a good movie - you have missed the point. Did you expect it to be scary? It's not. Did you expect it to be funny? It's not. Special effects? Nope. What it is is +/- 90 minutes of something to watch that wasn't otherwise available on broadcast TV. There are literally thousands of similarly worthless films from the 80's that were made simply so the rental store would have full shelves."
    },
    {
      "title": " Lousy carbon copy sequel",
      "review": "Clean-cut college freshman Todd Howard (blandly played by Jason Bateman) becomes the star of the boxing team and the most popular guy on campus after he discovers that he's a werewolf. Christopher Leitch's by-the-numbers direction fails to bring any freshness to the hopelessly clichéd and straight-down-the-line grindingly predictable story. Tim Kring's slapdash script not only blatantly rehashes the plot of the far superior original sans any wit, charm, or warmth, but also recycles entire gags and even the central message about being true to yourself. Worse yet, two of the most amusing and entertaining characters from the first one are recast with lesser actors: Paul Sands makes for a terribly glum and mopey Coach Finstock while Stuart Fratkin grates on the nerves something painful as slick hustler Stiles. James Hampton is wasted in a minor part as Uncle Howard and Mark Holton likewise isn't given much worthwhile to do as Chubby. This picture hits its absolute groan-inducing nadir with a simply pathetic song and dance number set to the song \"Do You Love Me?\" and the especially dopey moment when Todd catches a Frisbee in his teeth. On the plus side, Kim Darby tries hard as the sympathetic Professor Brooks, the fetching Estee Chandler delivers an appealing performance as the sweet Nicki, and John Astin hams it up with deliciously lip-smacking brio as the slimy Dean Dunn. Only the climactic exciting rough'n'tumble boxing match manages to rise out of the mire of numbing mediocrity. Pretty stinky."
    },
    {
      "title": " Teen Wolf was good, Teen Wolf Too is horrible",
      "review": "I liked Teen Wolf. It was fun, charming and likable without being a masterpiece. However, this sequel is horrible in every regard. Not even Jason Bateman's hotness can save it, particularly seeing as his acting here is not very good and that's an understatement. The rest of the acting is poor, that is including Kim Darby and John Astin, and it doesn't help that their characters are written so badly. The production values, especially the editing are shoddy, the story is predictable and feels like a rehash and the writing is clunky. Even the soundtrack isn't as infectious this time round. Overall, a horrible film. 1/10 Bethany Cox"
    },
    {
      "title": " 'If this is meant to be some kind of joke you'll notice I'm not laughing.' Yeah, I know how the guy feels.",
      "review": "Teen Wolf Too starts as teenager Todd Howard (Jason Bateman) arrives at Hamilton University on a sports scholarship because of a recommendation from boxing coach Finstock (Paul Sand) who is under pressure from Dean Dunn (John Astin) to win some trophy's & get Hamilton University noticed. Coach Finstock used to coach basketball & Todd's cousin Scott who had great agility & strength when he turned into a Werewolf & hopes that Todd himself is a Werewolf & can help the boxing team out. Todd isn't too interested in boxing & just wants to study science but is forced to take part in competitive matches, while being beaten in the boxing ring by an opponent Todd unexpectedly changes into a Werewolf & wins the match & at the same time becomes a local celebrity who milks his new found fame & popularity for all he can but Todd loses sight of who he is as the Werewolf inside takes control...Directed by Christopher Leitch this was the first & so far only sequel to the surprise box-office hit fantasy sporting comedy Teen Wolf (1985) which starred Michael J. Fox, Teen Wolf Too doesn't star Michael J. Fox & is basically more of a remake than an original film that tries to expand & develop the ideas seen in the original Teen Wolf & instead just blatantly copies them. The only great difference between Teen Wolf Too & it's predecessor Teen Wolf is that basketball has been replaced with boxing in which the central character must prove himself & his humanity over the Wolf. All the themes & ideas of the original Teen Wolf are shamelessly copied here, the high school loser & social outcast turned celebrity by becoming the Wolf, the good girl bad girl problem, the way schoolwork & study suffer, the way he goes from useless weakling to an overnight sporting success &, of course, the central moral message of just being yourself will be enough. Teen Wolf Too is throughly predictable, at over 90 minutes long it feels like it lasts forever & for a supposed comedy it's extremely unfunny, in fact I don't think I laughed once & the majority of the so-called jokes & gags are just plain cringe worthy. From a Frog fight in a biology class to the Dean & his pet Dog to the laid back Coach to the horrible musical montages featuring some hideous 80's pop music Teen Wolf Too is actually quite embarrassing to watch with zero plot (that was a really random twist at the ends up being totally pointless) & certainly not funny in any way.The whole film has a forgettable look to it, sure it's competent enough I suppose but nothing special. The special effects are poor, from the awful Werewolf make-up to the Wolf tail that actress Kim Darby has to wear that looks more like a static duster than the tail of a Wolf. About half way through Teen Wolf Too there's this awful musical number in which Howard the Wolf dressed in a purple suit does a song & dance number at a party with all the other students there joining in & thus making this big dance number which is truly horrifying to watch. Scenes like Howard the Wolf running after & catching a Frisbee in his mouth like a real Dog don't help neither does the fact that it takes half an hour before he even turns into the Wolf.With a supposed budget of about $3,000,000 I can only wonder where all the money went? Apparently filmed at Pomona College in California. James Hampton & Mark Holton are the only returning cast member from the original Teen Wolf while Jason Bateman makes for a bland leading man & maybe the fact his dad Kent Bateman was the producer had something to do with his casting.Teen Wolf Too is a really bad 80's comedy fantasy that is actually quite embarrassing to watch, from the horrible 80's pop music to the lame jokes & gags to the wretched make-up effects one has to say that you would be better off watching the original Teen Wolf again & considering they are both virtually the same film you won't miss anything here."
    },
    {
      "title": " Too awful!",
      "review": "I saw the first \"Teen Wolf\" movie when it first came out on video. The fact that it's taken me more than twenty years to see the sequel should tell you what I thought of the first movie, even though I was in the target audience (teenagers) at the time. Well, guess what - this sequel manages to be even worse! It's a lazy sequel, for one thing following the basic plot of the first movie (Teen is a loser, teen finds out he can change into a werewolf, teen gets drunk with power, teen becomes a real jerk, teen realizes he's been a jerk, teen plays in sports tournament at climax intentionally not using his werewolf powers.) To make matters worse, this time around this plot moves at a snail's pace, with only sporadic attempts at humor (all of which crash to the ground.) Jason Bateman here is a bland presence, alternately being whiny or befuddled. The only good thing I can say about this movie is that unlike many other '80s comedies, this one isn't very dated in its fashions and other cultural touches."
    },
    {
      "title": " A poor show!",
      "review": "Christopher Leitch's direction didn't live up-to my expectations.'Teen Wolf Too' is a major letdown, I enjoyed Teen Wolf, the prequel. But the sequel is a very disappointing.Jason Bateman & some characters add on, the story is almost the same. The first was on Basketball, this is on Boxing. Some sequences for instance, in the 1st J.Fox shows his red-angry eyes to buy beer, over here Bateman shows his werewolf side to get his subjects in shape. And characters like Stiles & Chubby contribute nothing in the proceedings.Acting-wise: Jason Bateman is alright, plus he doesn't look anywhere like a boxer. Others are strictly okay.on the whole 'Teen Wolf Too' just doesn't work."
    },
    {
      "title": " Same exact story as the first in a new, but similar setting.",
      "review": "\"Teen Wolf Too\" can hardly even be called a sequel to the first. It is more accurately a remake. It has almost the exact same plot as the first, except the sport here is boxing instead of basketball. Most of the supporting characters are back, many played by different actors.Scott Howard from the first film, couldn't and I'm sure didn't want to be here, so instead we have his cousin Todd. Todd is going to college on a sports scholarship, even though he's poor at sports and really smart. The Dean, played by John \"Gomez\" Astin, for some stupid reason has a vendetta on Todd and is out to make sure he fails. Of course, Todd luckily figures out he's a werewolf on the first or second day of college, and dumb humor and bad dialog ensues. The first thing Todd does when he finally figures out that he's a full fledged werewolf, is break into perfectly choreographed dance singing \"Do You Love Me?\", which somehow makes him popular. Also his werewolf powers make him a jerk, so the girl he just met thinks he doesn't love her anymore. He also starts a frog fight in science class where all the college students begin throwing dead frogs...but luckily the teacher comes in and says she's disappointed, not caring that these adults just did this. Obviously the writing was just ridiculous.Overall this was a somewhat enjoyable film...in a laughing at it's awfulness way.My rating: 1/2 out of ****. 91 mins. PG for some violence."
    },
    {
      "title": " Not the greatest movie, but remember who it is targeting",
      "review": "I haven't read too many good reviews of this movie and I think that is because the reviewers are forgetting the point to this movie.  This movie was not targeting adults.  I would assume that this movie is directed to kids who are about Junior High age.  A good example of this is the scene toward the beginning in the dance hall.  The president of the university comes up to Todd, who is his pride and joy because he is going to turn the boxing program around because of Todd's super-hero type skills.  What is the first thing that the president offers to Todd?  A gorgeous blonde who he had already met.  After some polite conversation, he grabs her butt, which triggers the wolf to come out of him.  Think back to when you were in Junior High. Didn't you want to be a super-hero type to come in and be a successful athlete and grab the butts of beautiful women?  Like I said, this isn't the greatest movie ever, but I am sure that in 1987, it did have it's audience."
    },
    {
      "title": " I'll admit it, I like it",
      "review": "This is by far the worst rated movie on IMDb that I admittedly like. Maybe it's because I loved this movie and its former when I was a young kid, but I still watch this movie with joy. Now that I'm older, I do see the reason why it is such a poor film. It lacks originality and top notch acting. It is just a college version of the original \"Teen Wolf\" that deems it unnecessary and unworthy of a sequel. However, I really like Jason Bateman and I think he's good in even this film. The only justifiable means that I can use to compare this movie as being better than its former is that it always made more sense to me that a werewolf participate in a combative sport (such as boxing) over basketball. But yeah, I know this movie is crap. But we all have our guilty pleasures."
    },
    {
      "title": " I couldn't stop laughing...",
      "review": "maybe it was the psychedelic mushrooms I ate.It's so incredibly bad, that I laugh every time I think about it.I don't think I could ever watch it again. Certainly not sober, maybe if there were a good MST3K treatment of it.A great example of the greed that runs Hollywood.1/10"
    },
    {
      "title": " So Lets Get This Straight",
      "review": "Todd crams an entire Biology semester learning from scratch almost the entire semesters work (as he never attended most of the classes) all in one nights mega cramathon. And he has sex with a totally hot girl he was awful to throughout the movie in this same nights cramathon. And also cramathon trains from scratch to become a boxer to fight the best boxer at the rival school. Which when at the start of the movie shows he was terrible and knew nothing and was not atheletically gifted in anyway. All in that same one night he does all of this. He then takes the test after no sleep all night. And also then straight after the test takes the boxing fight. Which they make the point of saying the test ends at 3pm and the fight starts at 3pm. This for me is more unrealistic than the premise of someone turning into a warewolf. When I was in my teens I liked this movie. but now I feel a lot of it is cringe worthy. When he catches the frisby in his mouth for example I was thinking thats it I am turning this off now. Jason Bateman is brilliant in it though as he plays the role of Todd very sympathetically and with charisma. And the girl playing the geeky nerd girl is way hotter than the two girls who are meant to be playing the schools hotties. And yet he treats her awful throughout the movie and she keeps coming back to him. Why? Its not like in the first movie where the girl grew up with Scott. This girl barely knew Todd. Its a shame this wasn't better written as this could have been good."
    },
    {
      "title": " Not bad if you treat it as a separate movie",
      "review": "Yes it's no good as a sequel and there's alot of problems but if this was the original and no first film had been made then I think it would have done pretty well. There was no need for a sequel so it got alot of hate. If you enjoyed thr first one then you'll enjoy this one. In some aspects it was actually better. Watch before you judge!"
    },
    {
      "title": " Jason Bateman ended up in this?!?",
      "review": "Teen Wolf Too is the same movie as the last except everything about it is worse I didn't love the first one but my god watching it like this and making it more boring then the first is just painful Some people enjoy this movie but I couldn't I tried I really like Jason Bateman but this is one of the worst things hes been in For me this is one to dodge unless you really liked the first film."
    },
    {
      "title": " Wolf in the ring",
      "review": "On the success of Teen Wolf for Michael J. Fox another Teen Wolf film was certainly in the offing. Fox declined to do the remake probably thinking there ain't no way he was going to be doing college basketball. Jason Bateman got the part for the remake and he plays Fox's cousin. As the film opens it's James Hampton who played Fox's father driving Bateman to college as a freshman.Where of all things Bateman is in on a boxing scholarship. I've never heard of one of these, but John Astin who overacts outrageously as the dean of the college wants a boxing team badly. Maybe even more than Philip Ober did for his army company in From Here To Eternity. Bateman's only activity resembling sports was playing clarinet in the school band.But Paul Sand knows of the pedigree in Bateman's family. He's the athletic coach and where there's one Teen Wolf there might be another. As you would suspect, the inner wolf comes out.Teen Wolf Too is a mediocre comedy with gags borrowed from other and better films of the genre. It's not as bad as some would have it, but it sure didn't create any demand for a third Teen Wolf film."
    },
    {
      "title": " Not the worst...but close.",
      "review": "I only gave this movie a two because I know there are worse movies...but it wouldn't be easy to find them...and who would want to?I was compelled to give this movie a review...but not enough to spend actual time on it.Take my advice...rather than watch this movie, find something better to do...sort your socks chronologically, or something more entertaining.Description? No script, lame acting...sucks is a step up."
    },
    {
      "title": " Cash-in",
      "review": "Nothing wrong with it but nothing really to look at. Not that great to listen to. It was just standard procedure. Terrible script. It just copied the first movie watering it down. The ending was horrible. I really recommend avoiding this cash-in travesty."
    },
    {
      "title": " In defense of Teen Wolf Too...",
      "review": "Ouch, in reading some of these user reviews Teen Wolf Too is really hated. But really, don't lisen to these jabronies, this is not nearly as bad as they make it out to be. Granted, Teen Wolf is a 80's classic, I would not say the follow up is in that catagory. However, if you can overlook the fact that 80's pop culture icon Michael J Fox is not in it, the film really is'nt all that bad. It does try to copy the 1st film in many respects and is not altogether successful. But, even as a failure, it is not a bad film. It does follow the same formula for every 80's teen comedy and while it is lacking someone like Michael J Fox who could knock this out of the park, Teen Wolf Too is far from unwatchable. Jason Bateman actually gives a pretty decent performance, comparing him with Fox is'nt really fair as he is not a superstar or possessing of Michael's unique charisma and screen presence. The film is not nearly as funny as the 1st film either and at times is a bit corny. Either way, Teen Wolf Too is a decent time passer and if you take into consideration that this movie follows a lot of 80's genre conventions and won't blow you away, Teen Wolf Too is passable campy entertainment."
    },
    {
      "title": " Awful and Lazy Sequel",
      "review": "Teen Wolf Too (1987) * (out of 4)Todd Howard (Jason Bateman), the cousin of the teenage werewolf from the first film, finds himself in college on a sports scholarship even though he doesn't play sports. It turns out that Stiles (Stuart Fratkin) pretty much added him to the team hoping that he could have the same wolf powers. When it turns out Todd is a werewolf, his entire life changes.TEEN WOLF was a film that most people make fun of or look at as a piece of trash but I've always had a soft spot for it. Yes, it's quite stupid but at the same time it was a fun movie with some good performances and for the most part it featured a character that a lot of young people could connect with. TEEN WOLF TOO, on the other hand, is pure garbage and the worst thing is that it's pretty lazy and just a boring rehash of the first picture.Everything that happens in the first picture basically happens here, although the quality is much less. You've got a teenager struggling with life who finds himself becoming popular. The teen loves the popularity but soon realizes it is costing him real friends. He soon realizes that the party girl isn't what he wants. He realizes that the party life isn't what he wants. Does all of this sound familiar? If so, I'm sure you know how it ends.Worst of all is the fact that all of the goofiness that worked in the first picture just doesn't work here. Bateman is a complete bore in the picture. Fratkin can't compete with the original actor. Even John Astin is wasted in a boring role. The film has a couple cast members from the original but even they can't add much here.TEEN WOLF TOO is just a really lousy movie that was made to try and make money off of the original. There's nothing fresh or new here and the end result is a real turkey."
    },
    {
      "title": " After you watch it, you'll want know why...to any question about it",
      "review": "You wont know why... anything happened in the movie. The only answer is, it happened in the successful Teen Wolf Movie too. The movie was a terrible sequel to the original Teen Wolf, which was corny, but it has something good. This movie about a guy who becomes the Wolf Todd Howard, tried to but basically did not convey some of the ideas of the original Teen Wolf movie about Scott Howard who became a wolf. That means a viewer who has seen Teen Wolf, will immediately draws a comparison to Teen Wolf when they watch this, but it is a bad comparison. For one thing Teen Wolf conveyed a concept about team work, with the sport of Basketball. Scott Howard of Teen Wolf learns that team work is important. For this movie they tried the same thing, but they picked the wrong sport to relate to teamwork (Boxing), so you don't get the same message. In Teen Wolf, Scott Howard becomes the Wolf and the important guy and gets some attention from the beautiful girl he has been chasing. In this movie, it is not obvious that Todd Howard is chasing the beautiful girl. In Teen Wolf, Scott Howard has a long time girl friend who objects to the wolf, who is not the attention grabbing beautiful girl he is chasing, but someone less attractive, who likes him for himself. In this movie the same part is there, but she is not someone who has been around Todd all his life, and furthermore, she is the prettiest girl in the movie, so the message is not the same. You will probably wonder why when you watch this movie too."
    },
    {
      "title": " Howlingly Bad.....",
      "review": "Although awkward college student Todd Howard is particularly adept at science, he's paying for school with an athletic scholarship that he will lose should he not fare well in an upcoming boxing tournament.Luckily for Todd, he has inherited the same family curse that once turned his cousin into a werewolf.As he transforms into the hairy, fanged, howling monster, he finds both his physical agility and his popularity skyrocketing -- but at what cost.......A cash in in every sense of the phrase TWT is a monstrosity from start to finish. Having to make references every five minutes is desperate enough, but to have two minor actors not coming back to the film, and have them played by someone who looks absolutely nothing like them, you may as well have had Bateman play J. Fox's character.It's a desperate attempt at cashing in on a film that was already cashing on the success of Back To The future. The make up is awful, there are no laughs in the entirety of the movie, and Bateman becomes highly unlikable when he starts to use his powers on a regular basis.And why boxing? Of all the sports the writers could have chose, baseball, Football, Athletics, Running, they choose boxing.It's as bad as people have been saying for the past 29 years, and i'm sure Bateman hates the fact that this is on his CV.But it does have one good line in it.You're wrong, and I'm late.dreck."
    },
    {
      "title": " A Teen Wolf Too Far",
      "review": "If you have watched Teen Wolf, then change out Michael J Fox for his wolf cousin Jason Bateman, replace basketball with boxing and move everything to college not high school and there is no need to watch this pointless sequel. It's a badly made, badly written, badly acted movie. It looked like a cross between a Teen Wold rehash and a discarded Animal House or Stripes style script with a boxing / dancing wolf thrown into the mix. Sometimes films should not have been made and this is clearly one of those times.The only reason I can come up with is that it was the 80's and apparently Hollywood was cocaine filled or so the stories go. There has to be a link, doesn't there? Now for the good points Featured on Episode 71 of The Emerald Reprobates Podcast."
    },
    {
      "title": " Nothing here to see",
      "review": "I didn't really think much of the first TEEN WOLF - an '80s high school comedy starring Michael J. Fox as a werewolf - so I wasn't expecting much from this forgotten sequel, either. Indeed, there's nothing much to see here other than a lame re-run of the first movie, with an added ROCKY-style boxing plot to add some action to the inanity.The problem with TEEN WOLF TOO is that it feels flaccid and badly dated as a high school comedy. The best high school movies are adult rated, delivering raucous entertainment that anyone who's ever been a teenager can readily identify with. By comparison, this is a cheap and cheerful sequel, the 'highlight' of which involves a huge '50s-flavoured dance off with our hero headlining in full werewolf costume.The narrative involves some kind of predictable moral fairytale in which our hero must learn humility and to constrain the excesses of his ego. It's all rather sanctimonious in approach, layered with '80s cheese and the usual stock characters: the nerd friend, the bad guy jock, the bimbos. Say what you like about the original, at least it had the likable Michael J. Fox as the lead, whereas here we're saddled with the annoying Jason Bateman instead. He's no match, and neither is this lacklustre movie compared to the warmly-regarded first film."
    },
    {
      "title": " Most unnecessary sequel",
      "review": "3.5/10 I would give it.Well I loved the original yeah it was corny but a whole load of fun, had a it had great story line and was hilarious . Unfortunately, the same cannot be said for this ''teen wolf too''.It must be said that it is exactly the same as the original but so much worse. Just replace high school with college, replace the sport from basketball to football and replace a charming, adorable Michael J. Fox with a lifeless(but very cute) Jason Bateman.Let's talk about the acting. Ha! I've seen more charisma from cardboard.The most annoying of the bunch was the love interest person how whiny and annoying she was. Okay some parts were funny and the soundtrack was okay- although not memorable. But it just wouldn't end! It's a short film (1.5 hours) but I kept checking the clock cos it felt so much longer than that!Bottom line is watch the original instead of this ridiculous drivel and accept no imitations. Unfortunately, the DVD of Teen Wolf comes with both so I'm stuck with it."
    },
    {
      "title": " Why on Earth did they even make this movie",
      "review": "There seems to be so much going wrong with this movie before you actually put it into the DVD player and press play to actually question whether it is actually going to be worth your time (all one and a half hours of it, and remember that you are never going to get those one and a half hours back) sitting in front of the television screen (or in my case, the computer) and watching it.Okay, we can forgive the fact that Michael J Fox does not return as the lead character. This is understandable considering we are dealing with a new place and apparently new people. Well, that is actually what made me start thinking about this film and that is that as far as I could tell, there was only one actor, and that is the father (James Hampton) that actually came across from the original movie. However, there were a number of characters that came over as well (including Styles and the Coach) but it appears that these actors had better things to do with their time.Oh, the guy that plays Chubby comes over as well, but maybe that was because he was having a lot of difficulty finding work in Hollywood at the time.Okay, now that we have put that aside, I might then go on to suggest that this film reminds me of The Hangover Part II. No, not because it is about a bunch of guys that get outrageously drunk and have to piece the previous night together (though if they had thrown a werewolf into it, it might have made that movie somewhat more interesting) but rather because it is an exact duplicate of Teen Wolf, to the point that we pretty much know exactly what is going to happen. The only difference is because we are dealing with boxing as opposed to basketball, and we are in college as opposed to high school.Oh, we do have mention of those dreaded sports scholarships that seem to full American Universities with semi-literate people we are able to coast through their courses simply because they are really good at sports (and considering that college and highschool football is actually a big money spinner over in the states, I can see why they want to attract the best athletes). However, we must remember that while the athletes may become millionaires (if they are lucky and don't land up like Al Bundy, working in a ladies shoe shop, caught in some familial situation where he is the butt of all the jokes), it is the geeks that go on to become billionaires (unless, of course, you are like me that you did not actually use your geekiness and your intelligence wisely, and ended up wasting your time playing Dungeons and Dragons, and wasting your money buying Magic Cards)."
    },
    {
      "title": " star name correction",
      "review": "In the summary, the author has the main character, Todd, being played by Justin Bateman. This isn't correct. His name is in fact, Jason Bateman. Though he does have a sister, also an actress, by the name of Justine Bateman. hope that clears it up. She is in the film Satisfaction, sometimes called The Girls of Summer, and the shows Family Ties and Men Behaving Badly. Jason is also in Juno, Extract, Arrested Development, Silver Spoons,etc. Maybe one day, Justine will appear in a film called Tween Wolf , but until that time, she had no part in this film. Though not being a tween, perhaps ahe can play the gruff guidance counselor, or understanding principal of the school."
    },
    {
      "title": " An exact copy...",
      "review": "I saw Teen wolf and i enjoyed it.. the first one that is.. it was simple and fun.. original story.. then they decided (I guess) to capitalize on the success of the first one and do a sequel.. which I think it's OK.. but o dear lord.. they did it exactly as the first down to the last detail.. if it wasn't for Jason Bateman, you could swear you were watching the first one.. they could have added a few twists to the story, just to make it different, I suppose the fear of failure wouldn't let them.. you should watch it just to compare.. that would be the only funny thing about this movie. Everything! from the kid being reluctant to accept his condition, the popularity of the wolf, Styles and the wolf merchandising, they just switched it from high school to college and from basket to boxing, the rest was left as it was, but enough with the bad talk.. I have to admit that they did do a great thing worthy of recognition: they put a lot of work and effort to make it look exactly like the first one.. Job well done!"
    },
    {
      "title": " If you loved \"Teen Wolf\", you may want to reconsider watching \"Teen Wolf Too\".",
      "review": "\"Teen Wolf\" was a popular film. So, it's not surprising that the studio would want to make a sequel. The problem was that the star of the first one, Michael J. Fox, hated making \"Teen Wolf\" and refused to make the sequel. It's not hard to understand, as between the two films \"Back to the Future\" came out and shot Fox to greater stardom. So, in a pinch, the studio tossed out many of the original cast and tried to see if they could get away with it. Despite all this, the sequel still made a modest profit....though it also made IMDB's infamous Bottom 100 List. So, according to the list, this is the 62nd worst major release of all time according to users. When the film begins, you see that Jason Bateman is playing Todd Howard....the COUSIN of Michael J. Fox's character from the first film, Scott. Oddly, Scott's father (James Hampton) is in the movie and he's acting the role of Todd's guardian. Todd is starting college (which is odd, as Bateman was 18...and rarely do roles for teens ever actually go to real teens....often they are 21-30) and he's there on an athletic scholarship but apparently didn't deserve it...much like those actors and their kids you've heard about a lot in the news recently. However, in Todd's case he could get killed, as it's a BOXING scholarship! Will Todd's lycanthropy help save him from being beaten to a pulp? And, like every teen film of the 80s, will it help him get the girl?While I was NOT a huge fan of \"Teen Wolf\", it seems like \"Teen Wolf Too\" is a step backward in most every way. The biggest problem is the writing, as some of the characters are one-dimensional and ridiculous caricatures (especially John Astin as the Dean). They also often used slapstick instead of cleverness...and really, really bad slapstick....like the sort of stuff 6 year-olds would enjoy. Hard to watch...and easy to hate. So, while it's bad, is it Bottom 100 bad? Probably not. But I have noticed several other film franchises have the same pattern....a film is loved by its fans and the studios create sequels that simply stink. And, because so much love existed for the first one, there's a backlash and folks not only dislike but HATE the sequels. Some examples on the Bottom 100 are \"The Neverending Story III\", \"Son of Mask\", \"Jaws the Revenge\", \"The Human Centipede II\" as well as \"The Human Centipede III\". The same cannot be said of \"Baby Geniuses\" and \"Baby Geniuses II\" because both films made the list and both films are god-awful."
    },
    {
      "title": " Carbon Copy of the 1st",
      "review": "The story is an exact rehash of the 1st. Todd (Scotts cousin from part 1) finds out he's a wolf, gets cocky, gets the bad girl while neglecting the nice girl. Realizes the error of his ways, he shows up at the final game(in this case boxing) without turning into the wolf, wins everyones respect back and gets the nice girl at the end.Despite what some say this film DOES connect to part 1. It doesn't have Scott but it has Stiles, Coach Finstock, Scotts dad and Chubby. The 1st 20 minutes there's a bunch of references to the 1st movie.Stiles and Coach Finstock are played by different actors. The guy who replaces Stiles does a good job but he looks nothing like the original. The new Coach Finstock acts almost like a completely different character but he's still funny.If you look past small things such as Coach Finstock and Chubby going from basketball to boxing, characters being replaced by new actors, no Micheal J Fox and rehashed story of the 1st movie, you may enjoy this film."
    },
    {
      "title": " Not TOO bad...",
      "review": "Hmm, after seeing \"Teen Wolf Too\" at the #36 on the bottom 100 films, I wasn't expecting much. But merely the fact it rates so low was enough to make me check it out, plus that I liked the first movie. Like the other reviews, I can't really say it's a well-made movie in sense of story, action, script; but I don't find the movie all that bad... it has some nice sequences, especially in the beginning, and I'm positive that I've seen what's worse more than once before. For the 'cash-cow' sequel thing, I didn't think Blade 2 was a much better movie. And that is getting a 3rd...4/10"
    },
    {
      "title": " why why why why why.....",
      "review": "this falls under the categories of terrible sequels like slap shot 2 and speed 2.. god oh god, this movie was absolutely horrendous. i dont know if anyone should ever watch this movie.. i dont know if anyone can watch this movie, come to think of it.. it's as interesting as white copy paper.. and i'm being polite.. please, if you ever bring this movie up in a convo with someone, i hope they punch you in the face really hard."
    },
    {
      "title": " Horrible.",
      "review": "I watched this when I was about 14 years old, as a follow-up to Teen Wolf (which I don't really remember at all, but must've liked well enough to see this).And yes, it sucked. The movie wasn't really about anything, but it was basically really, really horrible. The special effects when people turn to wolves are just .. gruesome.This is not one of those \"fun to see because it's so bad\"-movies. It's just horrible."
    },
    {
      "title": " Well, At Least the First One Was Good...",
      "review": "This lousy sequel (not starring Michael J. Fox - what a surprise!) is basically a re-hashing of the original, only instead of having basketball as the sport in this, I believe boxing is (it's been a while since I saw the film. All I remember is that it was a stinker!).Don't see this movie, especially if you enjoyed the campy prequel.1/5 stars -John Ulmer"
    },
    {
      "title": " it should win",
      "review": "My personal pick for the worst movie of all time. Teen Wolf Too, come on we can do it, make this #1 on the bottom 100, if we all pull together we can do it!"
    },
    {
      "title": " The point of this film is...?",
      "review": "I've seen this film in bits and pieces on television, and can't think of a single reason to rent it to finally view it in one sitting.  Anything one could remotely need to know about the \"Teen Wolf\" phenomenon was covered in the Michael Fox original.  This film also causes one to consider the collective acting talents of the Bateman siblings - where are they now, anyway?"
    },
    {
      "title": " I don't know why people hate this movie so much. I think it's in the three of the best college comedies of all time!",
      "review": "I have been watching Teen Wolf Too since 1987 or 1988. It's a very entertaining, and sometimes funny movie. It's maybe in my top ten of most watched movies ever! Don't believe everything you hear about this movie. I give this movie *** out of ****"
    },
    {
      "title": " so nice",
      "review": "i am the only, how love the movie. its so great to see, if todd dance with the nice girl, wear a suit and tie. but instead of he get an erection, he changed into a teen wolf. how cares, that todd sings and get arrogant and lordly? i am not. the DVD has got not mutch extras, the cinema trailer. and that is one important thing, what i am miss: in the trailer todd stand before a mirror, had got some trouble in a locker room, he ripped his shirt and his fingernails are pointed. outside was stiles ans spoke to todd. then the camera again goes to todd and he hast got pointed and hairy ears and pointet theeth.and this scene was complete deleted in the movie."
    },
    {
      "title": " Am I missing something here?",
      "review": "Usually a movie - - even an awful one - - has to make a ton of money to warrant a sequel. Godfather, Batman, Superman, Star Wars - - Teen Wolf?? When did the original become the blockbuster to earn another telling? Anyway, it's a howling dog of a movie. But you knew that already."
    },
    {
      "title": " Yawn...",
      "review": "Teenager is dull... Teenager turns to wolf... Wolf teenager is not dull... Audience is at sleep... Say no more!"
    },
    {
      "title": " Too bad to be truth...",
      "review": "Jason Bateman is much better than the film deserves, and actually gives a sharp and funny performance despite the mediocre production. We see the same progression in Todd as we had scene before with Michael J. Fox's Scott, where both characters turn on their friends and become real jerks after getting a taste of teenage popularity. The only difference here is that Todd is now playing for the college boxing team rather than a high school basketball team. When topped off with the rather ugly make-up effects, Jason Bateman looks more like a disfigured cat than he ever does a wolf. Paul Sand, Mark Holton, and James Hampton make appearances from the original, with John Astin and Kim Darby joining the cast.Christopher Leitch leaves nothing to chance in this unnecessary sequel, trying his best to recreate the same successes of the first film with very little variance. Still it's the 80's so I can't hate. The story is pretty much a re-hash of the original but is about boxing instead of b-ball and is at university instead of high school. The acting is actually quite good, considering the movie's obvious low budget and overall silliness. The werewolf \"FX\" (ie - make-up) is a little crude but it is done well enough to just about suspend disbelief.Overall rating: 6 out of 10."
    },
    {
      "title": " Excellent Sequel!",
      "review": "Now, I'm as big a fan of the 1985 Teen Wolf as anybody else, but when I heard there was a second movie that came out two years later? Well, you can imagine my surprise!This film has the same atmosphere and the same cinematography as the first one, which really makes me feel like they put some hard effort into keeping up the good name of \"Teen Wolf\"Once again, the performances are superb. I'm glad to see Mark Holton's \"Chubby\" character have more screen time.My one critique is I don't care very much for Stuart Fratkin's portrayal of Stiles. To be fair, it's pretty hard to follow Jerry Levine's performance.Overall, this movie was entertaining from start to finish. It's great if you want a goofy movie to watch with your friends."
    },
    {
      "title": " Teen Wolf Too Rocks The Living Room!",
      "review": "If you liked the very first \"Teen Wolf\" and if any lady viewers thought Marty (sorry, but I love \"Back to the Future\" so much!), AKA young Michael J. Fox, was cute, then y'all will love this next movie in the series, \"Teen Wolf Too.\" But wait! Whatever happened to Michael J. Fox? How did Jason Bateman steal Mr. Fox's spot as the teen wolf? As the \"new George\" from \"George of the Jungle 2\" would say, \"Studio too cheap to pay Brandon Frasier!\" (And that was the part where the DVD would get taken out and thrown in the trash.) Except that this is Michael we were talking about. LOL Still, I think y'all ladies would appreciate having two hotties in two films, huh? (I know I'm a man writing this, but I'm a ladies man, you hear?) Do go watch these two movies; you'll fall in love!"
    },
    {
      "title": " aptly titled",
      "review": "well, it's exactly the same as the first movie, except that the teenwolf is not played by michael j. fox, it is played by jason bateman, and instead of being a basketball player, it is a boxer. i was thinking, \"sequels are made to continue the story of another movie\" but then i realized that this movie is not titled Teen Wolf II, it's titled Teen Wolf TOO. and yeah, jason bateman is a teenwolf too. and a lame one at that. therefore the movie could have been called \"the other teenwolf who is lame\"."
    },
    {
      "title": " Teen Wolf Too is the greatest movie I've ever seen!",
      "review": "People leave Teen Wolf Too alone! The movie is Ok! It's just as  good as the first. Jason Bateman was brilliant! I give this movie a perfect ten. I recommend it to everyone. You all should watch it and see for yourselves. I guarantee it! You won't be sorry!"
    },
    {
      "title": " Just When You Thought It Could Not Get Any Worse",
      "review": "Man this is a scary world we live in.  It is amazing to me that a movie as awful as \"Teen Wolf\" could make enough money to warrant a sequel.  It did though and the result is a film that is even worse than the very poor original.  This time Jason Bateman learns that he can become a werewolf whenever he wants to once he starts attending college.  He turns out to be the cousin of Fox's character from the first film.  Sophomoric and amazingly bad, send this wolf out to slaughter.  Turkey (0 out of 5 stars)."
    },
    {
      "title": " Terrible Film but great commentary by me",
      "review": "Horrible sequel to a bad film.  Bateman has shown his lack of acting ability on that show he had in the 80's but this film is definitely brutal. Perhaps the only redeeming social value is the fact that even the ECW has better wrestling than this film."
    }
  ]
}