{
  "DowntonAbbey(2019)": [
    {
      "title": " A superb production...thoroughly enjoyable!",
      "review": "As ever we have the Downton high quality production values in a cinema setting. Fantastic acting and cinematography. The narrative a tiny bit far fetched in places but hey ho this is sumptuous and real entertainment. I am very tempted to give it ten stars because you leave the cinema with a warm feeling. Congratulations to Julian Fellowes and the fabulously talented creative and technical team."
    },
    {
      "title": " Nice costuming.",
      "review": "Spoilers. Opinions. Observations. Reflections.Nice costuming. The most standout are the red vests/uniforms worn by the royal servers.I also liked the women's costumes. Even Lady Edith looked pretty good this time, plus her period-era one-piece undergarment showed some cleavage and inferred a little sexuality - being that she was finally married to a decent chap and even in the early stages of yet another pregnancy. Whew, that was long-winded.I enjoyed seeing the old cast. I was disappointed that Barrow was no longer the conniving scoundrel that he had been in the TV series. I was happy that O'Brien was not in the film, but perhaps she, too, may have become sugary sweet. Ugh.The family started out poor, for aristos, since they had to be bailed out by Shirley MacLaine's family money at the beginning. Toward the end of this film, they are still trying to put their heads together to think of ways to keep the property financially afloat.Irony: Highclere Castle, the estate in real life, today has events and tours in order to keep the property financially afloat. Renting it out to make the TV series and this film is just one of its money-making ventures. Gotta pay the light bill, you know. Pip, pip. Cheerio.King George V and Queen Mary of Teck were the paternal grandparents, in real life, of the current Queen Elizabeth II of England. They were the parents of King George VI, Elizabeth's father. They were also the parents of King Edward VII, Elizabeth's uncle, the famous abdicator."
    },
    {
      "title": " Wonderful sets!",
      "review": "I forgot to mention how wonderful the sets were. I especially liked the trains, trolleys, automobiles and trucks.And, I do hope that Disney does not buy this franchise and ruin it like they have done to others."
    },
    {
      "title": " Priceless Gem",
      "review": "This movie is pure perfection. It is a wonderful continuation of the TV Series. I think reviewers do not know how to rate this movie because it is just delightful. There is no violence, foul language, and nastiness between characters. It's just a love letter to the fans. Julian Fellows has done a brilliant job with the script and has brought the production level to the next level. Go see it if you want to leave a movie feeling good and smiling."
    },
    {
      "title": " Predictable",
      "review": "All the hype didn't live up to the reality .I would have fallen asleep IF it had not have been for the wit of Maggie Smith . She made that film .They should have kept it to the Tv screen"
    },
    {
      "title": " Elegant as Ever",
      "review": "I enjoyed the movie as much as much as I did the TV series. They kept the personalities of all the characters the same, along with the same enjoyable relations. Also, I noticed that those who were without love in their lives (Tom Branson, Thomas Barrow), were provided someone in which to start a budding romance. The movie was the perfect length of time and was pretty much perfect in ever way except when Granny Gratham revealed she was dying. The viewers didn't need to know this. Kudos to Julian Fellows and his quirky and lovable characters."
    },
    {
      "title": " Downton Abbey",
      "review": "The TV series continues with the king and queen visiting the house.The wisdom here is that instead of trying to create something different for the cinema, the makers have essentially given fans what they want - more of the same, albeit on a larger scale. All is as it should be, with little in the way of threat, Smith getting all the best lines and the characters beloved by millions all getting a chunk of action. The only criticism is that too many stories are closed off with various conversations in the last 15 minutes which does go on. This is a minor quibble - a pleasant bit of fluff to be sure."
    },
    {
      "title": " A Postcard of Love to the faithful.",
      "review": "With wit, charm, grace and a bit of larceny, Downton Abbey has returned to us. I will leave the nit-picking to others, while I simply say it was a joy to watch our old friends return in this splendid movie. Yes, a couple of my cast favorites, were up on the screen less than I'd liked, but balancing out a cast of 20 is an art, and I'm sure Julian Fellows the showrunner, creator of the film entity knew he'd have to sacrifice a little to pull this story together.I'd love for this film to find its audience, thus assuring us at least one more romp through the estate. Fingers crossed. Now go see it. It's wonderful."
    },
    {
      "title": " Will bore you to Death",
      "review": "Wow so disappointing Boring!!!! Where was the opulence, all it was stupid mini stories with happy childish endings."
    },
    {
      "title": " Great High Quality Television Drama ! Magnified ?",
      "review": "I'm a keen fan of Downtown Abbey as a Television Drama so I find it difficult to rate or critique Downton as a Cinema release. Why? you may ask. I enjoyed the movie to a point because Ive also enjoyed the 52 episodes of the 6 series on television . However I don't really think it makes a great movie transfer although it's entertaining and enjoyable. It has all the high quality wit and sumptuous surroundings of the original TV series and creator Julian Fellowes is a master of portraying the Upstairs/Downstairs world of the Aristocracy and the snobbery from both sides of the divide.No spoilers from me other than anybody who saw the trailer knows the entire movie centres around a Royal visit to Downton Abbey from King George V and Queen Mary. All the usual performances are as good as in the Television production but I really enjoyed the addition of Geraldine James as Queen Mary and Imelda Staunton as Lady Bagshaw cousin to the Dowager Countess Violet Crawley played beautifully as usual by Maggie Smith .Anyone who enjoyed the Downton Abbey series will surely enjoy making acquaintance with all their favourite characters again but I'm not sure the big Cinema screen didn't make them seem more like soapy cardboard cut outs at times. PS. As Mathew Goode heads the cast list on IMBd I expected to see more of him than just a walk on at the end, most disappointed as I think he would have made Lady Mary Crawley played by Michelle Dockery happier and less austere and irritating."
    },
    {
      "title": " Disappointing",
      "review": "I am a HUGE fan of the television series! It was full of breathtaking cinematography, beautiful music, award winning set design, and splendid fashions and costumes. All of this set the tone and backdrop for a story full of interesting characters whose lives were riveted by tragedy, war, love found, love lost, betrayal, class distinctions and money blues! Character development is a luxury that can be explored in depth in a television series with lots of seasons and several episodes, I get that! However, it's no excuse for a movie that cannot stand on its own! You should not have to have seen the television series to understand and enjoy the movie! Watching Downton Abbey on tv...I laughed, I cried and my heart was heavy during the last episode as Crawley & Company faded to black. This movie though was flat, even feeble attempts at humor were forced. The big drama was a royal visit? I refuse to make excuses for lack of character development, life altering issues, real drama and no tears shed here! This isn't real and quite frankly an insult to the television series so brilliantly portrayed. All these \"10\" reviews make me wonder if I saw the same movie. Disappointing and quite frankly forgettable!"
    },
    {
      "title": " What I Expected",
      "review": "I've seen it twice within a 48 hour period, once by myself and then with a friend. \"Downton Abbey\" was what I expected. It was like watching two one hour episodes strung together. It was like being in my livingroom on a Sunday evening, only with a much larger screen. My idea of a wonderful way to spend a couple of hours. The core characters haven't changed, the sets haven't, the introduction of new characters. It transports me to an era that I don't think exists very much anymore, unless you're part of or involved somehow with the British Royal Family. Maggie Smith was, again, ready for one of her tart remarks that made me chuckle. Well, now that the Crawley family and their devoted servants have survived a royal vist from King George V and Queen Mary, I say bring us more! I can see at least two more films from this. How does the Crawley family survive the Great Depression and the Second World War."
    },
    {
      "title": " The series is dead. Long live the franchise!",
      "review": "Appealing characters and superb casting have always been the chief ingredients in DA's success. The film gives us a panorama--a three-ring circus--peopled by them. Lame plot devices continue to be a part of the charm. For the first third, the dialogue gets too cute and clever by half. But it recovers from that in good time. I look forward to what the depression and WWII will bring. As a car guy, I lament the automotive anachronisms. While Branson was still a chauffeur in 1919, His Lordship somehow acquired the maroon 1924 Sunbeam limousine that appears in nearly every TV episode. But somehow, it is absent from the film. (Was Matthew's not the only car crash?) By 1927, the Downton men have become a Ford dealer. A glimpse of Model Ts in their showroom is all we get of this potentially interesting development. The king arrives in a then-ancient brass era Napier with acetylene headlights. Producers, please make use of the help the collector car community has to offer!"
    },
    {
      "title": " Very good follow up of the tv show",
      "review": "Been a fan of the tv series for a long time it was a great experience to see all my favourite characters on the big screen excellent performances from all cast great screenplay really enjoyed the film and I could watch it a few more times in cinemas"
    },
    {
      "title": " Soapy with a Touch of Knots Landing",
      "review": "I do love this movie, despite the fact it is due to my affinity for the English monarchy and such beloved characters having watched the TV show. It's very rare you see such an ensemble cast repeat their performances on the big screen. The movie suffers from *many* \"they didn't do that in the 30s\" moments, but the flowery writing that sounds taut and crisp, coupled with characters who are old fashioned, yet progressive for their time, makes this easy on the eyes.Not sure what the future holds, but if Lady Mary Crawley becomes the new Dowager Countess of Grantham, I would fall of my chair seeing more movies take on WWII, etc. Clearly, this version of \"The Crown: Rural Folk\" works seeing history through the eyes of characters you invested in making it worth it.I wish there was more emphasis on the royal visit including more chronicling of the pomp and circumstance, dishes being served, and the attention to details (i.e. Victorian Kitchen, Babette's Feast, etc.) The movie version had an opportunity to leave a few characters off the screen and deliver more of a movie than 2-hr episode of the TV show. But, really can't complain when you're a fan of the series. Possibly, the best scene of the entire TV show was when the news was delivered the morning after the Titanic sank. Seeing the morning routines, bells ringing, curtains being drawn open, etc. A history class in procession. Downton Abbey doesn't come that close to the original magic and delves into everyone's live (literally everyone) and keeps the characters honest.The story is about the King George V and Queen Mary stopping by and reconnaissance crew sent ahead of time stir the pot with the Downton staff by being told to stay away from the event and to leave it to the experts. The staff \"Revolt\" to put it mildly (more like a college prank) and take over and serve the highnesses bangers and mash and Cornish pasties instead (ok that part I embellished). They pull it off, but there's an attempted assassination, a dress arrives 2-sizes too large, and a wonderful orchestra that plays exquisitely. The bitter banter between Isobel Crawley and Dowager Countess of Grantham abates slightly, but there's more of one-liners and it's funnier. There are tears shed, but will not give away too much."
    },
    {
      "title": " Wonderful to have them back!",
      "review": "I was SO excited for this movie to come out, and literally counting the days! I, like many others, miss Downton Abbey dreadfully, to coin a phrase from them. It was good to see the characters, see the sets (especially on the big screen, where you can see much more detail), but I found the story lacking. It wasn't so much that it didn't have oomph, it was more that I thought the characters, particularly the downstairs ones, were acting out of character. I can't say more without a spoiler alert, but it was disconcerting. I would have so much rather got caught up with all of their lives, and the ins and outs of that. I was happy for Thomas however! I do hope there will be several more Downton Abbey movies, and I will happily go to them, but if you're expecting--as I was--that since it was fabulous on TV it will be even better at the movies, well that's not the case."
    },
    {
      "title": " Stuffy Stodgy Royal Aristocratic Fun",
      "review": "I only have seen a few episodes of the TV series. The question though is does this movie succeed on it's own? Yes, it does as the understated but hilarious humor that is done better by the British is much in evidence here.The film takes place in the past and while the year is not stated, nor important, the setting of it is done well. The original sets from the series are used and the film does not fool around with taking itself seriously, but does well with it's main strength- devloping sublte subplots around it's large character cast.There is a rebellion, and insurrection, thievery, scandal and cheeky humor, all without viollence and special effects. It is done brilliantly. The audience applauded at the end of the film, quite rightly. This is a very successful turn of tv into a feature film, and that is not done this successfully very often. It does have to skim the surface a bit on some of the plotting, but then to go into too much detail with this many goings on would have required a 3 hour movie. That would be too long and too stuffy. This one is done right.Even though I have only seen a few snippets of the TV series, I enjoyed this little trip back into the era of stuffed shirts, and sublime plotting. Yes, and there's plenty of room to do this again, in another film. There was a trailer from the producers of this of a film next year set in this era. Will be interesting to see if they can duplicate the success here with a different plot and set of characters."
    },
    {
      "title": " Refreshing...",
      "review": "We love the TV series and could not wait to see this movie. When we arrived, afternoon matinee, the theater was full! So, we knew we were not alone in being Downton fans. The story line was great, the cast was great (as always), and done with original style and splendor of the TV series. We loved it!Our only disappointment was pushing the Hollywood gay agenda on us once again. We have nothing against these good folks, but, it does not have to be in every movie or show on TV... folks do get tired of it, thus the reason for not giving it 10 stars.However, overall, we enjoyed the move and being able to see all of our Downton cast members again."
    },
    {
      "title": " A sheer delight from start to finish",
      "review": "For those of us who loved Downton Abbey dearly, it's beautiful heart still beats through this nostalgic fun movie. The characters are well written; even the new ones and the beauty of what was a delightful era for the privileged and those who were fortunate enough to work for them. If you loved the series then this should be a real winner!'"
    },
    {
      "title": " Does not disappoint!",
      "review": "Excellent and thoughtful recap by Hughes and Carson. Must see!"
    },
    {
      "title": " Julian and the Cast Have Done It Again! Bravo!",
      "review": "Julian has taken one event and created all of the plots and actions that we have come to love. The cast performed extremely well. It was as if we never missed a beat between the TV series end and this movie's beginning. My wife and I loved it"
    },
    {
      "title": " WHY DOWNTON ABBEY WORKS SO WELL ON THE BIG SCREEN",
      "review": "Let's get right to the point here: If you missed the PBS TV Series, Downton Abbey, which ran from 2010-2015, then you may have a difficult time easing into this beautifully executed feature film of the same name. Conversely, if you committed to watching the entire TV series (52 episodes plus a beautiful finale), you will be amply rewarded in more ways than simply seeing your favorite UK historical soap opera brought back to blazing life on the big screen.It's been 3 long years and a quite a lot has transpired since we last visited the Grand Old Mansion and her lovable occupants. Downton Abbey (2019) gently picks up where the series left off in 2015. It is 1927, roughly two \"television years\" have passed since the Downton Christmas Special. For me, it felt like I was attending the best homecoming I could ever imagine. You can put aside any fears you have, because with a few exceptions the Downton gang is all there: Mr. And Mrs. Crawley, Lady Mary, Lady Violet, Lady Edith, Tom Branson, Mr. And Mrs. Bates, Carson and his wife Mrs. Hughes, Mr. Molesley, Thomas Barrow, Daisy, Mrs. Patmore, and many more, plus some new characters that quietly stir things up for the Abbey's wealthy and \"not so wealthy.\" How can I best describe the experience? In baseball terms, Downton Abbey isn't a mere home run - It's a freaking Grand Slam!All of the actors, creator/writer Julian Fellowes, and director Michael Engler deserve genuine Oscar nods for preserving the beauty and continuity of this wonderful canvas. Downton is bigger than life this time around, even though it is the same house, the same village, the same theme music, and the same general sub-plots. Obviously, this franchise supports a very large and talented cast, and because of this, a few cameo appearances simply don't get enough screen time to make an impact. Nevertheless, the focus remains consistent, with emphasis on dialogue and character development, and the payoff is huge.Given the number of great films that have emerged in 2019, Downton Abbey manages to satisfy its fan base as well as create enough enthusiasm to warrant a sequel. For Downton's writers, the question of \"Where do we go from here\" has been dutifully addressed. The answer is, \"Anywhere we want!\""
    },
    {
      "title": " Should have been Christmas special on TV",
      "review": "Very beautifully filmed extremely predictable story with non-developing characters that do exactly what you would expect from them."
    },
    {
      "title": " Nice Final Episode",
      "review": "While far from a perfect film, this nicely takes the concluding chapters of the TV show and lets us see the principle characters one more time. When it is announced that the King will be coming to Downton, everyone springs into action. All the silver is polished and all the rooms made ready. The problem is the staff of his royal highness is being brought on board and they are rude and inconsiderate. So the downstairs folks find a way to rebel. We also see the fate of Downton when the Crawley's are no longer there. I won't go into detail. The cinematography is gorgeous and each character receives a kind of closure. Maybe it's a bit contrived, but it still works quite well."
    },
    {
      "title": " Adored seeing Downton Abbey on the big screen",
      "review": "If you loved the series you will enjoy the movie! Seeing my beloved characters again brought a closure I didn't even know I wanted. I'll likely see it again."
    },
    {
      "title": " Beautiful tribute to the show",
      "review": "Amazing, I cried happy tears multiple times during the film. If you are a lover of the show you will L.O.V.E. the film. I plan on seeing it a second time! Please go see it, it beyond worth it!"
    },
    {
      "title": " Most enjoyable",
      "review": "An excellent follow-on to the TV series,hopeful of more to follow."
    },
    {
      "title": " Here here. Keep a stiff upper lip, my manal",
      "review": "British always act like the have a stick up their arse. This movie exemplifies that. The first hour is raaathar boring, but I liked the scenes and royalty privileges. The second half of it gets more interesting and enjoyable, as we see the effect on the manors staff when the kings entourage takes over during their visit. I never could see the ooohs and aaahs of the Brits around their royalty."
    },
    {
      "title": " It won't work unless you've watched the TV series",
      "review": "Downton Abbey (2019) was directed by Michael Engler. We loved Downton Abbey as a TV show. The film is like two more episodes of the show. A few new characters, but mostly everyone that we knew before is back.Michelle Dockery as Lady Mary is still beautiful, Maggie Smith is still fabulous, and Jim Carter as Mr. Carson is still the world's most perfect butler.The film assumes that you know the characters, so there's not much backstory. It's fine if you do, indeed, know who everyone is both upstairs and downstairs. Only a few new characters are introduced, so you can sort them out pretty quickly.We saw the movie at Rochester's excellent Little Theatre. It won't work quite as well on the small screen. However, don't forget that we all originally watched the show on the small screen. Still, director Engler has some great outdoor shots, which make the production values appear even more lush.Downton Abbey has a very high IMDb rating of 7.9. I gave it a 7.0, because I thought that director Engler could have had more creative, better plots. It's still a must-see if you're a Downton Abbey fan. If you're not familiar with the show, learn some of the basic plot lines before you watch the film."
    },
    {
      "title": " Love the series",
      "review": "I love the series, the Crawleys and their household, but the film lacked something new and didn't bring anything new to their story. Still I do love them and I want more of them."
    },
    {
      "title": " Amazing for the fans",
      "review": "Great movie for fans of the series. Never wanted it to end hopefully there'll be another one"
    },
    {
      "title": " Downton Abbey",
      "review": "The TV show was a worldwide phenomenon, lasting for six series, and some specials, gaining millions of viewers, critical acclaim, and winning and nominated Emmys, BAFTAs, Golden Globes and many other awards, there were always rumours that creator and writer Julian Fellowes would bring it to the big screen, and it happened! Basically, set in 1927, Robert Crawley, the Earl of Grantham (Hugh Bonneville), receives a letter from Buckingham Palace announcing that King George (Simon Jones) and Queen Mary (Geraldine James) are coming to Downton Abbey as part of a royal tour through the country. His daughter, Lady Mary Talbot (Michelle Dockery), and son-in-law, Tom Branson (Allen Leech) are also informed, and are also excited about their visit to Downton. But the Robert's mother, Violet Crawley, Dowager Countess of Grantham (Dame Maggie Smith) is not as excited, as Queen Mary's lady-in-waiting, Maud, Lady Maud Bagshaw (Imelda Staunton), will also be coming. Lady Bagshaw is Robert's first cousin once removed and the two families have fallen out over an inheritance issue. The staff are informed that the royal staff will be joining them, but when they arrive, they are insulted by their arrogance. They are offended that Mr Wilson, Royal Page of the Backstairs, (David Haig) is insisting that only the royal staff will be serving the guests at the future gathering. Lady Mary believes that Thomas Barrow, Downton Abbey's butler (Robert James-Collier), may struggle, so she asks Downton's retired butler, Mr Carson (Jim Carter), to temporarily resume his former duties. Barrow is upset and strongly protests to Lord Grantham, who is impressed with his integrity. He tells Lady Mary that Barrow will not be sacked. Downstairs, the plumber who arrives to repair the broken boiler flirts with maid Daisy (Sophie McShera), upsetting her fiancé, footman Andy Parker (Michael Fox). A man named Major Chetwode (Stephen Campbell Moore) arrives in Downton village, Tom suspects he is a royal detective involved with security for the royal visit. The Royal parade takes place in the village, Chetwode finds the king on his horse awaiting the Royal Artillery. He aims a pistol at the king, but he is disarmed by Tom, and Chetwode is arrested. Tom meanwhile has met and formed a mutual attraction with Lady Bagshaw's maid, Lucy Smith (Tuppence Middleton). The household is completely taken over by the royal visitors and their entourage. The king informs Bertie Pelham, the Marquess of Hexham (Harry Hadden-Paton), that is to accompany the Prince of Wales on a three-month Tour of Africa. Bertie's wife Lady Edith (Laura Carmichael) is pleased but also upset as she is now pregnant and will give birth after he departs. In the garden, Tom finds a woman crying, he is unaware she is Princess Mary (Kate Phillips), they have a meaningful conversation. Meanwhile, Anna Bates (Joanne Froggatt) discovers that Miss Lawton (Susan Lynch) has been stealing from Downton Abbey, she agrees to say anything as long as the items are returned and a ballgown is altered. Downstairs, Anna and John Bates (Brendan Coyle) have a plan to retake the household and restore Downton's honour, the staff agree but Mr. Carson is reluctant. Barrow and Richard Ellis, the King's Royal Dresser (Max Brown) implement the plan, tricking most of the royal staff, including Mrs. Webb, the Queen's Royal Dresser (Richenda Carey), into returning to London. Mr Wilson is tricked into being locked in his bedroom, and Monsieur Courbet, the Royal Chef (Philippe Spall), is drugged with sleeping tablets. Barrow and Mr Ellis go for a drink together, then Barrow meets Chris Webster (Perry Fitzpatrick) who invites him to a club. The secret nightclub is full of patrons that mostly gay men dancing together. The police later storm in and arrest everyone, Mr. Ellis finds out what happened and uses his position within the Royal Household to get Barrow released. After, the two confide about their respective homosexuality, and Ellis later gives Barrow a silver locket as a memento until they meet again. At dinner, the king is impressed by the revised menu and praises his chef. Mr. Molesley (Kevin Doyle), quick to defend Downton, responds that Mrs. Patmore (Lesley Nicol) prepared the dinner and that the Downton staff are serving it. Everyone is stunned by Molesley speaking to the king without permission. Robert apologises for Molesley's outburst, but the queen praises Mrs. Patmore's cooking and tells Cora Crawley, Countess of Grantham (Elizabeth McGovern) that they are accustomed to people behaving strangely around them. Violet confronts Maud about choosing Lucy instead of Robert as her heiress. But Isobel Merton (Penelope Wilton) correctly guesses, and Maud confirms, that Lucy is her illegitimate daughter, Violet understands that this decision is out of love. Henry Talbot, Lady Mary's husband (Matthew Goode), arrives home in time to accompany the family to Harewood. The king is thankful towards Tom when Princess Mary tells him and the queen that she has been influenced by him to remain with her husband. Violet talks to granddaughter Lady Mary that her trip to London was for medical tests, she reveals that she has little time left to live but reassures her that Downton's legacy will be safe in her hands. The king and queen congratulate Edith and Bertie on their forthcoming child and announce that Bertie will not go on the tour. Back at Downton Abbey, Mr. Carson and Mrs. Hughes (Phyllis Logan) discuss Downton Abbey's future. Carson asserts it will stand for another hundred years with the Crawley family still living in it. Also starring Raquel Cassidy as Miss Baxter, Mark Addy as Mr. Bakewell, James Cartwright as Tony Sellick and Douglas Reith as Lord Merton. All of the recurring actors we recognise from the show are great, especially Smith with her signature disdainful put-downs, and new cast members Staunton and Haig are welcome. It is a very basic story, a royal visit to the English country house in the Yorkshire countryside, it is essentially the sort of thing you would get in a Christmas special, good acting, good script and good costumes. But you wouldn't expect anything different, it does exactly what it says on the tin, a nice simple and charming story of life upstairs and downstairs in the old days, nothing very dramatic, apart from an assassination attempt, some knick-knacks stolen, and an inheritance feud, a likeable enough period drama. Worth watching!"
    },
    {
      "title": " TV plots were so much better than this.",
      "review": "The costumes and scenery for this movie are fabulous. It was pleasureful to see the cast again but the story was just not as good as the plots we saw during the TV show. The downstairs story was like something from the Mickey Rooney days- let's have a show. Unreal idea that the staff could take over service as they did. I would have liked to see Daisy's story become more. It looked promising when the plumber entered but disappointed. And Mary was so alone until the end. Everyone ended up happy. Very little drama."
    },
    {
      "title": " Fantastic",
      "review": "I loved the Downton Abbey movie, but the limits of a movie were very evident. The plot lines were probably best served and fleshed out in the series format, because every story line was glossed over and resolved too quickly without being set up properly. That said I loved every minute of it and could have sat through another hour. There was enough story lines left unresolved for the next movie; Downton Abbey-Requiem of the Dowager!"
    },
    {
      "title": " The next chapter of an epic story",
      "review": "Julian Fellowes brings back all the magic of Downton as we live through the next chapter of the Crawleys and their loved ones. Never one to miss out on a historical reference, the denizens prepare for the arrival of the King & Queen.The script retains its trademark wit with Dame Maggie leading the way as the Greek chorus. There will be love, laughter, and tears throughout.Not to spoil the story, but there is a secret that intrigues viewers and sets up a great story for the next movie.When the original show went off the air, we felt like we were saying goodbye to dear friends. Now, they have come back and you'll not want to let them go.Hopefully the next chapter will contain Lady Rose, Denker, Spratt, and Aunt Rosamund. (And hopefully Mary will ditch her very boring husband!)"
    },
    {
      "title": " If you're a fan, go see it.",
      "review": "I've read a lot of nonsense from critics and after seeing it last Thursday at a special showing, I have to disagree. The story had some cheese and some schmaltz here and there, but some of the plot lines in the show have had those same issues. The cast is magnificent, costume and set design was beautiful.. and being able to see it on the big screen just made me love the show that much more. Ignore the cranky critics - if you're fan, go see it."
    },
    {
      "title": " This is everything I was expecting and more.",
      "review": "The long anticipated film finally arrived and it did not dissapoint. This film gave me everything I was wanting. Quite simply it was perfect."
    },
    {
      "title": " Not recommended -Worst movie",
      "review": "This movie has no story, full time waste, it is not worth the money."
    },
    {
      "title": " For fans of the series...",
      "review": "Basically a very good 2 hr TV special made for the big screen. It gave all of the visuals a bit more substance. Worth seeing, but wouldn't lose much if watched in the comfort of your own home."
    },
    {
      "title": " haven't seen the series...",
      "review": "...but i enjoyed the movie. The imagery was gripping, the characters enjoyable, i guess i will watch the series eventually :) Maggie Smith was a triumph! Although I wasn't expecting big twists and turns, I would've expected a more intense screenplay."
    },
    {
      "title": " Fan of the series? Then you won't be disappointed",
      "review": "Equally as brilliant as the TV series. Maggie Smith at her best as usual, as were the rest of the cast. The set, the storyline, the acting all brilliant."
    },
    {
      "title": " As a fan, the film is about perfect!",
      "review": "I admire Julian Fellows and his writing style. How he is able to have a parade of characters varying in depth and degree while making them all interesting to watch is an achievement few can have. The. We have the cast who bring the words to life and breath nuance into them and they all perform tremendously in their return to these well eastablished characters. My only issue are small story elements that feel a bit shoehorned to provide a little action. But other than that, I love this historically fictional world we have been graced with and can't wait to see if they will decide to continue ur this story and if not then a humble ending to a beautiful story."
    },
    {
      "title": " Never seen the show but decent movie",
      "review": "Ok, I've seen one episode. But yeah, I knew close to nothing about Downton Abbey going into this movie. It was pretty good but it seemed to drag on a little in some parts, especially in the first 45 minutes or so. I definitely think it would have made the movie better had I known more about the characters and felt that nostalgic connection with them. From my ignorant standpoint, it was a decent movie with an ok story and some cute romantic scenes. I wouldn't need to see it more than once or twice, especially without knowing anything. But it does intrigue me enough to maybe start watching the series."
    },
    {
      "title": " Golden Agr",
      "review": "For a devoted fan of the TV series I was worried that the ambience would be lost on the big screen. I had nothing to worry about. The acting and the sets were excellent. Maggie Smith deservedly stole every scene she was in. I hope there will be a sequel perhaps set during the Second War."
    },
    {
      "title": " Smooth, cleaver and very witty dialogue, well worth it!",
      "review": "I have only seen a few episodes, and I got lost with some of the characters but this is a wonderful movie. Excellent soundtrack, great repartee, scenery is so perfect, and several entertaining side issues that will not distract you from the heart of the movie. It will leave you feeling warm and fuzzy. You will not be disappointed. I'm surprised the overall score isn't closer to 9 than 8."
    },
    {
      "title": " What a wonderful ensemble!",
      "review": "Why can't Hollywood put our movies like this instead of rehashing the same old stuff with more sex and violence added, especially Disney.The moved stood alone from the series, so, even though I never watched the series I was able to follow the plot. The only thing I had to do was have my wife tell about some of the characters that came from the original series.For me, the standout characters were Lucy, Tom, Mary, and the butler (retired) Carson."
    },
    {
      "title": " Comforting",
      "review": "I thoroughly enjoyed this film because it contained all the ingredients of the tv series. Our favorite characters field a royal visit and the royal entourage messes with Downton Abbey's downstairs staff. Mosesley was especially humorous whilst suffering an acute case of royal awestruck. The plot was really well done, giving each character enough screen time. Some might complain Lady Mary didn't have much presence, but she was never my favorite anyway. Daisy was as lovable as ever, Anna was as practical as ever, Cora was as daft as ever, and Violet was as nasty as ever. The costumes were really beautiful."
    },
    {
      "title": " A movie length finale",
      "review": "Wraps up the TV series very well, a must for fans of the series. Enjoyable even if you haven't watched the series, though you may struggle with some of the finer parts of the plot."
    },
    {
      "title": " A money making exercise?",
      "review": "I sat down to watch Downton Abbey trying to think if there as ever been a good movie made of a successful tv series. Can't say that any movie sprung to mind.Having seen Downton Abbey got to say that this will be another movie that doesn't quite live up to the tv series in my opinion. The running time is 2 hours, so a number of the movie plots are very rushed in comparison to the time they are given in a tv series. It seems that if a character didn't fit into the overall plot of the royal visit to Downton then they had their own sub plot. The movie isn't terrible and the characters are very much the same as they were in the tv series. Can't say I was a fan of the lighting of the movie unless the cinema was having problems with projection.If you were a fan of the tv series you'll find the movie very watchable, but if you didn't watch the tv series you should probably avoid the movie."
    },
    {
      "title": " Downton Abbey -",
      "review": "Costume drama set in the late 1920's.The big screen adaptation of a highly regarded British TV series, staring some of the cream of British acting royalty. The theatre was packed with a much older audience (I'm older but all even older than me).The movie opens with Lord Grantham receiving a special letter from the King and Queen of England, seeing this being delivered was pure magic. The Downton Abbey staff need to quickly prepare for this royal overnight stay. The Royal's personal staff, consisting of a French chef is sent ahead to prepare the food, a scary butler, to organise the rest of his staff. The regular staff are justifiably upset and plan a revolution with lots of Monty Python style humour. This is the main plot but also with many intertwining subplots.Worth a visit if only just to see Maggie Smith who steals every scene she appears in. My wife is a huge fan of the TV series and enjoyed this enormously, though she said it could have been more spectacular and lavish at the end."
    }
  ],
  "GeminiMan(2019)": [
    {
      "title": " Great",
      "review": "As I child in the 1970's I was always fascinated with the idea of human cloning. So, this film was right up my alley. Creating human clones to fight our Wars would be a great concept. As stated in the film no longer will soldiers come home with PTSD, lost limbs, or even death. A couple scenes sets in the movie reminded me of Game of Thrones. In particular the scene when Henry and Junior were in area with the skulls on the wall. At the end of the movie I read David Benioff listed as the Screenplay Writer. There has been plenty of reviews saying that the CGI is bad. It was okay for me. I saw the movie at a MJR Digital Cinema. Now my local AMC Theatre was showing Gemini Man in 3D + In HFR as well as Imax and third in Digital Format. I am not a fan of 3D movie due to the fact I get bad headaches and sometime pain in my eyes from watching movies in 3D."
    },
    {
      "title": " Unique Concept-Great Execution!",
      "review": "I can't believe what terrible reviews this movie got. For a concept so big yet so unique, it would be very hard to execute it rightly. And when I saw the poor reviews for this movie, I lost high hopes, thinking it failed to do it right. But they were wrong. This movie is a groundbreaking peice of art. The cgi in it is unlike anything I've ever seen. And as the movie progresses, the characters move closer and closer to me. Clay Junior feels like an accurate depiction of someone who finds out he's a clone of someone who knows more about him than he does, and Henry Brogan is such a great character as well. I personally can barely think of anything bad about this movie that deserves it's hate. And I highly recommend it to you."
    },
    {
      "title": " Visually beautiful",
      "review": "The cinematography is beautiful. If you appreciate films for their artistic value, this is a must-see. Lots of gorgeous shots. Only giving five stars, because the story-line was just meh. Very predictable."
    },
    {
      "title": " Good fighting scene",
      "review": "Never disappointed at Ang Lee's film. Always at the edge of the seat on all the fighting be scene. Love the storyline and great acting, Will Smith!!"
    },
    {
      "title": " Technical wizardry can't help this lifeless offering",
      "review": "Heralded as a new technological advancement for filmmaking thanks to its shooting in 4K, 3D and 120FPS and its de-aging effects works on its leading man Will Smith, Academy Award winning director Ang Lee's newest Hollywood film Gemini Man may be technically intriguing but that's where the buck stops with a film that had no chance of overcoming any of its narrative or delivery failures in what's a dull, badly written and downright dumb sci-fi thriller that will likely go down as one of 2019's greatest box office duds.Hovering around Hollywood in various forms since the 90's, with the likes of Nicolas Cage attached to star and Tony Scott and Curtis Hanson in talks to direct, Gemini Man quite clearly had some issues it needed to overcome before seeing the light of day, meaning it's quite sad that Lee, wonder producer Jerry Bruckheimer and the films writers David Benioff, Billy Ray and Darren Lemke didn't manage to overcome them in what is a final product that is barely deserving of public consumption, let alone a big cinematic release.With only a handful of cinemas around the world even capable of showcasing Gemini Man in its true format, there's wonder the much talked about wizardry of the film matters at all as when you strip this film back to the form and manner in which many (including myself) had and will see it, all that's left is a badly constructed sci-fi thriller that gives leading man Will Smith and his tired looking co-stars a plethora of bad dialogue and a bunch of generic characters that offer nothing to a story that doesn't even feel at all original or noteworthy.Everything in Lee's film feels stale and devoid of spark, there's some nice but fairly forgettable action sequences to be found, highlights of which is a motorbike chase that eventuates into a laughably bad CGI fest as two Will Smith's battle it out and start using their bikes as missiles but overall everything in Lee's film feels peculiar and unnatural, never more so evident than creepy young CGI Will Smith.In what's supposed to be the films big selling point as a spectacle, two Will Smith's for the price of one, the younger version of Smith's super-hitman Henry Brogan known as Junior is a creation that you can never warm to and despite the sprinkling's of moments that Junior comes off as a realistic creation, there are far too many occurrences where the films CGI wizardry on Junior takes you right out of the moment, more likely to induce laughter rather than awe-inspiring reactions.It's sad to see Smith continue to struggle in lead roles as he does here, a problem that has been more frequent than ever the last decade and while his not so much outright bad, he fails to get Gemini Man into any extra gear while Lee continues to be a baffling player behind the camera with his films genuine pot luck propositions as he struggles to reach the highs of his early to mid-2000's outputs.Another hugely detrimental aspect to Gemini Man's enjoyment levels is that once we become aware of what a cloned Brogan means and the reasoning behind why this dastardly creation exists, you wonder why we should be against it, making the whole point of Brogan's mission rather pointless as we end up curiously siding with Clive Owen's hammy \"bad guy\" Clay Verris who really truly does kind of have a point.Final Say -With all his focus on the technical that doesn't even end up being all that amazing, Lee has forgot to make a good film in the meantime. A film that is equal amounts dumb, bland and uninspired, Gemini Man is the very worst kind of Hollywood blockbuster that is more likely to encourage sleep rather than encourage viewers to have a fun time with an enjoyable piece of escapist entertainment.1 ½ perfectly placed piece of product placement out of 5"
    },
    {
      "title": " Not what I expected",
      "review": "By watching the trailer I just thought wow, could be a really good one. Ang Lee is knowing for his brillinant way of telling stories and about Will Smith is everything already said. When the first scene started in the theatre I became aware of the b -movie style of making, but still tought, ok it´s nothing bad, could be a kind of european tv action movie french style. Oh boy how wrong I was about that. This movie is a kind of chinese made f-movie with stupid camera ancles and bad storie telling. After all this movie is very dissapointing,compared to the very promising trailer."
    },
    {
      "title": " Piece of crap.",
      "review": "Everything is bad in this movie. Script (ridiculous lines of dialog), plot, performances, CGI. Sometimes young Will is worse than #Superman's mustache. It is innovative and spectacular in how it was filmed, with 3d cameras at 4Kand 120fps, but at the same time that image is difficult to process in our eyes and brain, it seems like a soap opera format and not a movie."
    },
    {
      "title": " Uncomplicated",
      "review": "Seen before, done many times, there isn't much new with \"Gemini Man\" except it's gimmick feature of cloning.That being said, it's not bad, it's just simple. The story is basic and has been similar to the plot of many other action films that involve government security. Although they play it safe it does excite, it does draw you in, and it is enjoyable. What counts most in movies like this, that try to get you asking questions, is the ending. When you think of the plot and soak in what just happened, you cannot help but think \"oh, it's a less complicated Bourne movie.\"Acting from its lead, Will Smith, is great and he is in incredible shape. He is undoubtedly committed and truly becomes the character that's been written for him. He is impressive when acting out his clone, however the CGI is hard to watch. For the most part it works, but some scenes focus too much on his face, forcing the viewer to dwell on the fakeness of the CGI. The supporting cast are also quite good, although a little shallow with them not being fleshed out as well as they could have been. This isn't because of their acting ability, but because the writing was simple.At the end of the day, what takes away from this film is it's writing. It could have explored the moral choices and consequences of cloning a little more but all we get is a little conversation at the end with no real outcome. If not that, it could have made the plot of government conspiracy a little more complex and heavy.Good acting. Fun time. Uncomplicated."
    },
    {
      "title": " Fresh Prince of Bell Air meets Will Smith as in Suicide Squad",
      "review": "REVIEW - GEMINI MANWhat would happen if you met a 23 year old version of yourself?What would you do if that version of you was trying to kill you?Definitely a crossed film here, a bit of Fresh Prince of Bell Air meets Will Smith as in Suicide Squad crossed with buddy cop coming of age second chance.I must admit I was very impressed with the de-aging of Will Smith but the film all in all just lacked, with the quickness of how they became allies to the inept way Junior missed constantly even though the older version could shoot impossibly at 2 km away into a moving bullet train!What could have been just lacked which is a shame because I had very high hopes for this film.As a stand alone action film there is too much deep and meaningful back story and as a deep and meaningful film there is too much action but certainly if you are looking for an escape this is a film to consider, just don't go expecting constant action.Personally I loved the 3rd towards the end, what a surprise which could have been left open to explore more as with Universal Soldier franchise if done correctly.Rating 7 out of 10"
    },
    {
      "title": " \"The Arrival of a Train\" Take 2",
      "review": "First of all, I want to make it clear that this film should have 2 separate score system.The first one is the common system, which you score the movie for its plot, and screenwrites, and etc. And that score is just about average.But this film is revolutionary in a completely different way. As it is filmed at 120FPS, and in 4K, meaning only a handful of cinemas around the world is able to show its absolutely stunning visual spectacle.The words can't describe it, you only have to see it to know it, and it is nothing like I've ever seen in a cinema. Albeit it has flaws, it gave me a whole new idea of how well the modern technology can capture the real life image, and all those brilliant IMAX films I've seen in the past were nowhere near the visual reality that this film is able to capture. For the same reason \"The Arrival of a Train\" is highly regarded, I give Gemini Man a 10.I wish there will be more Cinity films in the future, so that more people will be able to see it, and also, I wish they fix that motion dizziness issues for some people."
    },
    {
      "title": " Great action!",
      "review": "I enjoyed the movie. Non stop action and great story line. Not understanding why so many are giving it a rating of 1 or 2. Loved how the story line came together. Great ending as well."
    },
    {
      "title": " Deserves better.",
      "review": "Seems like most negative reviews hold water... but unless the film was stretched to 3 hours, this is what we get.Solid 7. This \"anti-aging\" technology was done before and I consider it a bold choice to have it made into a full length feature film. It amazed me when i saw it on the small screen (12 monkeys, etc).That reason alone should earn points. Cinematography, shooting locations, color schemes all were great. And to boot, i havent enjoyed Will smith in a role this much since the old days. Also the stellar Supporting cast was great.Would this have been better as a 6 episode series? Probably. But when something semi-fresh comes to us for OUR entertainment, it should be embraces. Knocking movies like this will just keep them fewer and further.I enjoyed it, as did most others i watched it with. Give it a go and form your own opinion."
    },
    {
      "title": " Misleading reviews",
      "review": "This is a great action film with very nice special effects. The action senses are often not the usually explosions everywhere, they are calculated fights with the characters not simply firing for the sake of it. And that motorcycle scene and gattling gun scene? Wow!The people that are rating this low are of the same people who thought Tarantino'a latest film 'Once upon a Time in Hollywood' was 9.5 worthy, and don't even get me started on the boring of a film that literally consisted of us watching a guy drive around town.Yes the script could be deeper, and I personally think this movie could have been a nice mini series where things were explained more, but taking it at face value for what it is, an action flick, it's really great. Again; do not listen to the reviews from people who thought Tarantino's latest film that droned on about the old days of Hollywood, was somehow a good film lmao."
    },
    {
      "title": " Great idea. Poor Execution",
      "review": "I've always been a fan of Will Smith. Hes a good Actor with great charisma. I wanted to love this film and as this genre goes I tend to be a little forgiving. I did enjoy seeing Will Smith in another movie and there were certain aspects of the film that were entertaining.Unfortunately, I struggled with the piss poor CGI rendering of Will Smith's younger self. So much so that I found it difficult to enjoy the movie. It just seemed silly. Also, I'm not quite sure I would rate the writing as bad as some of the other people here have but it is true that it lacks depth. Also, some aspects of it were highly predictable. Perhaps written for people who Get easily confused. No idea.You want to love the characters, but the way it is written and directed its hard to really grow an attachment to them. The characters felt emotionally shallow. I found it difficult to really care what happens to them."
    },
    {
      "title": " Why the bad reviews? I thought movies were about entertainment?",
      "review": "Have I seen better movies? Yes, absolutely. Is there anything that approaches high art in Gemini Man? Nope, not even close (some of the CGI was excellent some not so much). Did Will and Mary do their jobs well? Yes, and sometimes it was a lot of fun to watch (so glad there was no romance }not a spoiler for anything}, it would not have fit the premise).The big question; did I enjoy myself and have fun? Yes! I will even watch it again in a year of so when it streams somewhere. Not every movie is going to be the best on earth, so stop expecting anything that comes down the pipe to set the world on fire. This is solid entertainment. Go see it and enjoy yourself."
    },
    {
      "title": " Will tried to save this movie with his acting....but...",
      "review": "Look, I know they were trying new things in terms of technology. They TRIED. I can see this technology being used better or not at all. The characters didn't really have depth to it. Will Smith still did a great job."
    },
    {
      "title": " It's nothing special, but does it have to be?",
      "review": "I went to the cinema expecting some relaxed fun. Special effects, some humor and a lot of action. I got that. Nothing more, nothing less. For me, job well done. Would I recommend the movie to someone expecting something smart or deep, of course not! (but don't listen to me. I'm biased. I love Will Smith ;)"
    },
    {
      "title": " Doesn't justify the panning....",
      "review": "Ok, so it isn't going to trouble any Oscar or BAFTA juries but it is quite a watchable 2 hours of special effects and fisticuffs in the same vein as \"The Mechanic\". Will Smith still has just enough charisma to carry this off. Sure, it is all predictable stuff and Clive Owen still performs with all the animation of the wooden horse in \"Troy\" but the precept is interesting nonetheless."
    },
    {
      "title": " To the next war, which is no war",
      "review": "Plot spoiler. Harry (Will Smith) is retiring as a sniper assassin who worked for the DIA. He discovers his last hit was not a terrorist but a good guy with a \"spiked file.\" He, and everyone he comes in contact with, are now a target by the company \"Gemini\" who is a private firm special ops. They are also called Gemini (plot spoiler) because they made a clone of Harry who happens to be the kid assassin who is after him. I first thought this was a miscast as a sniper assassin would have been better played by Denzel Washington. The film turned out to be less action and more drama/thriller. This was not the typical smart alec Will Smith role and thank you for keeping your son out of the feature.Guide: No sex. 1 F-words. Nudity (Theodora Miranne )"
    },
    {
      "title": " Not worth watching in the cinema - stream it on a rainy afternoon, if you must",
      "review": "This movie was not good. The script was laughably poor and the plot was predictable; a cat and mouse game across the world and something we've seen many times before. The action was alright but was often boring. A few of the characters felt superfluous, like they were only there for Will Smith to talk to and exposition for the audience - they had very little impact on the plot themselves.The CGI was alright but nothing special - we've seen it before and any time Young!Smith moved it felt like watching a cut scene in a videogame.Overall, I wouldn't recommend you spend money watching this movie - stream it when it comes out, it's cold and rainy outside and you have nothing better to do."
    },
    {
      "title": " 2 Smith's for the price of one.",
      "review": "Never has there been so many untalented actors in one movie since After Earth."
    },
    {
      "title": " Fun action flick",
      "review": "Listen, you saw the trailer, you know what this is. It's not winning any awards (maybe however they made Will Smith the fresh prince again)If you take it for the campy action flick it is. You'll enjoy it. Decent fight scenes. Fun motorbike chase.If you are looking for \"high film\" this isn't that. The plot has a few holes, but most action films do."
    },
    {
      "title": " I can see everything clearly, just not the purpose, the reasoning behind all these A listers coming together.",
      "review": "Gemini ManLee's cartoonish speech is similar to Tim Burton's. Although it doesn't mean that it weighs the director, Ang Lee down, like it does to him. This has always been the major difference between their direction. If Burton invests incredibly on his set pieces, the production design, that is to say he is ready for creating this world, childish and loveable. Ang Lee on the other hand, sits back and waits for the post-production time, his favorite slot, where he colors his world with eye popping visual aesthetics that comes in handy in our CGI generation.There is nothing wrong with both of their methods. If anything I'd call it a bold move. For the risk is higher now, the stakes are doubled. Now, there is this sword hanging by a hair on your head whispering you the inconvenient- and yes, inconvenient- consequence of your misfire. So what happens if you somehow land the landing with a dramatic pose in this minefield. Well, the answer is Life Of Pi. And what happens if you fail? Unfortunately the answer is Gemini Man.And I have to soldier on in my life thinking that this film is bad. Especially, the work that was involved. And I am not going to go and rant about the visual effects but for Will Smith. That is not to say, his performance is some captivating soul that latches onto you from the start. If anything it is actually dull. But then there are these glimpses that he shares with us that are truly pure. This may also suggest that the film is edited poorly. It is not the first time that a good performance was edited out into a bad one. It is just that I didn't want this one to be stated under that sad list."
    },
    {
      "title": " It is not that bad",
      "review": "When I watched the trailer, it looked cool for the actions. The plot felt very ancient. When the critic reviews came out, I was like: what? how come it was SO BAD? Since I never believed critics before, I am not believing it this time either. I have it checked out with 3D and HFR.It turns out not that bad. The actions are decent, sometimes felt like in a game, maybe due to the technology? Some dialog is interesting, the acting is mostly fine. I only have one problem: Would a top assassin usually be iron-heart? Will Smith seemed to show too much emotion and sensation.The receipt has been used so many times before and it is surprising to see there is no new twist added."
    },
    {
      "title": " Entertaining.",
      "review": "Different than expected. And even with the poor reviews I would have gone to see it since it was Will Smith! Fun movie with a cool ending."
    },
    {
      "title": " Don't listen to the reviews- I don't think they saw the same movie",
      "review": "I was so close to not seeing this movie because of the reviews on here, but decided to go nonetheless and I'm so glad I did. It definitely wasn't a slow movie like some indicated and I enjoyed it. It had the right amount of action and drama. Some scenes you noticed the CGI, I think it was done really well and a great action packed movie to see. Ignore the haters and see it for yourself."
    },
    {
      "title": " Why can't Will Smith make good movies lately?",
      "review": "I was excited for this film. I love Will Smith. However, quickly into this movie I realized how bad it was, sadly. Actors were suppose to be sitting by the water eating dinner when clearly they are sitting in front of a green screen. The writing was poor. The only cool thing was the action. I couldn't take it anymore half way through and I walked out of the theater. I wish Will Smith could break his bad streak of movies he's done in the recent past."
    },
    {
      "title": " Another Beniof fiasco.",
      "review": "Dialogues are painful, CGI is horrible and the writing is lazy at best. The \"twists\" are extremely predictable unless you're 10 years old, which is the only way I could imagine someone enjoying this movie."
    },
    {
      "title": " Will WHY?",
      "review": "Why are you keep getting thsese average movies....this movie looked like a staring match.....its like you just look at yourself with amazement throughout the whole movie.....wasnt good .....sorry"
    },
    {
      "title": " didn't expect it like this .",
      "review": "It was no like will smith movie , something difference , & bad experience ."
    },
    {
      "title": " Don't get the hate?",
      "review": "It's fun and entertaining, solid cast! Worth a watch"
    },
    {
      "title": " What a mess!",
      "review": "Started promising with some nice action, then got what could get intricately good, if not done a million times before! by van damme, Michael J fox etccc yet they done it so much better! ..There is nothing to engage with & about as emotional as a cucumber and that's being nice! Will Smith!!? and directed by ang Lee?? I expected a lottt better."
    },
    {
      "title": " Sadly, a Misfire that Visually Looks Great",
      "review": "I will always admire films that take chances or try to push the boundaries of cinema. Whether or not you enjoyed Avatar or not, it's without question that it was an exceptional achievement, visually. More recently, movies like Gravity or Life of Pi have also pushed the boundaries of the technical side of filmmaking and both accomplished wonders. Director Ang Lee, who also directed Life of Pi, is at the helm here for Gemini Man, and while it may look fantastic in terms of cinematography, this movie is a misfire. Here's why I believe Gemini Man isn't worth your time.Following a hitman in Henry Brogan (Will Smith) as he's on the verge of retirement, this film kicks into gear when he discovers that a younger version of himself was cloned and sent to kill him. That's pretty much the premise of the movie, so if you were hoping to dive deeper than that, then you're going to be disappointed. Honestly, if you've seen the trailer for this movie, you've seen all the major story beats it hits. Gemini Man does nothing to wow or surprises its audience, which is a surprise in itself, given the director at hand.From Brokeback Mountain to Crouching Tiger, Hidden Dragon, Ang Lee has directed a few of the most celebrated movies over the last 20 years. I haven't seen the majority of his filmography, but of the films I have seen, this is easily his weakest effort yet. Not to say he wasn't trying, because the effort is clearly on display, but it just doesn't work overall. The most notable aspect of this movie is the cinematography by Dion Beebe. This man has been in the business for over 27 years and his talents have yet to waiver. From the very opening shot, my eyes were glued to the screen. Sadly, the pacing and overall story ended up taking away from this, and not very subtly either.Now for the most distracting and frustrating portion of the movie. The premise and the way it's executed are already off-putting enough, but the big selling point about this film is the fact that Will Smith gives two separate performances, both as himself and a younger version. He actually gives a far better performance than this film deserves, but even I (who is usually fairly forgiving about things like this) have to admit that the facial work on his younger version stood out like a sore thumb. Even down to the hand-to-hand combat scenes. It was clear that the person he was fighting had CGI work done to him. This idea is neat in concept, but it really didn't work here.In the end, Gemini Man surely started as a concept that had director Ang Lee very eager to bring to life, and although his vision and Beebe's framing truly do stand out as positives, this is a film that had too many conflicted writers working on it, and it shows big time. Smith puts his all into this performance and his back and forth with Mary Elizabeth Winstead was even nice at times, but this movie extraordinarily suffers from a bad screenplay and distracting visuals. I really wanted to like this movie and even chose to ignore the audience and critic reactions, but I'm with the majority on this one. It's quite a bad film as a final product."
    },
    {
      "title": " Not Bad",
      "review": "I dont know whats the deal with the reviews the movie wasnt bad I agree the story could have been better but its a decent movie"
    },
    {
      "title": " Perfect movie to Fall Asleep On",
      "review": "The writing was bad in this movie. Felt flat and monotone. Will Smith is a great actor, just the dialogue made it really difficult to find it interesting. It barely grabbed your attention. Certain scenes were excellent action sequences, but the flow never got you interested at all. This was first film that ever put me to sleep. Gemini man was rubbish and boring!"
    },
    {
      "title": " 4 levels of suckiness...",
      "review": "1. The 3D glasses had to be worn upside down 2. The script and dialogue 3. The acting 4. The 3D...why?? Too many MFs FG with my 3D sht"
    },
    {
      "title": " Two words:",
      "review": "David Benioff....useful when adapting material, not able to write anything entertaining on his own.Will Smith is Will Smith. I like him, but there's only do much he can do with Benioff's \"work\"."
    },
    {
      "title": " Point of a movie is to entertain.",
      "review": "Other reviews really doesnt do this movie justice. Dont give bad review just because you hate what happened with GoT ending. Its a great movie."
    },
    {
      "title": " Just enjoy the actions",
      "review": "Without high hopes about the movie, I quite enjoyed it wihout much care on the flat storyline. It is no doubt disappointing that thus came out from Ang Lee, don't expect the film to be the same standard as what Lee usually produced. However, I must give credit to Lee how he has designed the action scenes."
    },
    {
      "title": " So much of ads, sorry",
      "review": "This movie is an advertisement of Coca Cola, why you put so much of ads to such a nice movie?!"
    },
    {
      "title": " Ok",
      "review": "It was ok I suppose will Smith did put in a good performance the story was ok the best bit about the film was when he came face to face with his younger self for the first time and the motor bike chase through the city that's about it other than that there was nothing much about this movie it started off ok then I just felt depressed lol"
    },
    {
      "title": " Tries hard but let down by obvious script",
      "review": "I really wanted to like this film. Will Smith does action movies really well and he's fine here as well, but this film is very derivative in places, with touches of both the Schwarzenegger film The Sixth Day and the Bruce Willis film Looper stirred in.The scenes of the 23 year old Will Smith vary from very good to very bad (his face looks very fake in scenes of low lighting) and whilst Ang Lee is technically a very good director this is not one of his better efforts, as here he forsakes story credibility for technical wizardry.This film is also part financed by Chinese production money and the script smacks of compromise because of it. It is too uerile for an adult audience and too boring for a younger one. There is also some very badly written dialogue that you can almost guess what is going to be said.In essence I found this film watchable but with no great surprises."
    },
    {
      "title": " Will Smith shouldn't have done it...",
      "review": "No doubt... worst Will Smith movie ever! I really have no words to describe it."
    },
    {
      "title": " Default action based movie",
      "review": "First of all, the movie wasn't like i expected. Green room effects were too obvious. Story could be written much more better because the story has huge potential to make an awesome movie out of it. Worse Will Smith movie ever. On the other hand, actings were good and action scenes were allright. I felt like they couldn't finish the movie in time so they had to rush.Thank you"
    },
    {
      "title": " Deadshot+Bourne identity+clone wars",
      "review": "Pretty good movie. Not sure why all the bad reviews. Good action sequences and a good plot."
    },
    {
      "title": " Boring",
      "review": "Guys. I watched this movie in 4DX and 3D at the Regal in Time Square, super amped to watch an entertaining film, I fell asleep by the time they got to Budapest in the movie. I don't understand what the plot was at all and everything seemed made up and improvised as it went. Didn't buy the lead actress either and why did Clive Owen have such a weird role. Like again did the writers make up these characters in a day? When I woke up at the end the whole \"reveal\" of the second clone was too convenient if you ask me and a forgettable scene."
    },
    {
      "title": " this was good i hated nothing about this movie at all GIVE IT A SHOT",
      "review": "I thought this was going to be a slow dragged on film but it wasn't the film just went on i thought it was slow like 10 or 15 minutes but then it moves on itself to quicker pacing. this movie was going to be make long time directed by tony scott in 1997 and cast was soo big to star like Sylvester Stallone i wouldn't mind to see that to see RAMBO VS RAMBO, Arnold was going to be cast as welli wouldn't mind to see that as well like Terminator vs Terminator i wouldn't mind to see sly and Arnold in this type of movie, witch Arnold did a type of movie like this 6th day come out in 2000, Clint Eastwood was going to be attached as well i wouldn't mind to see Harry Callahan vs Harry Callahan seeing each another saying go ahead make my day that would been sick then rest of cast is Nicholas cage, Jon Voight, Brad Pitt, Tom Cruise, Chris O'Donnellis eh bad choice i rather another's then him, Harrison Ford eh i reckon he will be okay for role, Mel Gibson more like mad max vs mad max or Martin Riggs vs Martin Riggs, then Sean Connery more like 007 vs 007 witch is sick. The film never progressed at Disney, though, as the technology was not developed enough at that time for the film to be produced witch is sad but how in earth 6th day film with Arnold got that technology to make his character like clone witch i thought to myself they made this movie back in 2000's like 6th day did. but anyway now since past this film got made starting will smith as lead role witch i like will smith as actor Bad boys 1&2 films, Independence day, enemy of state, Ali, I, Robot, Hitch, I Am Legend, Hancock, Suicide Squad, Bright now tothis film witch i did enjoy and seeing this in 3D wasn't bad experience but 3D isn't that special, to this film it's pretty enjoyable the story and script was good, Clive Owen was good in this film as well as villain. i thought Ang lee is good director but i wanted to see Ridley scott to direct this movie someone but if tony scott was alive i recokin it would been a much better who know's how he is going to write this movie. But the real star of the film is the 3d extra high frame rate of 120fps. Unfortunately it gives the film a documentary-style look witch it looks odd because i wanted cinematography to be like actually movie but i have no clue why Ang Lee made it look like documenty but still well shot film. i was glad to ignore reviews because reviews most of times 10 out 10 times wrong for films because i avoid joker never seen it but i wanted to put my money in this movie i thought this looked like more movie for me to see rather then seeing joker. every time i judge movie i judge it myself whatever i like movie or not but i ended liking this until this day i don't understand how reviews hate this film ? Watch it before reading the critics if you do you will end missing out this great fun popcorn will smith film witch had great action scenes, great CGI of clone smith, i never understand the low scores here if you do avoid this and thinking this is bad because of reviews go ahead because your missing out this intersing film, avoid joker start going your own way. WillSmith does it again. Awesome storyline with a lot of action and stuff blowing up! This movie offers something different then the typical Government conspiracy, and the way Will acts from the way he use to act in his Fresh Prince days to the way he acts in Movies now. This movie doesn't have a dull moment i never understand the hates. the story follows will smith (Henry Brogan) an aging government assassin regarded as the best killer of his generation he has been doing it for his all life he wants to retire as a assassin. Clay Varris (Clive Owen) witch he does good script he has been given is good he request's aGemini man he is a head of a top-secret black ops unit codenamed \"GEMINI\", wants to go after Henry but is denied the request. because he wants a younger clone because when people's in their 20's they do mistakes they listen to older people, so he wants a younger clone so he can have his own assassin and kill older Henry. (Mary Elizabeth Winstead) Dani Zakarweski, a hitwoman and ally of Henry who remains loyal to him after he is targeted for death, she helps him and follows him to get to clone. another character Baron (Benedict Wong) who is a colleague of Henry and Dani. action scenes with will smith and clone version of him had a fight scene but i wish their could been much better like have more of showdown together a lot more fight scene together, action scenes are well done can't say much of it nothing to companying about.rest of movie is really good end of day you like it but it's not best film ever but i thought this is really underrated film people wanna worser movie then this watch After Earth (2013) that is much, much worser movie then to this movie much worse specially his son jarden smith worser actor ever to be in this movie ever this is kinda movie that is watchable not a mediocre i call it but it's enjoyable and watchable film it's bad film as what you think it is from reviews give it a look, give this a try save joker or any another movies is theater give this a shot it's worth it 8.10 i am waiting for Bad Boys III aka Bad boys for life."
    },
    {
      "title": " Nice thriller but probably only in IMAX 3D",
      "review": "Me and my girlfriend had a blast. The 3D effect went a long way to enhance the experience to the point of VR level. You just feel like you're there. That ups the stakes of every situation, no matter how seen before it is. So from beautiful vistas of Budapest to accelerating motorbike chases to 1st person POV firefights and accompanying sound effects, this flick is a winner in my book."
    },
    {
      "title": " Oh no oh no",
      "review": "You know how's worse than Will Smith? Nicolas Cage... You know who's worse than Nicolas Cage? 3 Will Smith... 😂"
    },
    {
      "title": " Enjoyable movie.",
      "review": "Look, movies are for entertainment. Period. I don't spend my money to go pick apart special effects or scripts etc. I enjoyed the movie and will recommend it to friends and family. I'm a Will Smith fan and found his dual portrayal fun and nuanced. The young clone was innocent and naive compared to the world weary \"original\" who hated the ghosts he believed haunted him. Worth seeing!"
    }
  ],
  "Hustlers(2019)": [
    {
      "title": " This is just not good...",
      "review": "Way too long... Covers only one story, it feels like you're watching the same scene over and over again... long and boring conversations...The Asian woman was ok, but other than that no character development, or nat least ot one that makes you care. I can go on but I feel this review is getting as boring as the movie. Spend your money on another movie is my advice."
    },
    {
      "title": " I dont get it",
      "review": "All the talk about this being an empowering feminist epic heist flick and I think you agree getting this mixed up with Widows. Everything that happens in this movie you get from the previews. There is nothing but the scenes from the previews on repeat. What kind of real story arc is there?"
    },
    {
      "title": " Terrible Story with Top Notch Performances",
      "review": "The script and story are trash. No real climax. The movie is all over the place trying to tell the same story over and over again with chunks of character development in the script rather than weaving it through seamlessly. Despite this, all of the actresses gave wonderful performances. Great cast that deserved a better script to tell the story."
    },
    {
      "title": " Men leaving bad reviews",
      "review": "Can't help but notice that the bad reviews are coming from 90% men. Go figure. Haha. It's actually a good film. Obviously if you are a woman, you will love it, and if you are a man, you will not. Go see for yourself and decide...don't let us do your thinking for you."
    },
    {
      "title": " Jlo nailed that",
      "review": "Just by watching the trailer u already know that that's a A list movie. 10/10"
    },
    {
      "title": " Waste of time, as usual.",
      "review": "This movie was once again proof that JLO should stick to music. Nothing about it was entertaining and the characters were shallow. They really hyped it up beforehand to make it seem really exciting. It wasn't. Anyone on here say her acting was \"10/10\", has to be from her team. Acting has yet to be a skill for her. She tries too hard."
    },
    {
      "title": " ain't no shame in doing yo thang",
      "review": "All female cast and director...a story that brings you into the life of a stripper. We need more stories like these. Check out our review on our Youtube channel: Geekettes Chatpeace, Shirley and Christy"
    },
    {
      "title": " Over Hyped",
      "review": "Once again rotten tomatoes is full of sucktards who call themselves movie critics but it is painfully obvious that they themselves have no idea what they're watching. This movie was trash."
    },
    {
      "title": " Nice Movie !!",
      "review": "This movie was nice and the acting was pretty good. The message in the movie isn't just about strip clubs and manipulating men. The women in the movie were working together. This movie gave lots of different emotions throughout. It had some scenes were I was bursting out by laughing and the there were some scenes where I bawled my eyes and wanted to make you cry. I think the cast is amazing and they all did an amazing job and portraying the roles they were given. Constance Wu in my opinion blew me out of the water, Jennifer Lopez was an icon in this movie, Keke Palmer did great, and Lili Reinhart blew me too. I feel like if your up for a day at the cinema and are wondering what to watch go get some tickets and watch Hustlers you won't be disappointed. (Just keep in mind most of the movie was in a strip club)"
    },
    {
      "title": " Boring and redundant",
      "review": "Trashy movie with a lot of T and A. The scenes were very redundant. There were 3 basic scenes that repeated throughtout the movie; 1) trashy naked girls dancing onstage; 2) trashy naked girls partying with wealthy businessmen while they secretly drug them to take them for large credit card purchases; and 3) scenes of trashy girls shopping in high end stores spending the money they stole. That is basically it in a nutshell. These 3 scenes are repeated throughout the movie and once you see each of these scenes the movie is over. Nothing more to see. Big snoozefest if you ask me."
    },
    {
      "title": " I got hustled ! Maybe that was the point of the movie.",
      "review": "I'm sorry to say, this movie is just bad. The only way it can be good is if someone tells me the entire point was to see the trailer, go to the movies and feel like you were hustled when u got out.It looks as if the director just finished school and wanted to use every movie style she possibly could in just one flick, but with out any connection to anything what so ever. Or maybe she just watched Netflix and thought she could do the \" is it a comedy ? Is it a drama ? Nobody knows \" but, very very poorly (unlike Netflix).I am in-love with JLo and she was actually good in this but even she, could not save this poorly made film.The characters are not relatable at all, at all ! The storyline and most of the dialogue are so boring, it's as if they just filmed a boring conversation through most of it, very lazy. The soundtrack moves between Buffy the vampire slayer moms death scene To Saturday Night live, To a cheesy 90's comedy, this makes no since what so ever and if the sound editors / director knew what they were doing, it could.To summarize:This movie was like a really bad dish made out of the best possible ingredients. I didn't get it, at all."
    },
    {
      "title": " A movie about sex work, without any sex.",
      "review": "How could they make a movie about sex workers and not have any sex scenes? Somehow Hollywood did and it is as vacuous and empty as expected. The only full frontal nudity was an unconscious man. This movie should have been on Netflix... no, sorry, it was too awful for that streaming service.. Put it on Amazon Prime. One character, Destiny, actually had a small amount of character development, and Constance Wu knocked it out of the park. The rest of the characters were one dimensional. One would hope there would be a little socially redeeming value in this movie, but there is no moral or even moral ambiguity. The screenplay was jagged, and the direction had no focus."
    },
    {
      "title": " Hard pass - save your money.",
      "review": "Consider this a tip from a friend - DON'T WASTE YOUR TIME! It's my fault that I expected a fun, entertaining movie and didn't heed the user reviews that contradicted the critics' reviews. I, too, fell for the Critics' Hustle of an all-star cast but of course even the starriest of cast couldn't save this dog of a movie...not even a cameo from Usher.This movie is NOT fun, it's NOT entertaining, and I really wanted to walk out but I'd paid my money and resolved to stay to the end. The 2 star rating is for the one scene that was funny enough to make me genuinely LOL. Other than that? shrugs."
    },
    {
      "title": " Beautiful film",
      "review": "I didn't know who was in this. I don't think I've ever seen jennifer Lopez in a film before. I really liked the \"Ramona\" performance. I was pleasantly surprised to see her name come up at the end. Extraordinary performance.Simply great soundtrack. I enjoyed the characters. I thought the device of the reporter was nicely done. If I could criticize anything, i would say they could have cut it by 20 minutes.I may see it again."
    },
    {
      "title": " Nope, sorry I don't agree with critics.",
      "review": "The critics calling this Jennifer Lopez's best role ever must not have seen \"Out of Sight\" 20 plus years ago. She's okay in this film, but certainly not Oscar-worthy by any means. If she gets a nomination for this, it's will clearly be because she has never gotten one before and the Academy likes to reward people even if they don't deserve it. The film itself is only okay- it's certainly an interesting story that could have been better, but it just seems disjointed."
    },
    {
      "title": " Some extra cash",
      "review": "Whatever the reviews says. I like it. I must say Jennifer Lopez she is a Queen of the lovely bum Miss Ramona she's the boss here .Cute Asian Destiny girl great lovely fashion,this is a Girly movie"
    },
    {
      "title": " Style copied from casino.",
      "review": "The film looks a lot like casino but the gamblers are now strippers."
    },
    {
      "title": " It was okay......",
      "review": "The story seemed to be lacking. The ending shouldn't have been words on the screen. They should have played out the ending. Destiny clearly couldn't dance and all the other ladies had actual skills."
    },
    {
      "title": " A grimy & sleazy trip to the underbelly of New York",
      "review": "If I'm being honest, I feel as though the fact Hustlers has been released and is not being talked about as a candidate for one of the years worst films is some form of cinematic miracle.In what appeared to be film that could've easily have been the modern day Showgirls, group of working class strippers band together to rip off sleazy Wall Street and high rolling clients, Hustler's ability to overcome its seemingly doomed based on a true story premise is something that's worth noting and due largely to the fact Crazy Rich Asians breakout star Constance Wu and the sure to be awards nominated co-star Jennifer Lopez bring their A-games to Lorene Scafaria's feature.Now that we've celebrated the fact Hustlers has become a film with a rating in the high 80's on Rotten Tomatoes and high 70's on Metacritic, against the odds it now feels as though Hustlers has become one of the year's most unworthily praised films, in what's a sleazy and unlikable experience in the underbelly of New York City as a group of hard luck woman combine forces to manipulate and criminally drug supposed bad guys to gain a leg up in life.It's in this core concept in which Hustlers becomes an unlikable event, we're told and made to feel as though everyone Wu's Destiny and Lopez's Romona targets in their scheme, that sees them drugging their way around New York's high end players, are bad people, but it's hard to believe just because somebody is rich, automatically makes them someone it's OK to illegally drug, steal and gain from.There's very little enjoyment to be found from watching this rag-tag group of strippers enact their masterplan's on a collection of victims and while Hustlers starts out strong with Wu at first a likable enough central figure and Lopez as good as she's ever been as the street smart Romona, once Scafaria gets into the groove of the central plot-line that formed the basis of the news article in which Hustler's has been derived from, this film loses any of the entertainment value it could've potentially had.As the film wears one we become increasingly aware that there is no one here we can really root for, most of these characters have made their own bed and reap what they sow, there's nothing overtly placed in front of us that can make us shy away from the fact that these woman are just after a quick buck, in the some of the most depraved and dishonest means possible.When we set out to watch a gangster film we are not asked to enjoy the way they kill, rob and plunder their way to financial success but Hustler's problem is it feels as though its setting up its main group as some type of Robin Hood like woman, sticking it to the man and getting a slice of the pie they feel entitled to but there's no real reason why we want to see them achieve their goals at the detriment of everyone else around them, most of us end up being working class citizens, most of us live through hard times and most of us don't feel the need to drug and manipulate others to achieve financial gains.Final Say -A well shot film that's well acted by its main cast, Hustler's is supposed to feel grimy and dirty but it forgot to offer any real enjoyment for its viewers to take from a film that quite simply follows a collection everyday woman who decided their best bet at a good life was becoming monsters bigger than the supposed ones they were targeting for their personal means.2 Usher visits out of 5"
    },
    {
      "title": " Long and boring snooze fest",
      "review": "We went to this movie with another couple and they are huge jlo fans. Half way thru a handful of people walked out and I wish I could have gone with them but stayed with our company. Even from a guys perspective the move was no good. The movie had its ups but way more downs. The main characters did do a good job but overall they could have hacked off an half hour"
    },
    {
      "title": " Choppy and Unoriginal",
      "review": "I read the critics' reviews when this film first hit the festival circuit. Did we all watch the same film?? This was based on true-ish story, but nothing about this film made me connect with the characters, care about their lives, or feel that their connection to one another was anything other than bogus. Literally, the most unsentimental, unmoving story I've come across in some time and I only watched it because of the hype. It's over-hyped. It's been done. I kept watching the clock to see when it would be over. And the ending? So many loose ends because, ultimately, the film is based on a very, very thin plot that was stretched to almost 2 hours. Hard pass on this film."
    },
    {
      "title": " Lopez",
      "review": "Lopez Is Amazing. Her acting is 10/10. The others are amazing aswell Brilliant acting all around. But I understand this is not for everyone. The story is a bit all over the place but it pulls it off amazingly"
    },
    {
      "title": " Boring",
      "review": "I mean...Jlo is the same in every single movie! Her acting is always mediocre, the plot is interesting and the cast gave strong performances but overall could've lived without watching this. The pole dancing was nice."
    },
    {
      "title": " Great movie!",
      "review": "This movie is better than I expected. They should think of releasing a new movie trailer depicting how gritty the movie really is. The writing, acting, and directing were phenomenal. This is definitely Jennifer Lopez's best performance to date. I can see why there is buzz of the possibility of Jennifer Lopez getting nominated for an Oscar."
    },
    {
      "title": " Beautiful, exceptional acting, timely political notes throughout!",
      "review": "We need more female-directed movies like this! I felt like I was taking an intro class in feminist/capitalist critique while being marveled by excellent acting, a fun soundtrack, beautiful lighting, in-depth character development, and a bunch of enjoyable 'slow-mo walking shots'/transitions with trippy elements.The plot (while creative-licencing a true story) is meticulously crafted commentary on the ills of a capitalist-obsessed society, while simultaneously capturing the feminist bonds that keep us pushing through it together.The film centers around the economic collapse of 2008 and the lives it upturned in trickle-down effect; it critiques capitalism brilliantly, as it arguably captures one of the most OBVIOUS ways we assign inherent VALUE to individuals; through sex work.Hustlers reminds us that we're all the same players in this violent game we call the American dream; and that some of us are simply better, smarter, more ruthless players at that game than others; those who learn to work the system."
    },
    {
      "title": " Neither edifying nor entertaining",
      "review": "Dorothy (aka Destiny) lives with her grandmother, and mony is tight. Destiny becomes a poledancer, is befriended by old hand Ramona, and all is well until the sub-prime crisis hits Wall Street, and the easy money dries up. Ramona develops a plan - if you and your friends pick up a mark, and slip him a concoction which renders him gaga, then you can max out his credit cards and tell him he had a great time afterwards, worth every penny, shame he can't remember it.This is based on a true story, and I can believe it. Jennifer Lopez is Ramona and Constance Wu is Dorothy. Both women swear prodigiously and wear little clothing (although always more than the other performers in the club). Both women also act well.But this film is not happy or edifying. What happens is not pleasant, and the female characters aren't particularly sympathetic. Maybe they are more sympathetic from a feminist standpoint, but I didn't care for them much. The film is too long by about half an hour, and I left the cinema without feeling that I had been entertained."
    },
    {
      "title": " Very Entertaining!",
      "review": "Loved it. Very entertaining. The two leads were great. Jennifer Lopez is so underrated and Keke Palmer is. Real gem. Not earth shattering filmmaking but a really easy film to like."
    },
    {
      "title": " AMAZING!",
      "review": "Mark my word...this film is 2019's Godfellas! Great direction, story and acting, particulary Jennifer Lopez's Ramona."
    },
    {
      "title": " What they think that made it look not sexy, actually did, they needed a better guidance, that's all.",
      "review": "HustlersLorene Scafaria, the writer and director, is a hustler. Similar to the film, we, the clients, are robbed shamingly. But what's interesting is that the film loses at the end of the day. Not even looking at the intentions of the film, the film, as a story, had an extremely solid argument to walk through that Oscars table head held high. And instead the opportunity is not only missed but chucked away for cheap thrills and manipulative emotional blackmail. And this could have been a worthy Oscars contender and is instead just an Oscars contender.And I emphasize on how big a mistake they made, on going light on this material. What the film industry, in the last few years, had twisted and turned its way out to address the political correctness, is something that the film has in its pocket all along. So now, all they had to do was carve a compelling drama. And instead they are overcooking those same ingredients, that turns into a preaching to the choir tone, within the first act.The film craves for such moments. If anything it goes all the way around, just to create memorable scenarios, to the price of pacing. And it is not the pace I have an issue with, it is the two page script that is told magnanimously within two hours that I can't just \"whoooooo\" around. The film is also hard to watch. Not for the justification it attempts to give its characters but also the justification that it doesn't give to its characters. And it is not the narrative but the visualization of that crime scene that makes it horrible. For if told properly and rummaged around the files, dug deep into their homework, you will find a sweet spot to explore that would balance these Hustlers."
    },
    {
      "title": " Strippers Vs Wall Street",
      "review": "I saw \"Hustlers\", starring Constance Wu-Fresh Off the Boat_tv, Crazy Rich Asians; Jennifer Lopez-Second Act, Anaconda; Julia Stiles-the Bourne movies, 10 Things I Hate About You and Keke Palmer-Scream Queens_tv, Madea's Family Reunion. This movie is based on a true story, or rather a New York Magazine article. It's about a group of strip club employees that band together and take advantage of some Wall Street clients, sometimes using illegal tactics. Constance is the new girl at the club. She is just trying to support her grandmother and herself and doesn't want to make a career of dancing. Jennifer is the seasoned pro that takes Constance under her wing and teaches her how to dance to make the most money. Keke is another dancer in the group. Cardi B and Lizzo both have small roles as dancers-this is also their first appearance in a movie, but not Cardi's first appearance in a strip club. Julia plays the reporter writing the article that the movie is based upon. There is some nudity but not from Constance or Jennifer, although they do look good with very little on, especially Jennifer. It's rated \"R\" for drug content, language and sexual content-including nudity-and has a running time of 1 hour & 49 minutes. It's not one that I would buy on DVD but it is a good rental."
    },
    {
      "title": " Awful movie",
      "review": "This is truly by far the worst movie of the year. Save your money and see something else."
    },
    {
      "title": " The hypocrisy of woke",
      "review": "Imagine a movie where a bunch of men drug and rob women as the main theme. You can't right, because it would never get made, but when the roles are reversed it's \"you go girl\" right? This movie is everything that's wrong PC woke culture and highlights the misandry and hypocrisy of modern day feminism. This movie disgusts me."
    },
    {
      "title": " Pure garbage",
      "review": "Review is in the title. Trash trash trash, Jlo needs to stay in her music lane, her acting is like a parody of someone being bad at acting, that's how bad."
    },
    {
      "title": " JLo owns it",
      "review": "Wow JLo is phenomenal in this movie she owns every scene she's in and Constance Wu is amazing also. Love the chemistry of the whole cast"
    },
    {
      "title": " When Will Jennifer Stop Shoving Her Gruesome Penchant for Fur in Our Faces?",
      "review": "One thing's for sure: Jennifer Lopez knows how to promote herself. Isn't that what this film is really all about? Her showing off?Lopez is good. She sure can move on that pole. Her bod is looking great, too.But I am SICK TO DEATH of her constant and ignorant promotion of fur and her wanton condoning animal cruelty. Did she really have to advertise her imbecilic love affair with dead animals in this movie? Don't tell me the writers are responsible, either.Stop being so lame, Jen, and knock it off with your heartless disregard for animal suffering.As for the film itself: There are some beautiful women who sell their \"services\" for money. It is not empowering, it is just sad. A great many men are basically predatory creeps, who can't wait to paw and drool over sad women who, without exception, are strippers because they suffered some type of abuse as children.But, wait. These strippers are going to make the most of selfish, insensitive jerks. How? By being larcenous and cruel and vengeful. What a fun story.This film has no message. SPOILER ALERT: The strippers drugged men, *stripped them* of their money and, when caught, did little or no jail time. Isn't that cool? Ugh. No. Stupid."
    },
    {
      "title": " At least you will have fun while reading reviews",
      "review": "This movie is so bad you can't imagine how bad it is. \"It is not even Apple 4 bad, or Apple Maps bad, it is a Microsoft's Zoom bad!\"I never thought that JLo will come back with a big title movie, and yes, it didn't happen at this time with \"Hustlers\" as well.Usher were in this movie, and it says a lot as well. All these people, question, who were popular two decades ago, are trying to get back on the track?Only one good thing about this movie is after watching it you will have some fun by reading excellent reviews how bad this movie is."
    },
    {
      "title": " Hustlers is a funny feel good film you really do root for them even though they are committing crimes on these rich people to steal their money.",
      "review": "We first meet these people at a strip club in New York where they are strippers trying to make a living, but in order for them to make enough money they need to go into a bit of illegal business. We see these strippers as the hustle gets a lot harder resulting into drugging their clients in the film to try and get them to use their credit cards, signing cheques to spend money on them while hopefully not getting caught in the process, which the precaution is mainly these drugs that play on the clients memory while giving the clients a good time while being conned out of thousands by these strippers. Jennifer Lopez is hilarious the moment she breaks into a split after her strong independent liberating pole dancing scene is just Oscar worthy, which her character Ramona is the main instigator in this side hustling illegal business remaining in complete control over her friends that eventually becomes family. Overall this movie is hilarious, dark, thrilling, well thought out and makes you overall feel good seeing these people come together to help each other in their hard time of need, where you find yourself rooting for these vulnerable strippers that are doing the illegal activities that they are in as you just want them out of this compromising position, then to be happy overall as close friends practically family too. Jennifer Lopez , Constance Wu, Cardi B, Keke Palmer who is especially hilarious, Trayce Lysette and Lili Reinhart has done an amazing job in there acting. Even though Lili's character Annabelle could not stop throwing up randomly which was a bit weird and funny at the same time, also her sitting on Jennifer Lopez's Lap was a bit bizarre too still, cute, warm, sweet and hilarious though just especially shows the close friendly family bond between Lili's character Annabelle and Jennifer Lopez's character Ramona too. I highly recommend you go and see it in a cinema as laughing together while also feeling the emotions the characters are faced with in their unpleasant experiences are just what cinemas are all about experiencing it as a community."
    },
    {
      "title": " Hustlers is a real life story about Wall Street during the Great Recession",
      "review": "Hustlers is a \"uniquely empowering heist drama with depth and intelligence to match its striking visual appeal, and engaging nature\". It makes the viewer identify with flowing money situation that was Wall Street during the lead up to the Great Recession and the consequences to Wall Streeters. The real life story is well portrayed in the movie.scams like this probably happen all over the country. The male victims just too scared of embarrassment to report it. The reviews are right on. I thought this was a very good story and well adapted for big screen drama. It was written by, directed by and stars all women and creates an interesting take on opposite sex exploitation from both sides."
    },
    {
      "title": " Jennifer Lopez makes up for repetitive pacing in Hustlers, a cross between Showgirls, Boogie Nights and The Sting",
      "review": "One of the quotes from today's movie reflects that, \"The entire world is a strip club with some throwing money and the others collecting the money\". It's also the film's reflection of it's setting in the aftermath of the 2007 financial collapse that lead into the Great Recession. It's no secret that a lot of people were affected by it, whether it was average Joes losing their low wage jobs or entire companies going under. It was a time that people reflected just how much they can do and if those at top should receive some type of consequence.Our protagonists certainly thought so and used it as their justification to do the things they felt were right. What makes crime stories fascinating is that we're always going to see a different philosophy on just who the real villain is. Is it the people committing the actions against the law or the people after them who are just as likely to face their own corruption? This is also why several movies about the Great Recession like Up in the Air, The Big Short and 99 Homes have looked explore different viewpoints within a rough era. Hustlers takes it's turn at the time and several women involved in a specific industry.It opens in 2007 where newcomer stripper Destiny (played by Constance Wu) is taken under the wing of veteran stripper/popular attraction Ramona (played by Jennifer Lopez). Ramona teaches Destiny several pole dancing and erotic dancing, along with introducing her to fellow strippers and how to get the most out of the Wall Street types who frequent the club. Destiny not only starts to rank in a lot of money, but she uses her new fortunes to care for her grandmother and newborn daughter. Things come to a halt at the start of the recession.Years of the recession cause fewer people coming to the club and puts Destiny out of work. It doesn't help that her background gives her little chance for other work. She eventually comes across Ramona again where they blame the recession on the same Wall Street guys. To retaliate and to generate an income, they agree to bring in other strippers including Annabelle (played by Lili Reinhart) and Mercedes (played by Keke Palmer) to take advantage of their beautiful nature to lure them into the clubs and take everything on their credit cards. All of this becomes chronicled by writer Elizabeth (played by Julia Stiles).It may be easy to see Hustlers as something as exploitative as Showgirls. But to tell you the truth, I see it more like a cross of Boogie Nights and The Sting, and I ended up like the movie a more then I anticipated. I don't know if I can call it one of the best of 2019, but it has elements that are phenomenal. Speaking of which, I'll start by saying that Jennifer Lopez not only shines, but also gives what may be her best performance in a years. She paints a reflection of her eternal youth within a character whos the prime example of \"looks can be deceiving\".Constance Wu fills in the role similar to Mark Wahlberg from Boogie Nights where she has two goals; to be the innocent whose filled in on the movie's information and to someone the audience can imagine themselves in. Hustlers uses this narrative to make their characters interestingly sympathetic, especially the lengths they go to accomplish their goals. Of course like a lot of crime stories, it all has to topple at some point and the movie has that...though it takes a lot of time to get there.The first half of Hustlers was better then the second half. The con that's set up is a good one, but the pacing causes things to slow down too much. A lot of it is because much of the scenes repeat the con over and over. I know it's to show how much it works, but the movie also has a lot of slow motion edits which heighten moments at the strip club, but can come off as unnecessary during the con. If anything, the best moments from the second half are when the girls get together laugh about what happened and thus, seeing them connect.I'll give this seven stripper poles out of ten. Hustlers is a movie that, regardless of how I felt, is probably going to do good business and have its eye on certain awards. It's too early to determine any guarantees, but I'll remember this; especially for Jennifer Lopez. I do recommend it in general and it'll make a good watch."
    },
    {
      "title": " Very VERY disappointing",
      "review": "I normally love JLO movies and the critic reviews were good, so I was really excited to see this one.What a mistake. BORING.This just reinforced my view that reviews by professional critics are based on their own political agendas, political correctness, snobbery, economic incentives, or other things that have nothing to do with whether the average viewer will actually have a good time.Don't waste your time and money"
    },
    {
      "title": " A Brilliant Slice of Life of Female Survival",
      "review": "Constance Wu who shot to fame for her starring role in the American Asian breakout film Crazy Rich Asian (2018) appears to have the lead role in this movie even though Jennifer Lopez has a starring role and the possibility of her receiving an Oscar nomination that has been talked up. This female directed and written movie by Lorene Scafaria along with co-producing credits going to Lopez and interestingly enough Will Ferrell displays on screen an edgy and authentically, finely balanced mood and tone film imbued with both sharp drama and a genuine comedic humor rarely enveloped into one movie. While there are a lot of titillating suggestive scenes, this movie avoids the glamorization of the striptease unlike that overly stylized in the musical and Oscar winning Chicago (2002). Instead Hustlers focuses on a raw look at women living a life that is both hard and reflective of the struggle that every woman faces, including the responsibility of caring for one another and their children. This amazing and compelling experience of a slice of life is powerful and sensitive portrayal of the connections and the travails of the lives of what seems to amount to be essentially single women living in a high-stakes life in an effort to survive. The only weaknesses that stand out are the absence of a more descriptive understanding of Wu's interaction with her boyfriend and their evolving relationship and Lopez's apparent willingness to retain a connection with one of her more questionable hustlers."
    },
    {
      "title": " J.Lo shines in gritty yet funny stripper drama",
      "review": "\"Hustlers\" (2019 release; 110 min.) is \"Inspired By a True Story\", we are reminded at the beginning. As the movie opens, it is \"2007\" and an Asian-American girl named Dorothy is getting ready for work at a strip club. Then a Latina woman named Ramona makes her grand entrance and does a spectacular pole dance as Fiona Apple's \"Criminal\" blasts from the speakers. Duly impressed, Dorothy reaches out to Ramona for some dancing tips, and the two hit it off. We then go to \"2014\" where we see Dorothy being interviewed by a journalist... At this point we are 10 min. into the movie, but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the latest movie from writer-director Lorene Scafaria, whose \"Seeking a Friend For the End of the World\" some years ago was one of my favorite movies of that year. Here she takes a New York magazine article and turns it into a wild, wild movie. Beware: not much is left to the imagination. The grand entrance of Jennifer Lopez in that opening scene's pole dance is nothing short of stunning. In fact, the same can be said about Lopez's overall performance, which should be Oscar nomination-worthy, and certainly is a career-best performance. Lopez turned 50 this year, and looks about 35. She takes control of the movie, and requests, makes that demands, your attention. You are more than happy to give it to her. Constance Wu, Keke Palmer, and Lili Reinhardt round out the primary performers. Check out Cardi B and Lizzo (part of the strip gang). When a movie's principal set is a strip club, you can expect a lot of fist-pumping music, and the movie more than delivers on that level. In addition to the aforementioned Fiona, there are songs from Britney Spears, Janet Jackson (\"Control\", of course), Fat Joe, Queen She, 50 Cent, and many, many more.\"Hustlers\" premiered a few weeks ago at the Toronto International Film Festival to immediate acclaim, and was released wide last weekend (outperforming expectations at the box office). The Saturday matinee screening where I saw this at here in Cincinnati in its second weekend of release was attended very nicely (a good 30 people in a small room). If you have an interest in seeing a gritty yet funny stripper drama starring an Oscar nomination-worthy Jennifer Lopez, I'd readily suggest you check this out, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion."
    },
    {
      "title": " Don't believe the 1 star reviews",
      "review": "I'm not a movie critic but I can tell you that this movie is not commenting on society in relation to sexism. It's not trying to say that women are greater than men or that all men are horrible and are deserving of any hurt that is brought upon them. It's not commenting on feminism. I don't believe that this movie is meant to exemplify how women should demand power and wealth in the real world. It is a crime movie. There are no forces of good vs. evil. These women took shortcuts to live their lives in luxury by lying, cheating, and stealing.No one is condoning this type of behavior, but most low-rated reviews I've read here seem to have been written by people who have taken offense or feel morally disturbed by the decisions these women have made in the movie and are unable to separate their personal feelings.I think this movie was developed extremely well despite having its source material based on an article. The movie adaptation was funny and warm due to the women's personalities and chemistry with one another. The music was amazing and really caught my ear when they played classical music during non-clubbing scenes. The visuals were cinematic and captivating. The only reason I give this movie a 9 instead of a 10 is because I believe that some sequences ran a bit too long before continuing on with the storyline."
    },
    {
      "title": " Great performances, decent directing, amateur writing, terrible editing",
      "review": "J-Lo was amazing in this role, as was Constance Wu, but novice writer and director Lorene Scafaria did an ok job directing, but the screenplay was garbage, with many plot and technical issues, especially towards the end. The pacing was too slow for the story, and the 110 min run-time felt like 3 hours. And the abrupt scene cuts by editor Kayla Emter... a kindergartener with plastic scissors could've done a better job. Aside from this being based on real events and (surprisingly also cast) Cardi B's acknowledgement she's done this, I do agree that this \"girl power\" garbage has got out of hand. I wasn't impressed with all the gal's playing victims and none of the men they robbed weren't. Clearly a one sided opinion coming from an entirely all-female production. That alone lost points from me. This film is not even close to the fake 10's - it's barely at best a 7/10, but also not worthy of all the 1's and 2's (production value alone is at least a 4). It's an honest 6/10 from me, most points for the leads performances."
    },
    {
      "title": " Bland and boring DESPITE J-Lo's good performance",
      "review": "When I first saw the trailer for the Jennifer Lopez \"strippers get back at scummy Wall Street-types\" film, HUSTLERS, I wasn't at all interested in seeing it But then I got wind of strong early reviews with some (very faint) Oscar talk about J-Lo's performance in this film, so I thought I'd check it out.I should have trusted my instincts.What a lame disappointment this film is. It starts out flat and then flattens out even further to produce a movie that starts at one (fairly low) level and then stays there the entire time.HUSTLERS stars Constance Wu (CRAZY, RICH ASIANS) as a a young stripper who is taught the ropes of the stripping game by uber-stripper Jennifer Lopez (if you don't know who this is, then go ahead and skip to the rating of this film at the bottom of this review and move on). When J-Lo's character, Ramona, comes up with an idea to get back at the scummy Wall Street types AND make some money along the way, Wu's character, Destiny (of course) is a reluctant participant becoming - over time - the leader.A potentially interesting, \"based on True Events\" story (this film is based on the real life exploits of Ramona as described in a New York Magazine story), this film just falls flat and I put the blame for this in 2 places.Lets start with Director and Writer of the screenplay, Lorene Scafaria (SEEKING A FRIEND AT THE END OF THE WORLD). She wrote - and directed - this film like it is a modest-scaled, low-key independent film (much like the very good SEEKING A FRIEND...), but the second that this film cast Jennifer Lopez as the flashy leader Ramona, words like modest and low-key should have been thrown out the window but Scafaria chose not to do this, she downplays the best asset in her movie and plunks most of her effort on a lead who could not match Lopez star power wattage.And that lead is Constance Wu - the other weak link in this chain. I thought she was \"just fine\" in CRAZY RICH ASIANS, blending into the scenery when more flamboyant personalities were on the screen (in CRA it was Michelle Yeoh's \"tiger mom\") and she blends into the scenery whenever J-Lo is on the screen in this film - and that just doesn't work here. She needed to step up and step out and match J-Lo blow for blow, but she backs up and backs away in these crucial moments, so when her character is on the screen alone - trying to get the audience's sympathies - I just didn't care.What I did care about is Jennifer Lopez's performance as Ramona. She is the brightest spot in this film and brings her star power and natural charisma to the screen. The ultimate problem with this performance (and NO, it is NOT Oscar-worthy) is it feels that she is fighting the \"low-key\" headwinds of writer/director Scafaria the entire time.Former Disney star Keke Palmer and current RIVERDALE star Lili Reinhart bring some fun and energy to the screen as the 3rd and 4th partners in this quartet of stripper Robin Hoods, but they are all too often sentenced to strut around in the background in tight outfits. I would have loved to see a movie with Lopez, Palmer and Reinhart that was more \"out there\" and less restrained.Finally, two very good actresses - Julia Styles and Mercedes Ruehl - are in this film in \"what-the-heck-are they-doing-in-this-film\" roles that are underwritten and underutilized the talents of these actresses - another missed opportunity by Writer/Director Scafaria.I've heard this film called a \"female empowerment\" film or \"the stripper version of Goodfellas\" and I couldn't disagree more. The only \"empowering\" part of this film is when the credits rolled and I could leave.Letter Grade: C4 stars (out of 10) and you can take that to the Bank(OfMarquis)"
    },
    {
      "title": " Women Hos Why?",
      "review": "Why would women be in a show like this. It is degrading. Have respect."
    },
    {
      "title": " Another jlo movie who cares",
      "review": "Another Jennifer Lopez movie about her attitude which is way too big I'm just done with Jennifer Lopez The Prodigy of her"
    },
    {
      "title": " Nooo",
      "review": "Hell no this movie is bad ,jlo can act for shiiiit just like they rest of the crew"
    },
    {
      "title": " Uneven, but noteworthy",
      "review": "Hustlers starts fast, a naive dancer, Wu, is taken on by the old pro, Lopez, who shows her the ropes. But there's only one problem, the teacher doesn't know where to stop.When the recession of 2009 hit the narrative quickly becomes Bridesmaids meets Goodfellas... And if that sounds strange it's because it's a little odd. It jumps from slapstick to serious, and doesn't quite know where to fit.That being said, Hustlers is DEFINITELY worth the watch. While it's unusual it's also original enough, in that it's a common folk revenge film about the greedy and crooked men who caused the 2009 meltdown.Lopez is great, just fantastic. However, overall, there were just too many characters. Wu and J Lo, never quite connect. The overall feeling is just a bit disorienting."
    },
    {
      "title": " Its an okay, yeah thats it.",
      "review": "Sex workers Hollywood style, they shed some light but doesn't seem completely original nor does it deserve to be on such a high pedestal by critics, do critics these days just go the opposite of what viewers say? We go right they go left we say yes they say no, Its such a weird movie they tried saying girl power throughout the movie, if they were male actors probably would call it rape and disgusting, they tried making strippers that they're these sexy irresistible girls. I'll give this movie a failing grade, a Magic Mike remake into girls basically."
    }
  ],
  "Joker(I)(2019)": [
    {
      "title": " good but overrated",
      "review": "It is a good movie with some caveats, I think they overestimated the movie by saying that it is intimate, given that the character flies before 1 hour on screen and there are not many scenes that make this construction, besides the several script flaws to the address a serious topic. Joaquim's performance is the great protagonist."
    },
    {
      "title": " No Joke, Joker Is A Comic-Book Masterpiece, Send In The Clowns",
      "review": "PROS:Joaquin Phoenix's Joker Is Going To Be IconicTodd Phillip's Masterful Directing (Yes I Mean That)Solid Supporting Cast (Especially From Robert De Niro)The Psychological DramaLawrence Sher's Gritty And Beautiful CinematographyThe Musical ScoreThe Realistic ToneIts Gets Really Creepy And DisturbingSome Moments Of HumorThere Are Some Genuine SurprisesThe Messages And Subtext Is Done WellIt Makes You Question What Was Real Or NotThe 1970's Homages (The Scorsese Influence Is Obvious But Well Done)CONS:NONE!!!(SJWs are going to tear this movie apart for no reason)"
    },
    {
      "title": " Hahahahaha.......hahahahahahaha.....hahaha....",
      "review": "A game changing film...10 out 10 ...Sad and Dark ...it will move you and every scene is brilliant ...you feel empathy for Its main protagonist..and leave the cinema .. questioning what you have just seen ...."
    },
    {
      "title": " Awesome movie! The most disturbing thing was....",
      "review": "The story was great, acting was suburb! Great depth to the character and arc to becoming the iconic joker!The most disturbing thing was the mother who brought there 7yr old. This is not a kids movie. Disturbing content, that made me (42yr old) winch - even more with knowing a child was there."
    },
    {
      "title": " Joker is Dangerously Incompetent",
      "review": "I read many other reviews before seeing this movie. A few said it was great, some said it sucked, but most just thought it was alright. It was just ok as movies go, but when you add in it's annoying intention to depress you with every frame of every scene of this movie you will ultimately end up questioning why you are subjecting yourself to this unnecessary torture. Here's how you know you have stayed on the Joker train too long; he will literally walk into the funniest moment in the movie. You will laugh because you'll appreciate that fleeting moment of fun before the darkness returns, bludgeoning you to death with depression."
    },
    {
      "title": " You must go and see it for yourself",
      "review": "Overwhelming, Mesmerizing, Disturbing and Beautiful. This is not your typical comic book movie adaptation crap, it is a tragedy. It is the tragedy of Arthur Fleck, his rebirth as Joker, a transformation of someone troubled to a psychopath let loose. Phoenix is surely getting a nomination for his phenomenal performance it is just as if he doesn't simply act but becomes the Joker. A feast for eyes and EARS. Check Hildur Guðnadóttir, her score is amazing for this movie."
    },
    {
      "title": " Oscar-worthy performance from Joaquin Phoenix",
      "review": "In this adaptation of Joker, one of the greatest villain of all time in history, Joaquin Phoenix delivers a magnificent and unforgettable performances as a madman driven into insanity.There has been multiple portrayals of the Joker, and all of them has done the character justice, however, Joaquin Phoenix's Joker has beaten all that had come before him. I used to think that it will be near impossible to surpass Heath Ledger's Joker in The Dark Knight, but this one did. Seeing the commitment Phoenix has for this character really moved me and I believe, after many nominations, this will be where he will finally receive the Oscar.As for the story, it was good but I think it could be better. I was hoping for it to be darker and grittier. The story was depressing, but I wanted it to be even more depressing, so much that it was intolerable. Still, director Todd Phillips has done a great job for a drama film and I hope to see more of this genre from him in the future. The tone and color of the film is also wonderful, and the cinematography is exceptional.All in all, the film is fantastic and the performance from Joaquin Phoenix is absolutely phenomenal. A must-watch!"
    },
    {
      "title": " Forensic psychologist review",
      "review": "Pure magic it's the best movie to depict a descend into madness"
    },
    {
      "title": " Incredible",
      "review": "I haven't went to the movies in 3 years. I went for this one. One of the best movies & performances I've ever seen. Hands down."
    },
    {
      "title": " \"One bad day..\" Then some.",
      "review": "Joker review:Okay, so.. Let's just get in to this shall we? First off, this movie is not your typical, Dark Knight, Batman villian story. It's very much an origin story and by origin I mean the very beginnings of what the joker becomes. That being said, it was nothing short of a masterpiece, I see a few oscar nominations in the future. Joaquin did an amazing job, as did Robert De Niro. This movie pushes the bounadries of what it means to be deranged and mentally ill and suffering. But laughing it off and slowly giving in to madness. This movie makes you uncomfortable at times, makes you feel for this character. Like he isn't a villain, you see the fall and reality of it all. I really don't think I blinked for the whole 2 hours of the movie. It honestly has a The killing Joke vibe, but it's expanded out in to much more than \"One bad day\" Joaquin has the mannerisms and style I would expect the joker to have. It's violent, really violent of a movie. Goodfellas, The godfather type stuff. I recommend this movie for any comic book fan and anyone interested in a good thriller, drama. I will comfortably give this move a 9.5/10 in my personal opinion. It's on par with Heath's joker from the dark knight for various reasons, just gives you a whole new look at the rising up of the crown prince of gotham"
    },
    {
      "title": " Slow Burn",
      "review": "I cannot even find the words to describe this movie, especially the last act of it. Joaquin tore this role to shreds. I was very very afraid that it wouldn't live up to the masterful trailer, but the journey you take with Arthur is so engrossing that by the time you get to the end, you want more.And for an origin story to do that, world-build, character development at its peak, neutral stance on political topics, topped with Joaquin. The late night talk show scene is the Joker I hope to see more of in any kind of way.It definitely takes its time building but by no means is it boring at all, especially when you get to about halfway through. It all makes perfect sense. In reality 8.5/10. It reminds me of \"Batman Begins\" the perfect origin."
    },
    {
      "title": " 8.5 rating",
      "review": "The movie had a amazing acting by joaquin phoenix, great diercting and cinematography but it took alot of things fros taxi driver and the king of comedy and this was the biggest issue in the movie. The second issue that the movie focused on the physiological part of arthur flick we didn't see a real joker except at the last 15 minutes of the movie so the movie is so great and one of the best movies of 2019 but it's still not a masterpiece"
    },
    {
      "title": " Joker as you've never seen him before.",
      "review": "Joaquin Phoenix at his pinnacle.. Never have I seen such a performance from a somehow underrated actor.. Not anymore I guess. The way he portrayed Joker is unreal. One would say that Joaquin was acting himself. The story was good. There were moments where you didn't know what to feel.. Certainly kept me on the edge of my seat at times and confused at other. I believe this is the only proper way of telling Joker's life. A solid 8 from me and a must watch for sure."
    },
    {
      "title": " A masterpiece.",
      "review": "Just saw the #Joker last night in Bahrain and it sent chills down my spine . I think this is a one of a kind movie , something that should be experienced by all movie lovers . A slow burn into reality which is far more haunting than fiction.It is not a Superhero movie nope .... it is a super villain movie .An honest reflection of how we are all responsible in creating monsters .Simply a masterpiece . Oscars ... yes for sure."
    },
    {
      "title": " I don't see how that highly intelligent Joker on Dark Night started from this insane person",
      "review": "The Joker on The Dark Night is a highly intelligent person who holds deep conversations with prominent people, capable of planning a complicated bank robbery and was one step ahead of Batman, the police and intelligence. He has a strong personality free from emotionality and he laughed controllably. I can't see how this mentally unstable person on this Joker becomes that awesome Joker."
    },
    {
      "title": " Worth watch it but is not spectacular",
      "review": "Best you will watch is Joaquin Phoenix 10/10. Art and photography 10/10. Script 6/10."
    },
    {
      "title": " An unnerving masterpiece",
      "review": "'Joker' is an excellent character-piece on a man that gets beaten down in his world and changes into a terrifying symbol for others. Joaquin Pheonix's portrayal is unforgettable, carrying the film and making the character feel as real as possible. Though the movie may be slow for some, it is necessary to show all the events that are necessary to transform a character in this manner. The film is a must-watch due to Joaquin's portrayal of this classic character. An excellent performance, stunning cinematography, and stylistic score makes this film great."
    },
    {
      "title": " Awesome",
      "review": "The best ever it personafiese the joker's in every aspect"
    },
    {
      "title": " Say no more! Just watch it",
      "review": "Watching this movie seems like sitting with dementors for 2 hours (in a good way, obviously). They spread the darkness and eat your soul."
    },
    {
      "title": " Simply Brilliant",
      "review": "The whole movie, starting from the very first scene, connects to you deeply. It is a rare movie, I'd say, these kind of movies are made once in a century. It has all kinds of emotions, lows and highs, ups and downs, everything. The way they connect the story between Arthur Fleck (early Joker) & kid Bruce Wayne (Batman in future) made so much sense and had so much meaning to it. The script, story, screenplay, direction, everything in the movie was on point. The Music Director - Hildur Guðnadóttir completely nailed the BGM.I don't think we can find any fault in the movie, because there was not even one single actor who acted a bit off. Everything in this movie, was simply, perfect.Hence, Simply Brilliant."
    },
    {
      "title": " Brilliant",
      "review": "The supervillain of the batman the Joker there is some nice connection to the batman I absolutely enjoyed the movie and acting this actor phoenix that was the amazing part of the movie I have seen his movie first and I am his fan now brilliant performance."
    },
    {
      "title": " So good",
      "review": "Amazing. Joaquin was amazing. Gonna win an Oscar for sure"
    },
    {
      "title": " Phoenix rising",
      "review": "Joker is a human origin story that dispels the mystery behind the character known only as 'The Joker', or Jack Napier in the rarely referenced comic book lore. In this adaptation, it's a downtrodden Arthur Fleck. To me, this is not a comic book movie, it feeds into what is ultimately a comic book creation, but it offers a gritty realism that makes even 'The Dark Knight' look pretty.These are the days before the Batman dons the mask to save Gotham from itself, but 'Joker' shows how the vigilante may just be settling a longstanding debt that has come back to haunt the Wayne family, it even may suggest why Batman is merciful of The Joker - you'll see just how Batman's greatest nemesis was created - and it will surprise you to great effect; even if it differs from the traditional origin story. Some critics suggest this movie hasn't much to say, but in the context of the overarching Batman story, it absolutely does.It traded the notorious chemical incident and Chelsea smile for something perhaps a little less far-fetched - 'Joker' acknowledges the Batman universe, but the focus is very much on the concept and character that embodies the infamous clown and how the mask is a representation of chaos that can easily be spread, just as a mask can be used for justice. It's the Joker's turn in the limelight, as the Waynes are pushed to near minor characters, and cast in the shadow of moral ambiguity.Did you know that although the Joker was planned to be killed off during his initial appearance, he was spared by editorial intervention? This movie fittingly gives a nod to this part of the character's past in its closing scenes.The movie also offers an explanation for The Joker's hysterical laughing; what was once a tragedy became a comedy - and the rest is history.While fresh concepts carry this movie beyond the box office, it was slow in parts, and lacked a breadth of characters and locations. There weren't many grand sweeping shots of the Gotham landscape. There also weren't many subplots or cutaways to other characters, this isolated the plot into almost entirely Phoenix, where I feel there could have been opportunities to bring in other characters and perspectives.I disliked the subplot with Sophie Dumond as it didn't add much to the story, and also felt as if Arthur's character could have been more eccentric, instead some of his scripting was jarring, perhaps deliberately so - there needed to be more one-liners to reflect the Joker's natural wit and flair, although his outright strangeness was captured quite well, if a bit excessively.This movie delivers a solid punchline, 7.6/10."
    },
    {
      "title": " Beautiful, Mesmerizing and Haunting",
      "review": "I miss Heath Ledger and can't get enough of his portrayal of Joker. He was intimidating, scary, unpredictable and all other things. In 2016, we got Suicide Squad and Jared Leto as Joker both of which disappointed me very much. After that, I thought that I don't want to see another Joker interpretation on the big screen. I was skeptical when I heard that a standalone Joker movie was in works. Then I heard about the casting of Joaquin Phoenix as Joker and I developed an interest in it because I love his work. He is a method actor and has given some of my favorite performances for example in Her (2013) and The Master (2012). I decided to see the movie in the theater after hearing a lot about the movie, good and bad and I am glad that I saw it.This movie is really good, it exceeded my expectations and Joaquin Phoenix should get an Oscar for his work. He is phenomenal and I was blown away by his performance. His performance alone carries the whole movie and lets you experience and understand the character without saying much. His physique, movements, gestures, grace, way of speaking suggests that he gave his everything to make the character compelling and stand out from other Joker portrayals. He lost 52 pounds for the role. He embodied the character of Joker. Comparing his performance with Heath Ledger will be absurd. There is no common ground for comparison. Both interpretations of Joker are significantly different, the story is different, character motivations are different.Now talking about the story, this is a standalone Joker movie that shows how a man beaten up, neglected and humiliated by the society turns into a maniac. This movie follows Arthur Fleck who works as a party clown and lives with his mother. He wants to be a stand-up comic. He suffers from a condition causing him to laugh uncontrollably. We feel his loneliness, depression, and condition and sympathize with him for it. All the other performances were also very good. This movie isn't that much violent as people are saying it to be, but it makes you feel the violence and it is unsettling. It also allows the viewer to form their perspective about the character. Sometimes you will agree with his actions and sometimes you won't. There are also certain funny scenes in the movie but not everyone may find it funny.The movie is directed by Todd Phillips and he has done an outstanding job. I didn't think that the guy who made The Hangover movies can pull this off, but he did it. He showed that as a filmmaker, he can make more than just R rated comedies. The film is set in 1981 and the period is very well reflected in the movie. The cinematography is top-notch. Shot composition, camera placement, camera movement has been handled well. I was surprised by how good the Gotham city looked, beautiful and dirty at the same time. Each scene had a color scheme. The lights in the surroundings like light from streetlights, cars or the sky illuminated everything with their light. Joker/Arthur Fleck's emotions get conveyed through shades of light falling on him which is beautiful to look at. Music is beautiful, chilling, hypnotizing and speak lengths about the inner feelings of the character.I have just a few issues with the plot of the movie and how some things happen which shouldn't have happened or couldn't have happened, rest the movie is flawless."
    },
    {
      "title": " First Viewing 8/ Second Viewing 9",
      "review": "This movie benefits from a second viewing. You can really get into the film rather than getting into what the film does and doesn't do to meet your expectations based on what people are saying.Joaquin Phoenix DOMINATES the screen, this film is also technically great.I recommend seeing it at least twice to get all you can from it.First viewing 8/10 Second Viewing strong 9/10"
    },
    {
      "title": " A great transition in Joker perception",
      "review": "I watched the movie on 2nd October . I was so impressed by Joaquin performance and the way he has lost a significant weight in order to suit into the movie . He studied some aspects of psychiatry to lear how to do an abnormal laughter which is really challenging ! I believe he is the best who performed the joker and I am so far astonished by the high level he has reached in acting and doing a drama . The movie is excellent , it gets more exciting as you watch it and you will be captured by the character . Performance , Directing and scenario all 10/10 . Bravo"
    },
    {
      "title": " Pure MASTERPIECE",
      "review": "I can watch this movie million of times without getting bored."
    },
    {
      "title": " Heath",
      "review": "'Joker' character needed a face and Phoenix gave a perfect one it deserved, heath must be feeling very proud. And I'm currently 1 just for heath."
    },
    {
      "title": " The best Joker till date !",
      "review": "Joker is undoubtedly overwhelming, mind blowing , dazzling, breathtaking one !The movie slowly starts with Arthur's day to day life and completely turns into a chaotic athmosphere towards the end. I am sure of one thing this movie will be marked up as the best of Joaquin and the best Joker ever. I truly wanted to see a performance which overcomes Heath Ledger's Joker and Joaquin just made the wish come true. Joaquin Phoenix you beauty!Truly a masterpiece! Climax portions = Adrenaline Rush'There's no punchline' :)"
    },
    {
      "title": " Phoenix's Perfomance.....",
      "review": "....nothing short of amazing. Absolutely an academy award winning performance, despite anyone's opinion of the story line.....Like Marmite, you can love it or hate it, but Phoenix's acting ability deserves the HIGHEST marks"
    },
    {
      "title": " Joaquin Phoenix, Wow!!",
      "review": "First time ive ever reviewed a movie and this is deserving of my first, Joker was gritty, dark, intense and i absolutely loved it! His life was in fact a tragedy that in the end he saw as a comedy and that itself is heartbreaking to me, and as he got knocked further down by the world and people and events happening around him and descended more and more into madness it was quite sad to see him become Joker which i thought was powerful , but  his acting was incredible, the standard was ridiculous it even made me emotional marvelling at how insanely good he was on screen. Joaquin will win best actor at the 2020 Oscars, as nothing comes close to me in years. Todd Phillips shot a beautiful movie to look at, sleazy and grounded in realism so fair play to a guy no one beforehand believed he could pull this off with the announcement he was directing. And to top it off the score was beautiful and menacing. 9/10 for the film 10/10 for Joaquins performance, cant wait to see it again, And please no sequel it isnt needed atall!"
    },
    {
      "title": " Awesome",
      "review": "The best movie of the year Every one needs to watch it"
    },
    {
      "title": " Joaquin's no joke as the Joker...",
      "review": "Todd Philips' \"Joker\" has spread so many comments and controversy that I don't know exactly where to stand. The film reminded critics of Martin Scorsese's \"Taxi Driver\" and while Joaquin Phoenix' performance channeled the inner angst and alienation that drove the driver Bickle to an extreme -and bloody- corner, I found so many other sources of inspiration that if anything, \"Joker\" is the best tribute to the New Hollywood period.I found \"Network\" in the film, \"Death Wish\", references to \"The King of Comedy\", Marty's underrated movie about a man who wished to exist through the only talent he felt being endowed with... and naturally, there's something of \"A Clockwork Orange\" in the obscene stylishness the Joker embraces his new persona with. In a way, that the film met with controversy is logical, you can't make a social comment about violence and its dangerous appeal by sugarcoating it, violence like its enemies, use symbols and slogan, in fact, revolt is a mask that violence uses to operate undercover or is it the opposite? \"Joker\" is the slap today's audiences needed and that it used the Joker mask in our superhero era makes it even more relevant and accessible. But truth be said, any controversy the film should stir mustn't distract from the real deal.Indeed, any viewer familiar with one tenth of Phoenix' filmography knows the actor's ability to portray enigmatic and troubled characters with a dark side barely hidden, but even with that in mind it's impossible not to be blown away by his performance and compelled by his suffering. He shouldn't be the dark horse of the awards season but the frontrunner because his performance is so rich, so powerful, so intense and so bizarre and grotesque in a captivating way that it's almost like watching a movie within a movie, as if his distortable face was the operation theatre to his acting force, as if his nervous smile slowly turning into cries made a true symphony of pathos and anger. That actor is a treasure to Hollywood and here he's given the kind of rangy performances that can't do without earning awards. His snubbing would be controversy material if you asked me.Now, to the film. The first act immerses us in the life of Arthur Fleck, a clown and wannabe stand-up comedian. At first, I was afraid that the manic laughter scenes would be too redundant and turn themselves to cheap gimmicks, to remind us that we're dealing with the Joker, but no, Phoenix plays his Arthur as a man who's not a bad person. Raised by an over-protective and sickly mother, brutalized by kids who sees in a clown a living sign saying \"kick me\", humiliated by people who can't understand his medical condition, the point isn't to portray Joker as a martyr but a product of a specific environment and education, or lack thereof. Like anyone, he's got dreams, projects, but he's entrapped in a condition that makes it impossible to communicate or connect with the others except through hallucinations and would-happen moments, he's a misfit with a fragile condition that keeps worsening until it offers a platform for his dark psyche to perform.Does the film excuse him? No. Does it justify his actions? Hell, no. It just clarifies the need to perform that way. There's a point of no return reached in that psychological journey, when one humiliation too many triggers a strong desire to express itself through a sort of showmanship, something relevant in our days where people seek any ways to reach posterity. Set in what seems to be the early 80s, it puts Arthur in the same urban alienation context than Travis Bickle but with a passion shared with Rupert Pumpkin's and a \"mad-as-hell\" prophetic rage with Howard Beale's role. Near the end, there's a shot that follows one of the film's most shocking moment and it's an obvious nod to the anticlimactic finale of Lumet's masterpiece.But I can't insist too much on how good Phoenix his, one could see a few impersonations of Malcolm McDowell's dance when he \"punished\" his fellow droogs or get vibes from the two only performances that earned a posthumous Oscar, Peter Finch and Heath Ledger, still, there's something unique in that tormented role he inhabits with such a soul dedication that it makes Nicholon's Joker worse than the cartoon counterpart. ,\"Joker\" isn't dangerous but brave enough to question violence in the way it seems like the only plausible answer, it might titillate a few demagogue instincts but that's an unfair trial in the light of the recent events all over the world and that preceded the film. I walk often at night and see homeless people living in impoverished conditions, drowning their sorrows in alcohol and losing their manners once there's nothing to lose... and perhaps that's leaders' responsibility, praising democratic values while its application contradicts its own ideal. Anything is allowed when nothing is possible, is perhaps the biggest joke of all, and that it goes all downhill when the social budget is cut is perhaps the film's boldest stance against the shift between leaders and people.And that it used Bruce's father Thomas Wayne to connect the final act with a canon we're all familiar with is one of the many narrative delights of that character study and psychological thriller à la \"Woman Under the Influence\" where suspense doesn't come from a bomb but a ticking bomb of a soul. If De Niro's presence ties the plot with its chief inspirations, the film belongs to Joaquin Phoenix who gave a performance for ages, and a character who's relevant in the way he pits democratic ideals against urban reality. And my wish is to see another connection with De Niro with Phoenix winning an Oscar, it would be the second time for a character who already won one after De Niro with \"The Godfather Part II\".As for the glorifying violence trial... we've been there already."
    },
    {
      "title": " The Worst Part of Having a Mental Illness is People Expect You to Behave as if You Don't",
      "review": "Joaquin Phoenix is Arthur Fleck, the man who would be Joker. The entire movie is a character study on this man, with little themes interlaced such as mental illness and the divide between the wealthy and the poor. Unlike other attempts at the Joker's origin, this one did not take one bad day, but years and years of relentless abuse, trauma, and depression. We watch Arthur as he goes from one miserable day to the next, as everything gets worse and worse, and then he gets kicked while he's down for good measure (sometimes literally). This makes it a long, miserable, and uncomfortable viewing experience. The character we all know as Joker is barely present until the film's third act. Until then it's just Arthur Fleck and his descent into madness in a cruel and uncaring world.Joaquin Phoenix deserves every drop of praise he's getting. Every little bit of it. He's dream casting for a role like this, as it feels like Joker was written for him and only him. He's always been fantastic with tormented characters, those who skirt the borders of insanity. And not just movie insanity, but actual insanity. The darkness one's mind goes to when all hope is lost and happiness is an unknowable entity, when waking up every morning feels like stepping into a cold void, where you're trapped in your own head, you can't tell what's real and what's delusion. Phoenix taps into those feelings like a walk in the park. He slips into the role so well you have to keep slapping yourself to remind you you're empathising with a sociopath. His take will divide audiences. Some will find him hilarious, like a dark mirror of Charlie Chaplin, while others will watch him with intense sadness.Nothing encapsulates this better than his laughs. Yes, laughs, plural. Phoenix is not happy with just one iconic laugh. Instead he gives Joker a number of distinct laughs, and each of them are just as unnerving and characterful as the others. His fake laugh is the closest to a typical Joker laugh we get. He uses it at odd, inappropriate moments, or as an attempt to fit in with those around him. The way he cuts from a serious expression to manic laughter, and then back to a serious expression is equal parts hilarious and disturbing. He's lonely and detached from society. He doesn't know what makes a good joke. He doesn't find humour in the same things everyone else does, so in an effort to appear normal he puts on a fake laugh; over-the-top and terrible. His other laugh is an involuntary tick due to a mental condition, either from illness or injury. It's loud and hearty. And yet also grossly inappropriate. This time it isn't Arthur trying to fit in, it's a reflex he can't help, and usually comes out in moments of great stress or sadness. These moments are uncomfortable to watch because you can feel his desperation to make them stop. These are tragic, painful laughs masking tears.The other star of the movie is Hildur Guðnadóttir's haunting and upsetting score. It's a stripped-down orchestral score, centred on a handful of cellos. It evokes the tragic nature of Arthur's life, while also remaining dark and tense, putting you at constant unease. It uses silence and atmospheric lulls brilliantly, allowing the rest of the film to breathe before the overpowering single Cello line bursts back in. Even in Joker's final triumphant moment at the end of the film, the score still feels overpoweringly dark and brooding. This is no hero we're witnessing, this is a villain of pure evil and insanity.Joker is not your average comic book movie. Go in expecting a typical superhero origin and you'll be disappointed. There's no antagonist, no brazen action sequences. It's slow and methodical, the violence is sudden and disturbing, but used incredibly sparingly. Also for a film entitled 'Joker' it's not particularly funny either. It has its moments of genuine humour for sure, but usually the level of comedy is so dark you'd feel bad for laughing at it. There was a guy in my screening who, much like Arthur, was laughing at the most inappropriate moments and literally applauding the violence. It was like Arthur was in the cinema with me watching his own movie. It was unnerving, but mostly I couldn't understand how he didn't see the irony in it. You'll either find this movie a darkly hilarious comedy, or find the experience closer to a deeply upsetting traumatic event. We may never see another film like this, but it may also open the eyes and minds of major studios to what they can achieve with comic book material. An R-rated villain origin, in the style of a gritty indie drama, focussing on the depravity of mental illness. I give Joker a potentially industry-changing 9/10."
    },
    {
      "title": " Best movie for 2019",
      "review": "Best movie, Oscar for Joaquin Phoenix I have enjoy every minute"
    },
    {
      "title": " Brilliant!",
      "review": "Joaquin is superb. Deserves the Oscar for this performance"
    },
    {
      "title": " The best \"comic book\" movie!!!",
      "review": "Darker than dark knight!!! It beats endgame in the race for the best comic book of the year!!!"
    },
    {
      "title": " Worth all the hype",
      "review": "Joaquin absolutely nailed this performance, this is the best acting I've seen in a while (if he doesn't get an Oscar I don't know who will). The movie has a very simple premise, but is executed very well. Every scene looks like a painting and there are not many lines, but every one of them is powerful. Go watch it if you haven't!"
    },
    {
      "title": " THIS IS MAGIC !!!",
      "review": "Can't stop myself from talking about this one......#no_spoilersDark as hell, Joker takes u through the disturbing journey of Arthur Fleck, from being a clown & a wanna be stand- up comedian (with only one joke in his hand.....his life) to become THE \"JOKER\"......this journey never looked unreal though, unlike that of a hulk or a spider man....as this journey was quite human, logical and beautifully graphed and captured(of course) !!!Heath Ledger from the 'Dark Knight' was my personal favourite joker till date & Joaquin Phoenix took the legacy of Heath to another level altogether.....that laugh, that dance, that sprint, that walk....uff....can't get over that !!!Talking about the other aspects of the movie....the background music was the soul of the movie, if not the psyche and the madness of joker itself,,,,,the cinematography, the supporting cast, the direction...everything thing was right on money , the movie very smartly dealt with the then situation of America (the Gotham city),,,,,the unemployment, the raising power in the hands of the rich....all it took was a stand and a voice (be it good or bad) against the established power to become the 'HERO'...which further became the reason of the rise in murders & crime in the city !!!In his small appearance, the legend Robert De Niro was exceptionally awesome, something that u would expect from him everytime u see him on the screen.....that small conversation at the end btwn joker and De Niro was cinematic beauty and looked damn organic....an absolute treat to watch !!!Don't know about the oscars, but it was once in the lifetime performance by Joaquin Phoenix....and would remain in my heart for years & in my brain for days to come,,,may be.....The best portrayal of a psycho character that i have seen...was that of Christian Bale in 'American Psycho'.....Phoenix was right up there too if not above, not only the craziness, disturbance and madness but also the physical transformation was quite commendable.!! IF HEATH HAS GIVEN HIS LIFE FOR THE JOKER THEN I WOULD SAY PHOENIX HAS GIVEN A LIFE TO THE JOKER !!My one of the favourite lines from the movie was...joker saying to himself,,,\"I used to think that my life is a TRAGEDY but now i realise that it is nothing but COMEDY\"....so, u can imagine how disturbing a movie could be with it's theme being 'TRAGEDY=COMEDY'...but it was not that disturbing for me as i am used to of or aware of the ongoing social-political structure of our country !!!It has got those 'Dark Knight' (arguably one of the finest superhero movie ever made) vibes...i had an emotional ride, watching small Bruce Wane (Nolan's batman) meeting Joker, getting to know the pre batman story of the Gotham city and the back story or the building-up of the 'Joker the villain' of dark night.....IT WAS QUITE NOSTALGIC FOR ME IN THAT WAY !!!If i would have maximum of 5 stars to give to this movie, i would have simply divided it by zero (0).....i write about movies all the time but this one has that 'something' that forced me to type and share my views with u guys instead of writing it in my diary.....on that note i would like to finish this review with one line....\"THIS IS THE BEST MOVIE IN LAST SEVERAL YEARS THAT I SAW....& U CAN'T CAN'T CAN'T MISS IT\" !!!#JOKER_2019❤❤'ALL IT TAKES IS ONE BAD DAY'-JOKER😉😛😂"
    },
    {
      "title": " Outstanding!!!",
      "review": "Very intense!!! Superb acting!! If Joaquin Phoenix doesn't get an Oscar for this, I'll never watch them again!!! A definite must see movie!!!"
    },
    {
      "title": " Amazing! A work of art",
      "review": "I can't say anything it hasn't been said. This movie is a work of art. Should win 3 Oscars at least."
    },
    {
      "title": " Cinematic history- 10/10",
      "review": "Joker is perfect, it connects perfectly with DC universe without trying too hard. It's freaky, graphic and dark without coming across as forced or cheap. Overall it's a stunning film. The soundtrack is perfect (Cream-White Room towards end is fitting/awesome). Phoenix is superb, he gives so much poignancy and meaning to literally *every* word he says - \"All I have are negative thoughts\" you can literally see the pain in his eyes when he says it. It's fantastic.Overall, Joker is my new favourite film. Please go and watch it and decide for yourself. It's too good not to...And if it's not for you? That's ok! You probably just watched JP's Oscar nomination film so at least you can still be a part of cinematic history!"
    },
    {
      "title": " Depressing movie",
      "review": "This is a movie that I want to forget. The most disgusting and psychopathic movie I have ever watched.... :["
    },
    {
      "title": " This is not a BATMAN movie",
      "review": "If you are going to watch it thinking that it will be an action movie Well it is not This movie is so deep And that explains why a lot of people didn't get it You can do some readings before watch it Read about Anarchism And is good and bad are objective or subjective And culture and counterculture Also I recommend a book by George Orwell -animal farm- So yah you really need to know stuff to get it"
    },
    {
      "title": " Great movie!",
      "review": "I loved everything about this movie. I'm not a big DC fan, so I can't comment about how it does or doesn't follow the joker/batman story. Joaquin did a phenomenal job!! The music was also fantastic! It's depressing as it is dark and dealt with mental illness so you won't necessarily \"enjoy\" the movie, but it is one of the best movies I've seen this year. I saw this movie 2 weeks ago and I'm still thinking about it. I will be seeing it again."
    },
    {
      "title": " First DC movie i fell inlove with",
      "review": "Amazing movie, sign me up for a sequel. There have been too many great marvel movies and joker is one of the movies that can top that."
    },
    {
      "title": " Dissappointing and Underwhelming",
      "review": "Just to say that the film left me wanting to watch \"The King of Comedy\" and \"Taxi Driver\" the whole time, plus a few of the other films that this film strongly references. Joaquin Phoenix is fantastic however and the film has all the top production values that you'd expect of a big studio picture but it's generic and predicable in my opinion. It takes from so much that it's not it's own film for me. By no means is the film awful, it's just soulless. I'm not trying to be deliberately obtuse and against the tide of support for this film either, there are things as I've mentioned to commend and I'd like to add that going the way of gritty R rated film making is what I've wanted for years, from a more dramatic viewpoint, I thought \"Logan\" did what this film failed to do for me as a darker comic book oriented film. I hope people can respect my opinion just as I respect the free speech of everyone who really liked the film. Finally, I will add that those who have bashed the film for violence do not know what they're talking about. There are far more violent films than this and if one person or even a handful of people were incentivised to cause harm to others, the rest of us shouldn't have to pay for the odd few thank you very much. It's an interesting watch for certain and I'd recommend watching for that reason alone."
    },
    {
      "title": " In a world of horrible re-makes/sequels......",
      "review": "Joker is an original movie that may be slow for some people who cant sit patiently as you are rewarded with dramatic tension. I really do time my rest room breaks appropriately but it had me so focused I held it and ran out of my refreshments not to miss a detail. Yes I'll see it again and yes I'll buy it when it comes out. This is creatively told and shown in a rather clever way and allows you to forget that this man used to be Johnny Cash. Amazing performance!!!"
    },
    {
      "title": " Lives Up To The Hype",
      "review": "Nothing much to say except, this is what cinema should be. An amazing film and the performance of a lifetime by Joaquin Phoenix! Arthur's further descent into madness portrayed perfectly. We can all identify with sadness, Phoenix's performance makes you sympathize with this disturbed, neglected man. This was the best film I have seen in a long time."
    },
    {
      "title": " Just another overrated supervillain movie",
      "review": "Apart from A-Class acting, the story line of the movie is very basic and linear. I think I've expected way too much from this movie but it turned out to be just another in line."
    }
  ],
  "OnceUponaTime...inHollywood(2019)": [
    {
      "title": " amazing movie",
      "review": "Absolutely beautiful movie didn't expect it to be as good advice everyone to watch it"
    },
    {
      "title": " 2.5 hours of sheer boredom",
      "review": "Long, plodding, dull, confusingly edited, and way too many women's feet. It was exactly as bad as it looked in the trailers. Almost no action and Tarantino's trademark clever dialog is completely absent. Tarantino's self-indulgence has finally caught up with him. The first of his films I genuinely disliked."
    },
    {
      "title": " A time bomb ready to blow up.",
      "review": "The lack of plot forces Tarantino to keep us engaged through his sheer talent as a filmmaker. Thankfully, he has talent to spare. Tarantino makes wait for the bloody conclusion we know he'll give us, making us follow and hang out with the characters as they deal with their everyday life and their own personal issues. Sometimes it may feel like it's going nowhere, until we get there and we discover that the destination is both amazing and surprisingly touching. This is the kind of film that you're not sure what to think of when the credits roll, but the more you think about it, the more you realize that you had way more fun than you thought at first. It's not Tarantino's best, but that's only because we expect certain things from him; we get them, just in a way he's never done it before: detached and restrained. It feels like a ticking bomb; at times he ticking takes so long, it could drive you insane, but when it finally blows up, the damage is unbelievable."
    },
    {
      "title": " The most boring move ever made .",
      "review": "Not the worst movie ever, but the most boring.Over 2 hours only waiting waiting waiting waiting.I still fall a sleep almost when I think about this move."
    },
    {
      "title": " i dont understand, what are they doing..",
      "review": "No plot, boring, boring, very slow.. and everybody sleeep..."
    },
    {
      "title": " Once Upon a Time In Tarantino's world how the old Hollywood was",
      "review": "Last night I went to see with my friend in the movie teather the new Quentin Tarantino movie Once Upon a Time... in Hollywood. Since I reviewd his movie From Dusk Till Dawn (1996) which is my favorite Tarantino movie of all time. I like and enjoy this film a lot. I went watching his first movie in movie teather only for Tarantino him self and I decide to gave my proper review on the movie. I went to see it with my friend from work, my friend felt bored with the film I understood what the dircector was trying to do with this movie and what he try to show us. He bring us 50 years back in the history of Hollywood how it was and i like that.Quentin Tarantino is a brilliant, talented writer, director and actor and I respect his visions in movies so much. Once Upon a Time... in Hollywood it is a satirical, historic, comedy. Quentin Tarantino bringed us back in the past 50 years ago on 9th February 1969 and he show us how the 60's were that time in Hollywood. That year in February 9th my mom was only 25 years old at the time when this time is showed. My mom's birthday was 21st February and my mom turned 26th that year. I respect this movie so much and I respect Quentin Tarantino.I love Brad Pitt in this movie love his character Cliff Booth he was a heart of this movie and he was awesome. Brad Pitt is one of the best actors ever. He was brilliant, the actor is a professional and I absolutelly rooted for his character. Cliff Booth was a good heart likeable hero, he was a bad-ass and he wasn't afraid of no one. I think Brad Pitt is a good human being and I like him a lot. Leonardo DiCaprio was good I like him as a washed up actor Rick Dalton. Margot Robbie was excellent as Sharon Tate the actress really starts to become famous she played Tonya Harding in T, Tonya and now Sharon Tate. Margaret Qualley as Pussycat was hot babe I like her. Dakota Fanning as Squeaky Fromme hippie was also beautiful hot babe. Kurt Russell is in here too and he is excellent.The movie tells three story's: one is about washed up actor Rick Dalton played by Leonardo DiCaprio who used to be famous actor but now he is a drawning actor, who struggles to get a better roles in Hollywood and becoming a rising star once again. The second story is about Cliff Booth played by awesome Brad Pitt who is a stuntman out of work and he is Dalton's employe and friend. The third story evolves more about Sharon Tate played by awesome Margot Robbie in which she struggles with her husband Roman Polanski and her role in her movie The Wrecking Crew (1968) watching in the movie teather.Mostly this movie is also not comic and satirical but also reflects on events that year in 1969 and hippies \"The Manson Family\" that really happened and it is important event in history of Hollywood. I enjoy this film.Quentin Tarantino really surprised me, the problems I have is the movie is too long and lacks on action, I wish there would be more action, the action is only showed in the finale. Brad Pitt was a bad-ass he beat his assailant in the phone. I want to say they are 2 movies I enjoy that also reflects the past in the late 60's and that are Almost Famous (2000) and Zodiac (2007) with Once Upon a Time... in Hollywood they are all three great movies that I enjoy. I would give it 10 if the movie had more action, that is the only problem I had with the film so 9."
    },
    {
      "title": " mediocre",
      "review": "Absolute dross, wasted 2hrs of my life watching this rubbish, I went to watch this based on the review score of 8.0. All I can surmise is that there are a lot of folk that are easily pleased writing reviews on this site"
    },
    {
      "title": " Longest movie that never gets to the point",
      "review": "I was so bored and wasted almost 3 hours of my life."
    },
    {
      "title": " Waiting and waiting",
      "review": "The only reason why i gave it any stars is the climax and acting is good! Bring some pens to poke out your eyes for all the waiting til the end. I couldn't believe how many people loved this. It could have been at least 40 minutes shorter but probably a lot more. Thank god Leo and brad were eye candy in the meantime."
    },
    {
      "title": " Wonderful, simply wonderful",
      "review": "I don't remember laughing out loud so much in a movie. The twist, if it can be called that, at the end is phenomenal. I think the tension that built up throughout the movie explodes out of moviegoers in the last minutes due to an ending that is unexpected and brilliant.Pitt, DeCaprio and Robbie are wonderful. This film deserves Oscars."
    },
    {
      "title": " Not for everyone",
      "review": "If you just want to go to cinema and enjoy a movie with your friends, this film might not be what you're looking for. I am not a film critic and I don't know how to appreciate all aspects of an artistic movie, so since it has no storyline I found it a bit boring."
    },
    {
      "title": " One of the lamest movies of all time",
      "review": "This was the dumbest and most boring movie that I have ever seen until the last 15 minutes. I couldn't believe that DiCaprio and Pitt would waste their time with this nonsense. Inglorious Basterds, Reservoir Dogs and Pulp Fiction are 10s and this is a big fat ZERO. Do not waste your time or money."
    },
    {
      "title": " Excellent epic a throwback to yesterday of a golden era of culture, fame, struggle and friendship.",
      "review": "Once again Quentin Tarantino has done it another long and in depth film(almost three hours long for this one!) as the director mixes plot and stories that blend both drama, comedy, and action all in one. Again as is common in any film of Tarantino's is the cast is always all star and a memorable ensemble and it seems the acting and chemistry is always in top form. And this might be the director's finest film to date for it's look back in time to a memorable yesteryear era!\"Once Upon a Time in Hollywood\" is set in 1969 at the height and end of Hollywood's golden age an era of free spirits and cultural uprising. It follows the life of one Rick Booth(in fine form from Leonardo DiCaprio) a past his prime and faded TV actor who now struggles even to get small parts in TV westerns, and Booth seems hopeless yet he's still friends with his buddy and partner in crime that being his stunt double Cliff Booth(Brad Pitt). The two burn plenty of midnight oil together still a ray of light is found when Rick gets a second chance and a rebirth by doing international pictures and marrying an Italian beauty.In somewhat of a wild card and subplot story Dalton's neighbor is the sexy and young actress Sharon Tate(Margot Robbie) who spices and lightens up the screen as a young star in the making. Also introduced is the strange and notorious Charles Manson. The film even has a surprise and happy ending! Overall excellent well done epic that pays homage to the past as it's a showcase of different stories that connects up with different characters."
    },
    {
      "title": " Further proof that Tarantino does genre like no one else",
      "review": "Vivid, relaxed, nostalgic and indulgent, Tarantino's 9th film is, by its own small stroke of brilliance, a near complete divergence from his previous works. As a slow burner, this film notably values character above plot, and has a loose structure that seems to lack in the urgency that drives works such as Inglorious Basterds or Django Unchained. Nonetheless, in true Tarantino fashion, it delivers an acting masterclass, and serves as proof that Tarantino does genre pieces, and shows versatility in the face of expectation, like no one else.This film isn't for everyone. But don't let that stop you for enjoying you what it is - another brilliant film."
    },
    {
      "title": " Amazing",
      "review": "From places in movie to performances truly a gem Leonardo is Oscar worthy!"
    },
    {
      "title": " You just don't see movies like this anymore",
      "review": "This is classic QT, showing that he is still at the top of his class when it comes to filmmaking. Plot has little to do with most Tarantino films, and this one is no exception. This film has great dialogue and beautiful set design and cinematography. The characters are all fleshed out and the acting is top-notch. Instead of going with a simple Hollywood formula (conventional plot and screenplay), QT sticks to what he knows best and makes a movie similar to his others, while also expanding upon typical Tarantino-isms (the film is more rooted in comedy than his others). Overall, this not a movie you see nowadays in Hollywood. It is sad that we only get one more QT film!"
    },
    {
      "title": " Tarantino's best film by quite a bit",
      "review": "None of the annoying dialogue of his earlier films, not much of the glorious violence of some of his noughties films, this is an odd film from the director. It holds his best qualities - an extreme attention to detail, a complete adoration of everything he puts in frame - but with somehow more maturity, more emotion. Have you ever cried in a Tarantino film before? OUATIH might be the first time that'll happen to you. I do not wish to reveal the ending, but I will say that he manages to deal with a real situation with respect and sophistication. Anyone offended or confused ought to think again about it. If this was to be the final Tarantino film it would be a perfect swan song - I can't think how his tenth could be better than this."
    },
    {
      "title": " No story",
      "review": "I waited months for this movie to come out! The Hateful Eight and Inglorious Bastards are both one of my favorite movies.. But this movie was one of the biggest dissapointments in my movie-watch-life:'(. No story.. Characters with no purpose.. And really boring scenes. Only 2 really good scenes in the entire movie? This movie is a waste of time and should have been a 30 min movie."
    },
    {
      "title": " Utter crap!",
      "review": "Other than to rewrite the Manson murders! What the hell is the point in this movie? There is no plot, no story? Just endless scenes of tarantino trying to be different and failing tragically? Do not waste two and a half hours of your life on this giant, steaming pile of crap!"
    },
    {
      "title": " Future Classic",
      "review": "Like Inglorious B******ds, audiences are invited to join Tarintino in his parallel universe of historic events altered, Tarintino style, which is shown in the last half an hour of the motion picture.Proven to be historically accurate in the first two hours of the film, Quentin's exploration of the life of Sharon Tate in the first 6 months before her death is portrayed beautifully by the performance of Margot Robbie along with the beautiful cinematography of Los Angeles during the last definitive years of Hollywood. We then delve in to the night of her death where the build up intensively reminds those who know of the Charles Manson murders well enough will understand what is about to occur. That's where the fictional characters come in; Rick Dalton (DiCaprio) and Cliff Booth (Pitt). An actor living next door to a famous film director is any actor's dream, but not when you live near one of Manson's targets. Tarintino invites these characters to fight against members of the Charles Manson family with plenty of blood and violence to kill them off Tarintino style, leaving Sharon Tate happily alive to live on.Both historically accurate and fictional fun, Quentin Tarantino juxtaposes his characters along famous movie stars at the right place at the right time, leaving audiences to wish that the events of the last half hour of the film were actually real"
    },
    {
      "title": " loving ode to Hollywood of yesteryear",
      "review": "Just seen QT's latest.I enjoyed every minute of it. Hollywood lates sixties, is pure eye candy. The soundtrack is awesome en the acting second tot none.I must say I love all QT's work. This picture in my opinion, isn't his best, maybe not even top three. What it is, is a well crafted peace of work from the master. It's funny, there's not much action, decent dialogues, but the setting and the entire feel of the movie is great.If you're not familiar with Tarantino's work, you might not want to see it a second time.I love to see it again."
    },
    {
      "title": " BETTER than Typical QT",
      "review": "I dreaded the length of this film & almost waited for DVD. I was pleasantly surprised at how fast it went b/c it is SO VISUALLY RICH & engaging. Admittedly slower pacing than expected from QT, but the pacing weaves a story & visuals that is ultimately rewarding. Perhaps 20-something's won't appreciate (1) the Hollywood & pop-culture nostalgia, (2) the brilliant music placement choices & (3) Leo's multi-layered, complex portrayal of a \"dying breed\" while simultaneously illustrating the character's shallow, short-sighted self-absorption -- VERY tough job to harness a character who is shown \"acting within the acting.\" QT is the master at showing us the most believable fantasy characters & re-imagining how they might interact with our historical realities. I was also dreading the violence b/c wondering how QT could possibly have the stones (and bad taste) to put the real-life murders on the big screen. Everyone knows QT films result in gruesome deaths, but this ending was SO BRILLIANT & satisfying (in a Tarantino way) -- a \"once upon a time\" tale that leaves you wishing it had happened that way in real life. See it on the big screen -- small screen inadequate for enjoying the tightly-packed scenery & depth of textures this film delivers."
    },
    {
      "title": " Beyond Words",
      "review": "Just go watch it. Everything about this film is phenomenal. From the musical choices, the dialogue, camera angles(the box office scene may be my favorite scene of the film), to how the mood changes based on which story you're telling; Quentin has done it again. This film will be studied for years to come, guaranteed."
    },
    {
      "title": " In a world where movies are made for everyone, QT does what he does best, and makes a masterpiece not everyone will appreciate.",
      "review": "I have now seen this movie three times in theatres... and by god I may indulge again tomorrow night. That to me is the very description of the crafted, honed, and mastered skill that QT has.First off let me say that this IS NOT a movie everyone will appreciate. I was reminded by this as I seen this the first time with a \"less appreciative\" relative of mine, then upon leaving the theatre he glanced at the poster next door and mumbled \"shoulda seen Hobbs and Shaw\". *I gasp*This movie shatters everything that makes the films that pour into the cinema. I truly believe it's QT spitting on what \"should\" be. \"Oh you think this scene feels uncomfortable? Well here! Oh this doesn't ring true to the real events? Who said it should?! Oh you're getting bored? WELL FLAMETHROWER. It's NOT story driven (you ask me to tell you what the movie is about and I'm hard pressed to get that into one sentence), it's NOT making you feel stupid by finding ways to introduce characters and situations, every shot DOES NOT have a purpose, every scene DOES NOT lead to further the plot. ...And I love it. (More about that below)This movie to me is simply about life. It does what movies I believe are forgetting they should do, it transports you to another time, another era, and by the last act, another reality. I can't believe after seeing the trailer I expected (well... with a QT movie I can't believe I foolishly set my expectations anywhere) a noir thriller about the Manson murders. When walking out of the theatre I realized Charles Manson has LITERALLY one scene! This isn't a \"wooooow that was so cool when that happened\" type movie, it's a journey through relatively regular lives of a couple of people in an incredible era. It's filled with subtle questions about the social construct we live in, fame, the duality of man, and yet still rings true to the QT movies of the past pulling out a scene that makes you sit up in your seat and go \"...what the living f+%# was that\".Onto the movie itself, it has terrific performances all around. Brad Pitt at the best I believe I've seen him in a long time, Leo does what Leo does he's a great actor. Robbie pulls off a Sharron Tate so ditsy, yet at the same time so kind hearted. Although I believe the REAL star of the show was a 12 *achem* I mean 8 year old girl who stole EVERY SECOND of the few scenes she was in.The dialogue? Crisp. Not the best we've seen from QT, but MORE then enough to remind why he's one of the very best. This isn't a short film, and it doesn't speed along to say the least, but with dialogue like this who needs it to?? I found myself wanting scenes to continue just to hear more back and forth, more witty comments, more punch lines that hang in the air as the conversation moves on.That all paired with BEAUTIFUL shots of the city that brought us anything playing in the local theatre, and a soundtrack. OHHH the soundtrack. From a driving at night shot of Brad Pitts \"Ramblin Gamblin Man\"(Bob Segar) to the ominous \"Out of Time\" wails of the Rolling Stones as Sharron Tate heads home for that fateful evening. If you're not into the vibe of the city the music will get you there quick.A film I truly am proud to say I witnessed released, and will indeed quench the thirst for a Tarantino movie till the 10th and final, and for years to come after."
    },
    {
      "title": " Once Upon a Time Movies had Plots !!",
      "review": "I absolutely agree with the honest reviews regarding lack of story and character development and had their been a plot then this would be worthy of a 9-10 rating and most certainly Tarantino's Best work to date however instead we get a series of stand alone film clips secondary to a visual journey of all the Hollywood Vintage Landmarks successfully capturing the time period with integrity The Acting was top notch and set design was at its best however this fell short of what could of been an awesome story piggy backing off the cinematography and certainly not comparable to Pulp fiction for its intertwining plots which this could of desperately used to become a Gem !! DiCaprio and Pitt (Redford and Newman) need i say more ?? hopefully Tarantino is not serious about retiring because i truly believe his best is yet to come !!"
    },
    {
      "title": " More Misdirection Than Penn and Teller",
      "review": "Tarantino has stated that \"Once\" is not Sharon Tate's movie. It's Rick Dalton's story. Yes, we get to ride the emotional rollercoaster of a man losing his place in his society, then discovering \"too little, too late\" that he may have had the acting chops all along that could have saved him from his plight. While that tempest rages we get to glide along with Cliff Booth, who possesses the self assurance of a man adept at martial arts with the ability to have anyone \"do anything you want to him. Throw him off a building, alright? Light him on fire. Hit him with a Lincoln, right? Get creative. Do whatever you want ...\" Cliff's journey stands in sharp counterpoint to the star he shadows.But what of Sharon Tate? Her little snippets (not even vignettes) pepper the movie, and leads to ..... WHAT?In the movie, had she not been featured the way she was, she would have (as in real life) been viewed as just another blonde bimbo starlet snatched up as so much candy on a successful director's arm. The movie provides us an opportunity to get to know Sharon (unlike real life), as a pretty young woman who has maintained her humanity, her friendliness, her affection for her friends and her public, and her warm affinity for all she meets. Her interaction with the ticket taker and the manager of the theater, her quiet enjoyment of the audience enjoying her point to a woman of depth of character, someone worth knowing. Someone worth grieving over.Reviews have been written about the over the top violence ending this film. Yet none of the violence compares to that actually perpetrated against Sharon and her friends in real life. To know this young woman was repeatedly knifed while her unborn child was carved from her body, to imagine the Manson family reveling in their blood lust, scrawling the word \"PIG\" on the walls in the young mother's blood, to know she begged for mercy having done nothing at all to provoke the mayhem performed on her makes the movie violence seen here a footnote to the atrocity that actually occurred.Understanding this, we're left with a piquancy, a longing sadness, barely buoyed by the ending offered by the film. For those criticizing the film for being too slow, for those debasing this effort as not providing enough tension, for the rabid shoot-em-up fans I suggest they view this as a trick performed by the expert magicians, Penn and Teller. It looks like a revenge fantasy: nope, it's a character study. HA! Fooled you all again! It's a rom-com! And like any Tarantino movie, twisting all our expectations, the ending to his rom-com leaves you with an aching heart."
    },
    {
      "title": " Masterpiece",
      "review": "Amazing! Absolutely brilliant from start to finish. I didn't know what to expect and I was blown away"
    },
    {
      "title": " Disappointed!",
      "review": "I am giving it 5 coz leonardo and brad were awesome. But margot's role was very insignificant. The movie was good in bits and pieces but as a whole there is no meaning that one could make out from the movie. It is very random. It was boring too at many points. I would not recommend you to waste your money on this."
    },
    {
      "title": " Boring until the end",
      "review": "Now I love Tarantino but there was absolutely no need for 3/4 of this film. The last 15 minutes are spectacular. But I almost walked out it was so boring. So boring. great acting of course from Leo and Brad, particularly Leo having a word with himself in his trailer, but the majority of the film is just awful. But the last 15 minutes, are an absolute triumph. Make sure you read up on Charles Manson before you see it though.."
    },
    {
      "title": " What was the point?",
      "review": "During the first 2 Hours of the movie I was more interested in the hair of the man in front of me at the cinema. No storyline or action whatsoever from that. Then it skips to 6 months later or more (I can't honestly remember) and then there's a bit of action but nothing to do with the story so far. The action was pretty funny and gory to be fair but then it ends and you can't quite figure out what you've watched. Brad Pitt was pretty good. Di Caprio and Margot Robbie have been payed to act really well with no intent of giving their characters anything to do. Maybe it was just a movie for older people or fans of westerns, maybe it all went over my head, but most likely it was the most boring movie I have ever watched. I'd say it's not worth watching again to figure it all out. Also if my dad watches this (and he loves westerns), he'll be asleep within the first 10 minutes."
    },
    {
      "title": " Strangely Good",
      "review": "Well, the first two hours is a bit hard to enjoy if you are not used to the American late 60s. The cast is incredible as usual and that was the main reason that kept my attention. Music was unbelievably good and well suited. The events chain is somehow similar with the Pulp Fiction but it's in a bit different style. The brutal action scenes were highly creative and were really brutal, I was shocked when the dog food thing happened. I wonder how the gun is able to fire after it was soaked in that pool. I think both the DiCaprio and Pitt were awesome.Long story short, I recommend."
    },
    {
      "title": " 'The emperor's new clothes' Tarantino style",
      "review": "Lack of strong dialogues. Clue of the movie is trivial No goosebumpsSince Tarentino is a proven genius, this movie must be 'The emperor's new clothes' Tarantino style :)"
    },
    {
      "title": " No plot",
      "review": "This was such a waste of time. It was so boring since there was absolutely no plot. Forced myself to sit through the entire film and regretted it, especially towards the end when things got gruesome and gory. Save your money and your time please."
    },
    {
      "title": " Worst movie since waterworld.",
      "review": "Like the actors but was very boring and felt like the longest movie ever."
    },
    {
      "title": " Brad Pitt is HOT!!! Movie is too long...",
      "review": "Went into this movie without any expectations. In fact, I thought I was going to hate it. The scenes with Leo could've been cut in half but the ones with Brad were amazing. The movie was too long but the ending was fabulous. I highly recommend it."
    },
    {
      "title": " Not Tarantino's best",
      "review": "So much of this movie is excellent just as you would expect from the Master. Only 6 stars as It is slow and I found it boring, very low on entertainment. Albeit no regrets paying to see it on the big screen as it is an authentic look at the 60's. To an old fart like me it worked like a time machine."
    },
    {
      "title": " Controversial view incoming...",
      "review": "Anyone who has watched countless of interviews with the man Quentin Tarantino knows that the violence in his movies aren't funny or entertaining for him explicitly for its visual absurdity alone but for the idea of actually avenging \"bad guys\".Now this concept in movies is of course not only a reflection of Mr. Tarantino himself but a reflection of the average man and his world view. There is a sense of superiority underlying the desire to avenge or desire to hurt someone, not in solely self-defence but actually because they enjoy it.But this phenomena of revenge and all the drama that comes with it could in movies just be an innocent mirror to show how human relationships actually look like in reality but this movie in particular does not innocently capture the essence of man, it might actually glorify violence. We are supposed to be on the side of the \"cool good guys\" just like in Django and Inglorious.This film was also described by many as a love letter to the old age of Hollywood and that sounds very beautiful. To me however, this film was mostly perceived as a sad story. Leonardo DiCaprio plays Rick Dalton who happens to live for... wait for it... pride? Seriously? Is that supposed to be romantic? Pride, the feeling of wanting to desperately hold on to an image of ones self as a fantastic man and the destructive behavioral patterns that manifest themselves as soon as this mental image is threatened. Sounds very beautiful indeed... No but seriously, no wonder there are wars out there in real life when most people actually live their life defending their self image just like Rick Dalton instead of looking at the world without those self-centered pleasure seeking glasses.Brad Pitt played charismatic stuntman Cliff Booth, a man who did not only feel like punching a not so threatening guy for puncturing his car tire but also keep punching him several times for nothing but a show off of superiority.The end of the movie dehumanized people that were ideologically possessed and possibly mentally ill. That doesn't mean that the last scenes weren't funny in its absurdity. But something can be fun and sad at the same time.What makes the violence in this movie somewhat disturbing isn't the violence in itself (we live in a violent world and we can play with violence in a lot of funny ways in popular culture) but how the violence lands in the context of a landscape that to me felt very serious and earnest in the portraying of two guys and their relationship in the world of Hollywood.Otherwise good cinematography and good acting from practically everyone although the longer witty dialogue was missing in this movie in comparison to earlier films by Tarantino. I enjoyed especially the portrayal of Rick Dalton.No need to agree with what I say, I know that I likely will be perceived as a boring person who took this comedy too seriously. Many people enjoyed this movie and that I can't take away from them but I can't help but think of how this movie and its reception really is a reflection of how to the bone sick our culture really is. I'm especially fascinated by some people's view of this movie as \"intelligent\" and \"mature\". It could as I perceive it only be intelligent, mature and deep in a narcissistic culture.We do not seem to want peace, we want to enforce the idea of peace and responsibility on other people and mock those who doesn't agree."
    },
    {
      "title": " A BLAST!",
      "review": "This movie is meant to be watched In theatres it's s 3 hours and I wasn't bored a bit the twist at the end was a great change of history and I cried when Bruce got chucked at a car this was the best time I've had all year especially after seeing Godzilla KOTM and yesterday witch sucked"
    },
    {
      "title": " Slow unlike his previous films and an homage to Sharon Tate",
      "review": "I have seen the previous 8 Tarantino films and he always has A actors in them. I thought I was going to like this one but it was painfully slow and with no sense at all. The acting was great, cinematography too, there were funny scenes including one with a guy playing Bruce Lee (this event never happened in real life) and fans of Lee might be outraged and laugh at the same time with this unreal but funny scene. The last minutes of the film were really a Tarantino movie with some of the gore and violence that´s been in his previous movies (I am not a fan of gory nor violent movies at all, but I find QT´s funny and quite different). it seems OUATIH was made because of his love and nostalgia to good old films from the 60s and 70s and for the ending, he created a timeline on the Sharon Tate fate because I assume, he wanted to do an homage to Sharon and the other unfortunate victims."
    },
    {
      "title": " Wow! This movie was extremely NOT AMAZING!",
      "review": "Once Upon a Time in Hollywood is, by far, the most pointless, meandering, excruciatingly un-entertaining work of the usually reliable master, Quentin Tarantino! Only a handful of good-to-very good performances save this unintentional \"disaster film\" from complete worthlessness! Fortunately for the picture, one of those performances is by one of its stars, Brad Pitt, who is consistently watchable and entertaining throughout, even as the film he inhabits so often isn't! Pitt's fellow co-lead, Leonardo DiCaprio is barely memorable (and not even particularly good) as a character who isn't especially likeable, or compelling, anyway! Most telling of DiCaprio's shortcomings in the film is the way he easily gets his \"thespian clock\" cleaned by a then-9 year old actress, Julia Butters, who dominates scenes with him with a seemingly effortless, naturalistic style (seriously, she is one of the best things about the film)! Also very good is the gorgeous Margaret Qualley (Andie MacDowell's real-life daughter) who plays a comely hitchhiker who brings an unsuspecting Pitt into contact with several Manson family members! The fight scene between Pitt and \"Bruce Lee\" was also entertaining, yet these are all mere moments in a largely overstuffed, hapless mess of a picture! Also, conspicuously absent from the film is writer Tarantino's gift of creating memorable, quotable, dialogue! Not only is the movie crafted in a blandly disposable way, Once Upon a Time in Hollywood has precious little of the inspired genius that has profoundly uplifted so many other Tarantino films before it!"
    },
    {
      "title": " Movie making is an art and Tarantino is Davinci",
      "review": "Although Samuel L jackson and Christopher waltz were majorly missed and would have added cherry on top. This was absolutely are at its finest, Tarantino and his marvelous art of alternate story line is at its finest."
    },
    {
      "title": " A Fairy Tale we can all appreciate.",
      "review": "I came across a very very decent review that mentioned,\" this film is not for everyone..\" and I believe that proves true with this film. The same can be said for almost all Quentin Tarantino's film's. You either see the humor or you don't. You either think they are classics or you don't. You think it's too violent or you don't, and again I think that proves to be the case with Once Upon A Time In Hollywood. As the film begins you are dropped into the world of Hollywood in 1969 and all that that involves. Hippies, drugs, actors and actresses, beautiful sets and images of L.A., movie sets and cameras, and of course lots of cigarettes. But the magic with Tarantino is he shows you just how extraordinary the ordinary can be be even when he has super star Hollywood A list members portraying complex characters. Leo is incredible and brings the same star power he oozed with in \"Wolf of Wall Street\" and that star power never goes dim through the almost three hour film. Brad Pitt was the hero we all deserved and the one we needed And reveals just how magical the actor can be given any type character just like he has throughout his career. What can't be said of Margot Robbie and her Almost literal becoming of the late Sharron Tate. Robbie is truly a student of the game and profession of acting, she brings Mrs. Tate to life again. It's a movie you have to watch to understand why it's so special and of course even involving the manson family murders is incredibly shaky ground, but the way Tarantino ends the film is truly a classy and an even noble way to end a film with the specific context. Simply put this is a story about,\" what if the the fairy tale did exist? What if the bad guy Didn't win?\""
    },
    {
      "title": " Tarantino again writes his own world",
      "review": "This is a movie which, if you'll understand, you'll know how tarantino plays with the real world happening and how the movie tampers with it giving you excitement. First of all you need to know the infamous tragedy of Sharon Tate in 1960s, which will eventually after a point in the movie play on your mind and you'll realise that Tarantino is again rewriting his fantasised history. Tge beauty of the film is that it transcends between real world tragedy and the fantasy fate of it. Tarantino throws in two fictional characters to save a real life character in the movie and if you don't understand this you'll not enjoy the movie. This is what it feels like watching a movie of 2019 where filmamking and storytelling is so advanced that only a few can understand and realize the beauty of it. Just one thing that could have been better if we could have been treated some action of the two main leads a little more somewhere in the middle of the movie, around after 80 minutes of the movie it feels just a little bit slow, that could have been a little more entertaining. But a great movie and a must watch if you watch Tarantino movies and know how he goes by them."
    },
    {
      "title": " \"Baby, baby, baby, you're out of time.\"",
      "review": "Well I'm a big Tarantino fan, but I have to say, this one missed the mark for me. I thought the movie's pacing was excruciating, as most of the time nothing seemed to be happening. I didn't know anything about the story going in, so as it unfolded I was able to figure out that it had something to do with the Manson Gang, which had me prepared for a typically violent crescendo as the story came to a climax. However the film opted for an alternate reality to the actual events of August, 1969. This version had the Manson followers wind up at the wrong house, to be met with a fading television actor and his regular stunt double, dishing out punishment in true Tarantino style. By that time, my only reaction was to laugh at the absurdity of it all, what with Brad Pitt hammering his victim mercilessly into any available furniture, while Leonardo DiCaprio whipped out his trusty flame thrower to nail the chick in the swimming pool. Not bad for the guy who broke down on the set of 'Lancer' when he couldn't deliver his lines right.In passing, the actors who portrayed Steve McQueen and Bruce Lee had an eerie way of channeling the former celebrities. Damian Lewis couldn't have been a better choice to mimic McQueen, he had the look and mannerisms that had me thinking he could have been the real deal. Mike Moh in some ways, looked more like Jason Scott Lee portraying Bruce Lee in the movie \"Dragon: The Bruce Lee Story\". I read that the family of Bruce Lee wasn't happy with the way Tarantino represented the former martial arts star in the film, but if that's the case, the same would have to be said of 'Dragon' because Jason Lee's interpretation to my mind was pretty much the same.For nostalgia fans like myself, the film has some merit in reliving the names of old time TV and movie programs like 'Mannix', and Steve McQueen's 'Wanted:Dead or Alive', reinvented for this picture as 'Bounty Law'. There's also the 'Lancer' spot with Timothy Olyphant portraying that series' star, James Stacy. Margot Robbie was stunning as Sharon Tate, and if Tarantino had been a little sharper, he might have thrown in a plug for the only Sharon Tate film I've ever seen, 1967's \"The Fearless Vampire Killers\". But unfortunately, just like that old horror comedy, this story was sooooo long, with interminable scenes stretching the distance from one point to another, it felt a lot like those old horse chase scenes did in 'B' Westerns from the Thirties and Forties."
    },
    {
      "title": " Very good movie DONT LISTEN TO THE CRITICS",
      "review": "This is a very good movie but its not for Everyone, Tarantino fans would like it a lot."
    },
    {
      "title": " Not what I expected",
      "review": "Im not sure what I expected, this seemed more like a leo acting reel (which is fine) but without him and pitt im not sure how good this movie would have been. People complaining about multiple story lines, its tarantino, you should have stayed home. I love tarantino's flicks but this is down there with deathproof. It has its moments, hell ill watch it a few more times when it comes out. But its one of those movies ill play when im trying to fall asleep for work. I tech gave this a 7.8 imo. The climax was not worth the wait. No hating here just my honest opinion of the flick. Great acting by everyone in the movie, even the nobodies."
    },
    {
      "title": " Amazing film all round!",
      "review": "An excellent portrayal of 1960's Hollywood and so many subtle references that are just amazing. All around the acting was excellent from and excellent cast. I Absolutely loved this movie and believe it has very much done something very unique. Awesome film!"
    },
    {
      "title": " Trying to explain someone why this movie is a masterpiece is like you trying to explain a blind man different colours",
      "review": "I said everything in the title. If you don't like this movie I guess for you is next door screening like Hobbs&Shaw(no offence, it is how it is). I wasn't born yet to experience 60's but Mr. Tarantino took me there for 3 hours. One of the best gifts in my life. Thank you Sir."
    },
    {
      "title": " Masterclass filmmaking.",
      "review": "Every shot, every frame is compelling. The acting down to the bit parts are flawless. DiCaprio will win Best Actor for a clinic he puts on. And only QT could do what he did here. Easily up there with Reservoir Dogs and Pulp Fiction. Easily. Brilliant, shocking and Hilarious. Bravo."
    },
    {
      "title": " Disappointed",
      "review": "I'm a huge QT fan so writing this is disappointing to say the least.I went in expecting a lot but came out slightly confused and very disappointed.There's a lack of plot and story as the film just seems like a load of clips just stick together! Has to be the worst movie of the lot.There were a few note worthy bits but nothing to shout about. It almost feels lazy, as maybe QT has set the bar too high with Pulp Fiction and Kill Bill. It never really gets going and there isn't the usual witty drawn out conversations between the main characters."
    }
  ]
}