{
  "DowntonAbbey(2019)": [
    {
      "title": " A superb production...thoroughly enjoyable!",
      "review": "As ever we have the Downton high quality production values in a cinema setting. Fantastic acting and cinematography. The narrative a tiny bit far fetched in places but hey ho this is sumptuous and real entertainment. I am very tempted to give it ten stars because you leave the cinema with a warm feeling. Congratulations to Julian Fellowes and the fabulously talented creative and technical team."
    },
    {
      "title": " Nice costuming.",
      "review": "Spoilers. Opinions. Observations. Reflections.Nice costuming. The most standout are the red vests/uniforms worn by the royal servers.I also liked the women's costumes. Even Lady Edith looked pretty good this time, plus her period-era one-piece undergarment showed some cleavage and inferred a little sexuality - being that she was finally married to a decent chap and even in the early stages of yet another pregnancy. Whew, that was long-winded.I enjoyed seeing the old cast. I was disappointed that Barrow was no longer the conniving scoundrel that he had been in the TV series. I was happy that O'Brien was not in the film, but perhaps she, too, may have become sugary sweet. Ugh.The family started out poor, for aristos, since they had to be bailed out by Shirley MacLaine's family money at the beginning. Toward the end of this film, they are still trying to put their heads together to think of ways to keep the property financially afloat.Irony: Highclere Castle, the estate in real life, today has events and tours in order to keep the property financially afloat. Renting it out to make the TV series and this film is just one of its money-making ventures. Gotta pay the light bill, you know. Pip, pip. Cheerio.King George V and Queen Mary of Teck were the paternal grandparents, in real life, of the current Queen Elizabeth II of England. They were the parents of King George VI, Elizabeth's father. They were also the parents of King Edward VII, Elizabeth's uncle, the famous abdicator."
    },
    {
      "title": " Wonderful sets!",
      "review": "I forgot to mention how wonderful the sets were. I especially liked the trains, trolleys, automobiles and trucks.And, I do hope that Disney does not buy this franchise and ruin it like they have done to others."
    },
    {
      "title": " Priceless Gem",
      "review": "This movie is pure perfection. It is a wonderful continuation of the TV Series. I think reviewers do not know how to rate this movie because it is just delightful. There is no violence, foul language, and nastiness between characters. It's just a love letter to the fans. Julian Fellows has done a brilliant job with the script and has brought the production level to the next level. Go see it if you want to leave a movie feeling good and smiling."
    },
    {
      "title": " Predictable",
      "review": "All the hype didn't live up to the reality .I would have fallen asleep IF it had not have been for the wit of Maggie Smith . She made that film .They should have kept it to the Tv screen"
    },
    {
      "title": " Elegant as Ever",
      "review": "I enjoyed the movie as much as much as I did the TV series. They kept the personalities of all the characters the same, along with the same enjoyable relations. Also, I noticed that those who were without love in their lives (Tom Branson, Thomas Barrow), were provided someone in which to start a budding romance. The movie was the perfect length of time and was pretty much perfect in ever way except when Granny Gratham revealed she was dying. The viewers didn't need to know this. Kudos to Julian Fellows and his quirky and lovable characters."
    },
    {
      "title": " Downton Abbey",
      "review": "The TV series continues with the king and queen visiting the house.The wisdom here is that instead of trying to create something different for the cinema, the makers have essentially given fans what they want - more of the same, albeit on a larger scale. All is as it should be, with little in the way of threat, Smith getting all the best lines and the characters beloved by millions all getting a chunk of action. The only criticism is that too many stories are closed off with various conversations in the last 15 minutes which does go on. This is a minor quibble - a pleasant bit of fluff to be sure."
    },
    {
      "title": " A Postcard of Love to the faithful.",
      "review": "With wit, charm, grace and a bit of larceny, Downton Abbey has returned to us. I will leave the nit-picking to others, while I simply say it was a joy to watch our old friends return in this splendid movie. Yes, a couple of my cast favorites, were up on the screen less than I'd liked, but balancing out a cast of 20 is an art, and I'm sure Julian Fellows the showrunner, creator of the film entity knew he'd have to sacrifice a little to pull this story together.I'd love for this film to find its audience, thus assuring us at least one more romp through the estate. Fingers crossed. Now go see it. It's wonderful."
    },
    {
      "title": " Will bore you to Death",
      "review": "Wow so disappointing Boring!!!! Where was the opulence, all it was stupid mini stories with happy childish endings."
    },
    {
      "title": " Great High Quality Television Drama ! Magnified ?",
      "review": "I'm a keen fan of Downtown Abbey as a Television Drama so I find it difficult to rate or critique Downton as a Cinema release. Why? you may ask. I enjoyed the movie to a point because Ive also enjoyed the 52 episodes of the 6 series on television . However I don't really think it makes a great movie transfer although it's entertaining and enjoyable. It has all the high quality wit and sumptuous surroundings of the original TV series and creator Julian Fellowes is a master of portraying the Upstairs/Downstairs world of the Aristocracy and the snobbery from both sides of the divide.No spoilers from me other than anybody who saw the trailer knows the entire movie centres around a Royal visit to Downton Abbey from King George V and Queen Mary. All the usual performances are as good as in the Television production but I really enjoyed the addition of Geraldine James as Queen Mary and Imelda Staunton as Lady Bagshaw cousin to the Dowager Countess Violet Crawley played beautifully as usual by Maggie Smith .Anyone who enjoyed the Downton Abbey series will surely enjoy making acquaintance with all their favourite characters again but I'm not sure the big Cinema screen didn't make them seem more like soapy cardboard cut outs at times. PS. As Mathew Goode heads the cast list on IMBd I expected to see more of him than just a walk on at the end, most disappointed as I think he would have made Lady Mary Crawley played by Michelle Dockery happier and less austere and irritating."
    },
    {
      "title": " Disappointing",
      "review": "I am a HUGE fan of the television series! It was full of breathtaking cinematography, beautiful music, award winning set design, and splendid fashions and costumes. All of this set the tone and backdrop for a story full of interesting characters whose lives were riveted by tragedy, war, love found, love lost, betrayal, class distinctions and money blues! Character development is a luxury that can be explored in depth in a television series with lots of seasons and several episodes, I get that! However, it's no excuse for a movie that cannot stand on its own! You should not have to have seen the television series to understand and enjoy the movie! Watching Downton Abbey on tv...I laughed, I cried and my heart was heavy during the last episode as Crawley & Company faded to black. This movie though was flat, even feeble attempts at humor were forced. The big drama was a royal visit? I refuse to make excuses for lack of character development, life altering issues, real drama and no tears shed here! This isn't real and quite frankly an insult to the television series so brilliantly portrayed. All these \"10\" reviews make me wonder if I saw the same movie. Disappointing and quite frankly forgettable!"
    },
    {
      "title": " What I Expected",
      "review": "I've seen it twice within a 48 hour period, once by myself and then with a friend. \"Downton Abbey\" was what I expected. It was like watching two one hour episodes strung together. It was like being in my livingroom on a Sunday evening, only with a much larger screen. My idea of a wonderful way to spend a couple of hours. The core characters haven't changed, the sets haven't, the introduction of new characters. It transports me to an era that I don't think exists very much anymore, unless you're part of or involved somehow with the British Royal Family. Maggie Smith was, again, ready for one of her tart remarks that made me chuckle. Well, now that the Crawley family and their devoted servants have survived a royal vist from King George V and Queen Mary, I say bring us more! I can see at least two more films from this. How does the Crawley family survive the Great Depression and the Second World War."
    },
    {
      "title": " The series is dead. Long live the franchise!",
      "review": "Appealing characters and superb casting have always been the chief ingredients in DA's success. The film gives us a panorama--a three-ring circus--peopled by them. Lame plot devices continue to be a part of the charm. For the first third, the dialogue gets too cute and clever by half. But it recovers from that in good time. I look forward to what the depression and WWII will bring. As a car guy, I lament the automotive anachronisms. While Branson was still a chauffeur in 1919, His Lordship somehow acquired the maroon 1924 Sunbeam limousine that appears in nearly every TV episode. But somehow, it is absent from the film. (Was Matthew's not the only car crash?) By 1927, the Downton men have become a Ford dealer. A glimpse of Model Ts in their showroom is all we get of this potentially interesting development. The king arrives in a then-ancient brass era Napier with acetylene headlights. Producers, please make use of the help the collector car community has to offer!"
    },
    {
      "title": " Very good follow up of the tv show",
      "review": "Been a fan of the tv series for a long time it was a great experience to see all my favourite characters on the big screen excellent performances from all cast great screenplay really enjoyed the film and I could watch it a few more times in cinemas"
    },
    {
      "title": " Soapy with a Touch of Knots Landing",
      "review": "I do love this movie, despite the fact it is due to my affinity for the English monarchy and such beloved characters having watched the TV show. It's very rare you see such an ensemble cast repeat their performances on the big screen. The movie suffers from *many* \"they didn't do that in the 30s\" moments, but the flowery writing that sounds taut and crisp, coupled with characters who are old fashioned, yet progressive for their time, makes this easy on the eyes.Not sure what the future holds, but if Lady Mary Crawley becomes the new Dowager Countess of Grantham, I would fall of my chair seeing more movies take on WWII, etc. Clearly, this version of \"The Crown: Rural Folk\" works seeing history through the eyes of characters you invested in making it worth it.I wish there was more emphasis on the royal visit including more chronicling of the pomp and circumstance, dishes being served, and the attention to details (i.e. Victorian Kitchen, Babette's Feast, etc.) The movie version had an opportunity to leave a few characters off the screen and deliver more of a movie than 2-hr episode of the TV show. But, really can't complain when you're a fan of the series. Possibly, the best scene of the entire TV show was when the news was delivered the morning after the Titanic sank. Seeing the morning routines, bells ringing, curtains being drawn open, etc. A history class in procession. Downton Abbey doesn't come that close to the original magic and delves into everyone's live (literally everyone) and keeps the characters honest.The story is about the King George V and Queen Mary stopping by and reconnaissance crew sent ahead of time stir the pot with the Downton staff by being told to stay away from the event and to leave it to the experts. The staff \"Revolt\" to put it mildly (more like a college prank) and take over and serve the highnesses bangers and mash and Cornish pasties instead (ok that part I embellished). They pull it off, but there's an attempted assassination, a dress arrives 2-sizes too large, and a wonderful orchestra that plays exquisitely. The bitter banter between Isobel Crawley and Dowager Countess of Grantham abates slightly, but there's more of one-liners and it's funnier. There are tears shed, but will not give away too much."
    },
    {
      "title": " Wonderful to have them back!",
      "review": "I was SO excited for this movie to come out, and literally counting the days! I, like many others, miss Downton Abbey dreadfully, to coin a phrase from them. It was good to see the characters, see the sets (especially on the big screen, where you can see much more detail), but I found the story lacking. It wasn't so much that it didn't have oomph, it was more that I thought the characters, particularly the downstairs ones, were acting out of character. I can't say more without a spoiler alert, but it was disconcerting. I would have so much rather got caught up with all of their lives, and the ins and outs of that. I was happy for Thomas however! I do hope there will be several more Downton Abbey movies, and I will happily go to them, but if you're expecting--as I was--that since it was fabulous on TV it will be even better at the movies, well that's not the case."
    },
    {
      "title": " Stuffy Stodgy Royal Aristocratic Fun",
      "review": "I only have seen a few episodes of the TV series. The question though is does this movie succeed on it's own? Yes, it does as the understated but hilarious humor that is done better by the British is much in evidence here.The film takes place in the past and while the year is not stated, nor important, the setting of it is done well. The original sets from the series are used and the film does not fool around with taking itself seriously, but does well with it's main strength- devloping sublte subplots around it's large character cast.There is a rebellion, and insurrection, thievery, scandal and cheeky humor, all without viollence and special effects. It is done brilliantly. The audience applauded at the end of the film, quite rightly. This is a very successful turn of tv into a feature film, and that is not done this successfully very often. It does have to skim the surface a bit on some of the plotting, but then to go into too much detail with this many goings on would have required a 3 hour movie. That would be too long and too stuffy. This one is done right.Even though I have only seen a few snippets of the TV series, I enjoyed this little trip back into the era of stuffed shirts, and sublime plotting. Yes, and there's plenty of room to do this again, in another film. There was a trailer from the producers of this of a film next year set in this era. Will be interesting to see if they can duplicate the success here with a different plot and set of characters."
    },
    {
      "title": " Refreshing...",
      "review": "We love the TV series and could not wait to see this movie. When we arrived, afternoon matinee, the theater was full! So, we knew we were not alone in being Downton fans. The story line was great, the cast was great (as always), and done with original style and splendor of the TV series. We loved it!Our only disappointment was pushing the Hollywood gay agenda on us once again. We have nothing against these good folks, but, it does not have to be in every movie or show on TV... folks do get tired of it, thus the reason for not giving it 10 stars.However, overall, we enjoyed the move and being able to see all of our Downton cast members again."
    },
    {
      "title": " A sheer delight from start to finish",
      "review": "For those of us who loved Downton Abbey dearly, it's beautiful heart still beats through this nostalgic fun movie. The characters are well written; even the new ones and the beauty of what was a delightful era for the privileged and those who were fortunate enough to work for them. If you loved the series then this should be a real winner!'"
    },
    {
      "title": " Does not disappoint!",
      "review": "Excellent and thoughtful recap by Hughes and Carson. Must see!"
    },
    {
      "title": " Julian and the Cast Have Done It Again! Bravo!",
      "review": "Julian has taken one event and created all of the plots and actions that we have come to love. The cast performed extremely well. It was as if we never missed a beat between the TV series end and this movie's beginning. My wife and I loved it"
    },
    {
      "title": " WHY DOWNTON ABBEY WORKS SO WELL ON THE BIG SCREEN",
      "review": "Let's get right to the point here: If you missed the PBS TV Series, Downton Abbey, which ran from 2010-2015, then you may have a difficult time easing into this beautifully executed feature film of the same name. Conversely, if you committed to watching the entire TV series (52 episodes plus a beautiful finale), you will be amply rewarded in more ways than simply seeing your favorite UK historical soap opera brought back to blazing life on the big screen.It's been 3 long years and a quite a lot has transpired since we last visited the Grand Old Mansion and her lovable occupants. Downton Abbey (2019) gently picks up where the series left off in 2015. It is 1927, roughly two \"television years\" have passed since the Downton Christmas Special. For me, it felt like I was attending the best homecoming I could ever imagine. You can put aside any fears you have, because with a few exceptions the Downton gang is all there: Mr. And Mrs. Crawley, Lady Mary, Lady Violet, Lady Edith, Tom Branson, Mr. And Mrs. Bates, Carson and his wife Mrs. Hughes, Mr. Molesley, Thomas Barrow, Daisy, Mrs. Patmore, and many more, plus some new characters that quietly stir things up for the Abbey's wealthy and \"not so wealthy.\" How can I best describe the experience? In baseball terms, Downton Abbey isn't a mere home run - It's a freaking Grand Slam!All of the actors, creator/writer Julian Fellowes, and director Michael Engler deserve genuine Oscar nods for preserving the beauty and continuity of this wonderful canvas. Downton is bigger than life this time around, even though it is the same house, the same village, the same theme music, and the same general sub-plots. Obviously, this franchise supports a very large and talented cast, and because of this, a few cameo appearances simply don't get enough screen time to make an impact. Nevertheless, the focus remains consistent, with emphasis on dialogue and character development, and the payoff is huge.Given the number of great films that have emerged in 2019, Downton Abbey manages to satisfy its fan base as well as create enough enthusiasm to warrant a sequel. For Downton's writers, the question of \"Where do we go from here\" has been dutifully addressed. The answer is, \"Anywhere we want!\""
    },
    {
      "title": " Should have been Christmas special on TV",
      "review": "Very beautifully filmed extremely predictable story with non-developing characters that do exactly what you would expect from them."
    },
    {
      "title": " Nice Final Episode",
      "review": "While far from a perfect film, this nicely takes the concluding chapters of the TV show and lets us see the principle characters one more time. When it is announced that the King will be coming to Downton, everyone springs into action. All the silver is polished and all the rooms made ready. The problem is the staff of his royal highness is being brought on board and they are rude and inconsiderate. So the downstairs folks find a way to rebel. We also see the fate of Downton when the Crawley's are no longer there. I won't go into detail. The cinematography is gorgeous and each character receives a kind of closure. Maybe it's a bit contrived, but it still works quite well."
    },
    {
      "title": " Adored seeing Downton Abbey on the big screen",
      "review": "If you loved the series you will enjoy the movie! Seeing my beloved characters again brought a closure I didn't even know I wanted. I'll likely see it again."
    },
    {
      "title": " Beautiful tribute to the show",
      "review": "Amazing, I cried happy tears multiple times during the film. If you are a lover of the show you will L.O.V.E. the film. I plan on seeing it a second time! Please go see it, it beyond worth it!"
    },
    {
      "title": " Most enjoyable",
      "review": "An excellent follow-on to the TV series,hopeful of more to follow."
    },
    {
      "title": " Here here. Keep a stiff upper lip, my manal",
      "review": "British always act like the have a stick up their arse. This movie exemplifies that. The first hour is raaathar boring, but I liked the scenes and royalty privileges. The second half of it gets more interesting and enjoyable, as we see the effect on the manors staff when the kings entourage takes over during their visit. I never could see the ooohs and aaahs of the Brits around their royalty."
    },
    {
      "title": " It won't work unless you've watched the TV series",
      "review": "Downton Abbey (2019) was directed by Michael Engler. We loved Downton Abbey as a TV show. The film is like two more episodes of the show. A few new characters, but mostly everyone that we knew before is back.Michelle Dockery as Lady Mary is still beautiful, Maggie Smith is still fabulous, and Jim Carter as Mr. Carson is still the world's most perfect butler.The film assumes that you know the characters, so there's not much backstory. It's fine if you do, indeed, know who everyone is both upstairs and downstairs. Only a few new characters are introduced, so you can sort them out pretty quickly.We saw the movie at Rochester's excellent Little Theatre. It won't work quite as well on the small screen. However, don't forget that we all originally watched the show on the small screen. Still, director Engler has some great outdoor shots, which make the production values appear even more lush.Downton Abbey has a very high IMDb rating of 7.9. I gave it a 7.0, because I thought that director Engler could have had more creative, better plots. It's still a must-see if you're a Downton Abbey fan. If you're not familiar with the show, learn some of the basic plot lines before you watch the film."
    },
    {
      "title": " Love the series",
      "review": "I love the series, the Crawleys and their household, but the film lacked something new and didn't bring anything new to their story. Still I do love them and I want more of them."
    },
    {
      "title": " Amazing for the fans",
      "review": "Great movie for fans of the series. Never wanted it to end hopefully there'll be another one"
    },
    {
      "title": " Downton Abbey",
      "review": "The TV show was a worldwide phenomenon, lasting for six series, and some specials, gaining millions of viewers, critical acclaim, and winning and nominated Emmys, BAFTAs, Golden Globes and many other awards, there were always rumours that creator and writer Julian Fellowes would bring it to the big screen, and it happened! Basically, set in 1927, Robert Crawley, the Earl of Grantham (Hugh Bonneville), receives a letter from Buckingham Palace announcing that King George (Simon Jones) and Queen Mary (Geraldine James) are coming to Downton Abbey as part of a royal tour through the country. His daughter, Lady Mary Talbot (Michelle Dockery), and son-in-law, Tom Branson (Allen Leech) are also informed, and are also excited about their visit to Downton. But the Robert's mother, Violet Crawley, Dowager Countess of Grantham (Dame Maggie Smith) is not as excited, as Queen Mary's lady-in-waiting, Maud, Lady Maud Bagshaw (Imelda Staunton), will also be coming. Lady Bagshaw is Robert's first cousin once removed and the two families have fallen out over an inheritance issue. The staff are informed that the royal staff will be joining them, but when they arrive, they are insulted by their arrogance. They are offended that Mr Wilson, Royal Page of the Backstairs, (David Haig) is insisting that only the royal staff will be serving the guests at the future gathering. Lady Mary believes that Thomas Barrow, Downton Abbey's butler (Robert James-Collier), may struggle, so she asks Downton's retired butler, Mr Carson (Jim Carter), to temporarily resume his former duties. Barrow is upset and strongly protests to Lord Grantham, who is impressed with his integrity. He tells Lady Mary that Barrow will not be sacked. Downstairs, the plumber who arrives to repair the broken boiler flirts with maid Daisy (Sophie McShera), upsetting her fiancé, footman Andy Parker (Michael Fox). A man named Major Chetwode (Stephen Campbell Moore) arrives in Downton village, Tom suspects he is a royal detective involved with security for the royal visit. The Royal parade takes place in the village, Chetwode finds the king on his horse awaiting the Royal Artillery. He aims a pistol at the king, but he is disarmed by Tom, and Chetwode is arrested. Tom meanwhile has met and formed a mutual attraction with Lady Bagshaw's maid, Lucy Smith (Tuppence Middleton). The household is completely taken over by the royal visitors and their entourage. The king informs Bertie Pelham, the Marquess of Hexham (Harry Hadden-Paton), that is to accompany the Prince of Wales on a three-month Tour of Africa. Bertie's wife Lady Edith (Laura Carmichael) is pleased but also upset as she is now pregnant and will give birth after he departs. In the garden, Tom finds a woman crying, he is unaware she is Princess Mary (Kate Phillips), they have a meaningful conversation. Meanwhile, Anna Bates (Joanne Froggatt) discovers that Miss Lawton (Susan Lynch) has been stealing from Downton Abbey, she agrees to say anything as long as the items are returned and a ballgown is altered. Downstairs, Anna and John Bates (Brendan Coyle) have a plan to retake the household and restore Downton's honour, the staff agree but Mr. Carson is reluctant. Barrow and Richard Ellis, the King's Royal Dresser (Max Brown) implement the plan, tricking most of the royal staff, including Mrs. Webb, the Queen's Royal Dresser (Richenda Carey), into returning to London. Mr Wilson is tricked into being locked in his bedroom, and Monsieur Courbet, the Royal Chef (Philippe Spall), is drugged with sleeping tablets. Barrow and Mr Ellis go for a drink together, then Barrow meets Chris Webster (Perry Fitzpatrick) who invites him to a club. The secret nightclub is full of patrons that mostly gay men dancing together. The police later storm in and arrest everyone, Mr. Ellis finds out what happened and uses his position within the Royal Household to get Barrow released. After, the two confide about their respective homosexuality, and Ellis later gives Barrow a silver locket as a memento until they meet again. At dinner, the king is impressed by the revised menu and praises his chef. Mr. Molesley (Kevin Doyle), quick to defend Downton, responds that Mrs. Patmore (Lesley Nicol) prepared the dinner and that the Downton staff are serving it. Everyone is stunned by Molesley speaking to the king without permission. Robert apologises for Molesley's outburst, but the queen praises Mrs. Patmore's cooking and tells Cora Crawley, Countess of Grantham (Elizabeth McGovern) that they are accustomed to people behaving strangely around them. Violet confronts Maud about choosing Lucy instead of Robert as her heiress. But Isobel Merton (Penelope Wilton) correctly guesses, and Maud confirms, that Lucy is her illegitimate daughter, Violet understands that this decision is out of love. Henry Talbot, Lady Mary's husband (Matthew Goode), arrives home in time to accompany the family to Harewood. The king is thankful towards Tom when Princess Mary tells him and the queen that she has been influenced by him to remain with her husband. Violet talks to granddaughter Lady Mary that her trip to London was for medical tests, she reveals that she has little time left to live but reassures her that Downton's legacy will be safe in her hands. The king and queen congratulate Edith and Bertie on their forthcoming child and announce that Bertie will not go on the tour. Back at Downton Abbey, Mr. Carson and Mrs. Hughes (Phyllis Logan) discuss Downton Abbey's future. Carson asserts it will stand for another hundred years with the Crawley family still living in it. Also starring Raquel Cassidy as Miss Baxter, Mark Addy as Mr. Bakewell, James Cartwright as Tony Sellick and Douglas Reith as Lord Merton. All of the recurring actors we recognise from the show are great, especially Smith with her signature disdainful put-downs, and new cast members Staunton and Haig are welcome. It is a very basic story, a royal visit to the English country house in the Yorkshire countryside, it is essentially the sort of thing you would get in a Christmas special, good acting, good script and good costumes. But you wouldn't expect anything different, it does exactly what it says on the tin, a nice simple and charming story of life upstairs and downstairs in the old days, nothing very dramatic, apart from an assassination attempt, some knick-knacks stolen, and an inheritance feud, a likeable enough period drama. Worth watching!"
    },
    {
      "title": " TV plots were so much better than this.",
      "review": "The costumes and scenery for this movie are fabulous. It was pleasureful to see the cast again but the story was just not as good as the plots we saw during the TV show. The downstairs story was like something from the Mickey Rooney days- let's have a show. Unreal idea that the staff could take over service as they did. I would have liked to see Daisy's story become more. It looked promising when the plumber entered but disappointed. And Mary was so alone until the end. Everyone ended up happy. Very little drama."
    },
    {
      "title": " Fantastic",
      "review": "I loved the Downton Abbey movie, but the limits of a movie were very evident. The plot lines were probably best served and fleshed out in the series format, because every story line was glossed over and resolved too quickly without being set up properly. That said I loved every minute of it and could have sat through another hour. There was enough story lines left unresolved for the next movie; Downton Abbey-Requiem of the Dowager!"
    },
    {
      "title": " The next chapter of an epic story",
      "review": "Julian Fellowes brings back all the magic of Downton as we live through the next chapter of the Crawleys and their loved ones. Never one to miss out on a historical reference, the denizens prepare for the arrival of the King & Queen.The script retains its trademark wit with Dame Maggie leading the way as the Greek chorus. There will be love, laughter, and tears throughout.Not to spoil the story, but there is a secret that intrigues viewers and sets up a great story for the next movie.When the original show went off the air, we felt like we were saying goodbye to dear friends. Now, they have come back and you'll not want to let them go.Hopefully the next chapter will contain Lady Rose, Denker, Spratt, and Aunt Rosamund. (And hopefully Mary will ditch her very boring husband!)"
    },
    {
      "title": " If you're a fan, go see it.",
      "review": "I've read a lot of nonsense from critics and after seeing it last Thursday at a special showing, I have to disagree. The story had some cheese and some schmaltz here and there, but some of the plot lines in the show have had those same issues. The cast is magnificent, costume and set design was beautiful.. and being able to see it on the big screen just made me love the show that much more. Ignore the cranky critics - if you're fan, go see it."
    },
    {
      "title": " This is everything I was expecting and more.",
      "review": "The long anticipated film finally arrived and it did not dissapoint. This film gave me everything I was wanting. Quite simply it was perfect."
    },
    {
      "title": " Not recommended -Worst movie",
      "review": "This movie has no story, full time waste, it is not worth the money."
    },
    {
      "title": " For fans of the series...",
      "review": "Basically a very good 2 hr TV special made for the big screen. It gave all of the visuals a bit more substance. Worth seeing, but wouldn't lose much if watched in the comfort of your own home."
    },
    {
      "title": " haven't seen the series...",
      "review": "...but i enjoyed the movie. The imagery was gripping, the characters enjoyable, i guess i will watch the series eventually :) Maggie Smith was a triumph! Although I wasn't expecting big twists and turns, I would've expected a more intense screenplay."
    },
    {
      "title": " Fan of the series? Then you won't be disappointed",
      "review": "Equally as brilliant as the TV series. Maggie Smith at her best as usual, as were the rest of the cast. The set, the storyline, the acting all brilliant."
    },
    {
      "title": " As a fan, the film is about perfect!",
      "review": "I admire Julian Fellows and his writing style. How he is able to have a parade of characters varying in depth and degree while making them all interesting to watch is an achievement few can have. The. We have the cast who bring the words to life and breath nuance into them and they all perform tremendously in their return to these well eastablished characters. My only issue are small story elements that feel a bit shoehorned to provide a little action. But other than that, I love this historically fictional world we have been graced with and can't wait to see if they will decide to continue ur this story and if not then a humble ending to a beautiful story."
    },
    {
      "title": " Never seen the show but decent movie",
      "review": "Ok, I've seen one episode. But yeah, I knew close to nothing about Downton Abbey going into this movie. It was pretty good but it seemed to drag on a little in some parts, especially in the first 45 minutes or so. I definitely think it would have made the movie better had I known more about the characters and felt that nostalgic connection with them. From my ignorant standpoint, it was a decent movie with an ok story and some cute romantic scenes. I wouldn't need to see it more than once or twice, especially without knowing anything. But it does intrigue me enough to maybe start watching the series."
    },
    {
      "title": " Golden Agr",
      "review": "For a devoted fan of the TV series I was worried that the ambience would be lost on the big screen. I had nothing to worry about. The acting and the sets were excellent. Maggie Smith deservedly stole every scene she was in. I hope there will be a sequel perhaps set during the Second War."
    },
    {
      "title": " Smooth, cleaver and very witty dialogue, well worth it!",
      "review": "I have only seen a few episodes, and I got lost with some of the characters but this is a wonderful movie. Excellent soundtrack, great repartee, scenery is so perfect, and several entertaining side issues that will not distract you from the heart of the movie. It will leave you feeling warm and fuzzy. You will not be disappointed. I'm surprised the overall score isn't closer to 9 than 8."
    },
    {
      "title": " What a wonderful ensemble!",
      "review": "Why can't Hollywood put our movies like this instead of rehashing the same old stuff with more sex and violence added, especially Disney.The moved stood alone from the series, so, even though I never watched the series I was able to follow the plot. The only thing I had to do was have my wife tell about some of the characters that came from the original series.For me, the standout characters were Lucy, Tom, Mary, and the butler (retired) Carson."
    },
    {
      "title": " Comforting",
      "review": "I thoroughly enjoyed this film because it contained all the ingredients of the tv series. Our favorite characters field a royal visit and the royal entourage messes with Downton Abbey's downstairs staff. Mosesley was especially humorous whilst suffering an acute case of royal awestruck. The plot was really well done, giving each character enough screen time. Some might complain Lady Mary didn't have much presence, but she was never my favorite anyway. Daisy was as lovable as ever, Anna was as practical as ever, Cora was as daft as ever, and Violet was as nasty as ever. The costumes were really beautiful."
    },
    {
      "title": " A movie length finale",
      "review": "Wraps up the TV series very well, a must for fans of the series. Enjoyable even if you haven't watched the series, though you may struggle with some of the finer parts of the plot."
    },
    {
      "title": " A money making exercise?",
      "review": "I sat down to watch Downton Abbey trying to think if there as ever been a good movie made of a successful tv series. Can't say that any movie sprung to mind.Having seen Downton Abbey got to say that this will be another movie that doesn't quite live up to the tv series in my opinion. The running time is 2 hours, so a number of the movie plots are very rushed in comparison to the time they are given in a tv series. It seems that if a character didn't fit into the overall plot of the royal visit to Downton then they had their own sub plot. The movie isn't terrible and the characters are very much the same as they were in the tv series. Can't say I was a fan of the lighting of the movie unless the cinema was having problems with projection.If you were a fan of the tv series you'll find the movie very watchable, but if you didn't watch the tv series you should probably avoid the movie."
    },
    {
      "title": " Downton Abbey -",
      "review": "Costume drama set in the late 1920's.The big screen adaptation of a highly regarded British TV series, staring some of the cream of British acting royalty. The theatre was packed with a much older audience (I'm older but all even older than me).The movie opens with Lord Grantham receiving a special letter from the King and Queen of England, seeing this being delivered was pure magic. The Downton Abbey staff need to quickly prepare for this royal overnight stay. The Royal's personal staff, consisting of a French chef is sent ahead to prepare the food, a scary butler, to organise the rest of his staff. The regular staff are justifiably upset and plan a revolution with lots of Monty Python style humour. This is the main plot but also with many intertwining subplots.Worth a visit if only just to see Maggie Smith who steals every scene she appears in. My wife is a huge fan of the TV series and enjoyed this enormously, though she said it could have been more spectacular and lavish at the end."
    }
  ]
}