{
  "Hustlers(2019)": [
    {
      "title": " This is just not good...",
      "review": "Way too long... Covers only one story, it feels like you're watching the same scene over and over again... long and boring conversations...The Asian woman was ok, but other than that no character development, or nat least ot one that makes you care. I can go on but I feel this review is getting as boring as the movie. Spend your money on another movie is my advice."
    },
    {
      "title": " I dont get it",
      "review": "All the talk about this being an empowering feminist epic heist flick and I think you agree getting this mixed up with Widows. Everything that happens in this movie you get from the previews. There is nothing but the scenes from the previews on repeat. What kind of real story arc is there?"
    },
    {
      "title": " Terrible Story with Top Notch Performances",
      "review": "The script and story are trash. No real climax. The movie is all over the place trying to tell the same story over and over again with chunks of character development in the script rather than weaving it through seamlessly. Despite this, all of the actresses gave wonderful performances. Great cast that deserved a better script to tell the story."
    },
    {
      "title": " Men leaving bad reviews",
      "review": "Can't help but notice that the bad reviews are coming from 90% men. Go figure. Haha. It's actually a good film. Obviously if you are a woman, you will love it, and if you are a man, you will not. Go see for yourself and decide...don't let us do your thinking for you."
    },
    {
      "title": " Jlo nailed that",
      "review": "Just by watching the trailer u already know that that's a A list movie. 10/10"
    },
    {
      "title": " Waste of time, as usual.",
      "review": "This movie was once again proof that JLO should stick to music. Nothing about it was entertaining and the characters were shallow. They really hyped it up beforehand to make it seem really exciting. It wasn't. Anyone on here say her acting was \"10/10\", has to be from her team. Acting has yet to be a skill for her. She tries too hard."
    },
    {
      "title": " ain't no shame in doing yo thang",
      "review": "All female cast and director...a story that brings you into the life of a stripper. We need more stories like these. Check out our review on our Youtube channel: Geekettes Chatpeace, Shirley and Christy"
    },
    {
      "title": " Over Hyped",
      "review": "Once again rotten tomatoes is full of sucktards who call themselves movie critics but it is painfully obvious that they themselves have no idea what they're watching. This movie was trash."
    },
    {
      "title": " Nice Movie !!",
      "review": "This movie was nice and the acting was pretty good. The message in the movie isn't just about strip clubs and manipulating men. The women in the movie were working together. This movie gave lots of different emotions throughout. It had some scenes were I was bursting out by laughing and the there were some scenes where I bawled my eyes and wanted to make you cry. I think the cast is amazing and they all did an amazing job and portraying the roles they were given. Constance Wu in my opinion blew me out of the water, Jennifer Lopez was an icon in this movie, Keke Palmer did great, and Lili Reinhart blew me too. I feel like if your up for a day at the cinema and are wondering what to watch go get some tickets and watch Hustlers you won't be disappointed. (Just keep in mind most of the movie was in a strip club)"
    },
    {
      "title": " Boring and redundant",
      "review": "Trashy movie with a lot of T and A. The scenes were very redundant. There were 3 basic scenes that repeated throughtout the movie; 1) trashy naked girls dancing onstage; 2) trashy naked girls partying with wealthy businessmen while they secretly drug them to take them for large credit card purchases; and 3) scenes of trashy girls shopping in high end stores spending the money they stole. That is basically it in a nutshell. These 3 scenes are repeated throughout the movie and once you see each of these scenes the movie is over. Nothing more to see. Big snoozefest if you ask me."
    },
    {
      "title": " I got hustled ! Maybe that was the point of the movie.",
      "review": "I'm sorry to say, this movie is just bad. The only way it can be good is if someone tells me the entire point was to see the trailer, go to the movies and feel like you were hustled when u got out.It looks as if the director just finished school and wanted to use every movie style she possibly could in just one flick, but with out any connection to anything what so ever. Or maybe she just watched Netflix and thought she could do the \" is it a comedy ? Is it a drama ? Nobody knows \" but, very very poorly (unlike Netflix).I am in-love with JLo and she was actually good in this but even she, could not save this poorly made film.The characters are not relatable at all, at all ! The storyline and most of the dialogue are so boring, it's as if they just filmed a boring conversation through most of it, very lazy. The soundtrack moves between Buffy the vampire slayer moms death scene To Saturday Night live, To a cheesy 90's comedy, this makes no since what so ever and if the sound editors / director knew what they were doing, it could.To summarize:This movie was like a really bad dish made out of the best possible ingredients. I didn't get it, at all."
    },
    {
      "title": " A movie about sex work, without any sex.",
      "review": "How could they make a movie about sex workers and not have any sex scenes? Somehow Hollywood did and it is as vacuous and empty as expected. The only full frontal nudity was an unconscious man. This movie should have been on Netflix... no, sorry, it was too awful for that streaming service.. Put it on Amazon Prime. One character, Destiny, actually had a small amount of character development, and Constance Wu knocked it out of the park. The rest of the characters were one dimensional. One would hope there would be a little socially redeeming value in this movie, but there is no moral or even moral ambiguity. The screenplay was jagged, and the direction had no focus."
    },
    {
      "title": " Hard pass - save your money.",
      "review": "Consider this a tip from a friend - DON'T WASTE YOUR TIME! It's my fault that I expected a fun, entertaining movie and didn't heed the user reviews that contradicted the critics' reviews. I, too, fell for the Critics' Hustle of an all-star cast but of course even the starriest of cast couldn't save this dog of a movie...not even a cameo from Usher.This movie is NOT fun, it's NOT entertaining, and I really wanted to walk out but I'd paid my money and resolved to stay to the end. The 2 star rating is for the one scene that was funny enough to make me genuinely LOL. Other than that? shrugs."
    },
    {
      "title": " Beautiful film",
      "review": "I didn't know who was in this. I don't think I've ever seen jennifer Lopez in a film before. I really liked the \"Ramona\" performance. I was pleasantly surprised to see her name come up at the end. Extraordinary performance.Simply great soundtrack. I enjoyed the characters. I thought the device of the reporter was nicely done. If I could criticize anything, i would say they could have cut it by 20 minutes.I may see it again."
    },
    {
      "title": " Nope, sorry I don't agree with critics.",
      "review": "The critics calling this Jennifer Lopez's best role ever must not have seen \"Out of Sight\" 20 plus years ago. She's okay in this film, but certainly not Oscar-worthy by any means. If she gets a nomination for this, it's will clearly be because she has never gotten one before and the Academy likes to reward people even if they don't deserve it. The film itself is only okay- it's certainly an interesting story that could have been better, but it just seems disjointed."
    },
    {
      "title": " Some extra cash",
      "review": "Whatever the reviews says. I like it. I must say Jennifer Lopez she is a Queen of the lovely bum Miss Ramona she's the boss here .Cute Asian Destiny girl great lovely fashion,this is a Girly movie"
    },
    {
      "title": " Style copied from casino.",
      "review": "The film looks a lot like casino but the gamblers are now strippers."
    },
    {
      "title": " It was okay......",
      "review": "The story seemed to be lacking. The ending shouldn't have been words on the screen. They should have played out the ending. Destiny clearly couldn't dance and all the other ladies had actual skills."
    },
    {
      "title": " A grimy & sleazy trip to the underbelly of New York",
      "review": "If I'm being honest, I feel as though the fact Hustlers has been released and is not being talked about as a candidate for one of the years worst films is some form of cinematic miracle.In what appeared to be film that could've easily have been the modern day Showgirls, group of working class strippers band together to rip off sleazy Wall Street and high rolling clients, Hustler's ability to overcome its seemingly doomed based on a true story premise is something that's worth noting and due largely to the fact Crazy Rich Asians breakout star Constance Wu and the sure to be awards nominated co-star Jennifer Lopez bring their A-games to Lorene Scafaria's feature.Now that we've celebrated the fact Hustlers has become a film with a rating in the high 80's on Rotten Tomatoes and high 70's on Metacritic, against the odds it now feels as though Hustlers has become one of the year's most unworthily praised films, in what's a sleazy and unlikable experience in the underbelly of New York City as a group of hard luck woman combine forces to manipulate and criminally drug supposed bad guys to gain a leg up in life.It's in this core concept in which Hustlers becomes an unlikable event, we're told and made to feel as though everyone Wu's Destiny and Lopez's Romona targets in their scheme, that sees them drugging their way around New York's high end players, are bad people, but it's hard to believe just because somebody is rich, automatically makes them someone it's OK to illegally drug, steal and gain from.There's very little enjoyment to be found from watching this rag-tag group of strippers enact their masterplan's on a collection of victims and while Hustlers starts out strong with Wu at first a likable enough central figure and Lopez as good as she's ever been as the street smart Romona, once Scafaria gets into the groove of the central plot-line that formed the basis of the news article in which Hustler's has been derived from, this film loses any of the entertainment value it could've potentially had.As the film wears one we become increasingly aware that there is no one here we can really root for, most of these characters have made their own bed and reap what they sow, there's nothing overtly placed in front of us that can make us shy away from the fact that these woman are just after a quick buck, in the some of the most depraved and dishonest means possible.When we set out to watch a gangster film we are not asked to enjoy the way they kill, rob and plunder their way to financial success but Hustler's problem is it feels as though its setting up its main group as some type of Robin Hood like woman, sticking it to the man and getting a slice of the pie they feel entitled to but there's no real reason why we want to see them achieve their goals at the detriment of everyone else around them, most of us end up being working class citizens, most of us live through hard times and most of us don't feel the need to drug and manipulate others to achieve financial gains.Final Say -A well shot film that's well acted by its main cast, Hustler's is supposed to feel grimy and dirty but it forgot to offer any real enjoyment for its viewers to take from a film that quite simply follows a collection everyday woman who decided their best bet at a good life was becoming monsters bigger than the supposed ones they were targeting for their personal means.2 Usher visits out of 5"
    },
    {
      "title": " Long and boring snooze fest",
      "review": "We went to this movie with another couple and they are huge jlo fans. Half way thru a handful of people walked out and I wish I could have gone with them but stayed with our company. Even from a guys perspective the move was no good. The movie had its ups but way more downs. The main characters did do a good job but overall they could have hacked off an half hour"
    },
    {
      "title": " Choppy and Unoriginal",
      "review": "I read the critics' reviews when this film first hit the festival circuit. Did we all watch the same film?? This was based on true-ish story, but nothing about this film made me connect with the characters, care about their lives, or feel that their connection to one another was anything other than bogus. Literally, the most unsentimental, unmoving story I've come across in some time and I only watched it because of the hype. It's over-hyped. It's been done. I kept watching the clock to see when it would be over. And the ending? So many loose ends because, ultimately, the film is based on a very, very thin plot that was stretched to almost 2 hours. Hard pass on this film."
    },
    {
      "title": " Lopez",
      "review": "Lopez Is Amazing. Her acting is 10/10. The others are amazing aswell Brilliant acting all around. But I understand this is not for everyone. The story is a bit all over the place but it pulls it off amazingly"
    },
    {
      "title": " Boring",
      "review": "I mean...Jlo is the same in every single movie! Her acting is always mediocre, the plot is interesting and the cast gave strong performances but overall could've lived without watching this. The pole dancing was nice."
    },
    {
      "title": " Great movie!",
      "review": "This movie is better than I expected. They should think of releasing a new movie trailer depicting how gritty the movie really is. The writing, acting, and directing were phenomenal. This is definitely Jennifer Lopez's best performance to date. I can see why there is buzz of the possibility of Jennifer Lopez getting nominated for an Oscar."
    },
    {
      "title": " Beautiful, exceptional acting, timely political notes throughout!",
      "review": "We need more female-directed movies like this! I felt like I was taking an intro class in feminist/capitalist critique while being marveled by excellent acting, a fun soundtrack, beautiful lighting, in-depth character development, and a bunch of enjoyable 'slow-mo walking shots'/transitions with trippy elements.The plot (while creative-licencing a true story) is meticulously crafted commentary on the ills of a capitalist-obsessed society, while simultaneously capturing the feminist bonds that keep us pushing through it together.The film centers around the economic collapse of 2008 and the lives it upturned in trickle-down effect; it critiques capitalism brilliantly, as it arguably captures one of the most OBVIOUS ways we assign inherent VALUE to individuals; through sex work.Hustlers reminds us that we're all the same players in this violent game we call the American dream; and that some of us are simply better, smarter, more ruthless players at that game than others; those who learn to work the system."
    },
    {
      "title": " Neither edifying nor entertaining",
      "review": "Dorothy (aka Destiny) lives with her grandmother, and mony is tight. Destiny becomes a poledancer, is befriended by old hand Ramona, and all is well until the sub-prime crisis hits Wall Street, and the easy money dries up. Ramona develops a plan - if you and your friends pick up a mark, and slip him a concoction which renders him gaga, then you can max out his credit cards and tell him he had a great time afterwards, worth every penny, shame he can't remember it.This is based on a true story, and I can believe it. Jennifer Lopez is Ramona and Constance Wu is Dorothy. Both women swear prodigiously and wear little clothing (although always more than the other performers in the club). Both women also act well.But this film is not happy or edifying. What happens is not pleasant, and the female characters aren't particularly sympathetic. Maybe they are more sympathetic from a feminist standpoint, but I didn't care for them much. The film is too long by about half an hour, and I left the cinema without feeling that I had been entertained."
    },
    {
      "title": " Very Entertaining!",
      "review": "Loved it. Very entertaining. The two leads were great. Jennifer Lopez is so underrated and Keke Palmer is. Real gem. Not earth shattering filmmaking but a really easy film to like."
    },
    {
      "title": " AMAZING!",
      "review": "Mark my word...this film is 2019's Godfellas! Great direction, story and acting, particulary Jennifer Lopez's Ramona."
    },
    {
      "title": " What they think that made it look not sexy, actually did, they needed a better guidance, that's all.",
      "review": "HustlersLorene Scafaria, the writer and director, is a hustler. Similar to the film, we, the clients, are robbed shamingly. But what's interesting is that the film loses at the end of the day. Not even looking at the intentions of the film, the film, as a story, had an extremely solid argument to walk through that Oscars table head held high. And instead the opportunity is not only missed but chucked away for cheap thrills and manipulative emotional blackmail. And this could have been a worthy Oscars contender and is instead just an Oscars contender.And I emphasize on how big a mistake they made, on going light on this material. What the film industry, in the last few years, had twisted and turned its way out to address the political correctness, is something that the film has in its pocket all along. So now, all they had to do was carve a compelling drama. And instead they are overcooking those same ingredients, that turns into a preaching to the choir tone, within the first act.The film craves for such moments. If anything it goes all the way around, just to create memorable scenarios, to the price of pacing. And it is not the pace I have an issue with, it is the two page script that is told magnanimously within two hours that I can't just \"whoooooo\" around. The film is also hard to watch. Not for the justification it attempts to give its characters but also the justification that it doesn't give to its characters. And it is not the narrative but the visualization of that crime scene that makes it horrible. For if told properly and rummaged around the files, dug deep into their homework, you will find a sweet spot to explore that would balance these Hustlers."
    },
    {
      "title": " Strippers Vs Wall Street",
      "review": "I saw \"Hustlers\", starring Constance Wu-Fresh Off the Boat_tv, Crazy Rich Asians; Jennifer Lopez-Second Act, Anaconda; Julia Stiles-the Bourne movies, 10 Things I Hate About You and Keke Palmer-Scream Queens_tv, Madea's Family Reunion. This movie is based on a true story, or rather a New York Magazine article. It's about a group of strip club employees that band together and take advantage of some Wall Street clients, sometimes using illegal tactics. Constance is the new girl at the club. She is just trying to support her grandmother and herself and doesn't want to make a career of dancing. Jennifer is the seasoned pro that takes Constance under her wing and teaches her how to dance to make the most money. Keke is another dancer in the group. Cardi B and Lizzo both have small roles as dancers-this is also their first appearance in a movie, but not Cardi's first appearance in a strip club. Julia plays the reporter writing the article that the movie is based upon. There is some nudity but not from Constance or Jennifer, although they do look good with very little on, especially Jennifer. It's rated \"R\" for drug content, language and sexual content-including nudity-and has a running time of 1 hour & 49 minutes. It's not one that I would buy on DVD but it is a good rental."
    },
    {
      "title": " Awful movie",
      "review": "This is truly by far the worst movie of the year. Save your money and see something else."
    },
    {
      "title": " The hypocrisy of woke",
      "review": "Imagine a movie where a bunch of men drug and rob women as the main theme. You can't right, because it would never get made, but when the roles are reversed it's \"you go girl\" right? This movie is everything that's wrong PC woke culture and highlights the misandry and hypocrisy of modern day feminism. This movie disgusts me."
    },
    {
      "title": " Pure garbage",
      "review": "Review is in the title. Trash trash trash, Jlo needs to stay in her music lane, her acting is like a parody of someone being bad at acting, that's how bad."
    },
    {
      "title": " JLo owns it",
      "review": "Wow JLo is phenomenal in this movie she owns every scene she's in and Constance Wu is amazing also. Love the chemistry of the whole cast"
    },
    {
      "title": " When Will Jennifer Stop Shoving Her Gruesome Penchant for Fur in Our Faces?",
      "review": "One thing's for sure: Jennifer Lopez knows how to promote herself. Isn't that what this film is really all about? Her showing off?Lopez is good. She sure can move on that pole. Her bod is looking great, too.But I am SICK TO DEATH of her constant and ignorant promotion of fur and her wanton condoning animal cruelty. Did she really have to advertise her imbecilic love affair with dead animals in this movie? Don't tell me the writers are responsible, either.Stop being so lame, Jen, and knock it off with your heartless disregard for animal suffering.As for the film itself: There are some beautiful women who sell their \"services\" for money. It is not empowering, it is just sad. A great many men are basically predatory creeps, who can't wait to paw and drool over sad women who, without exception, are strippers because they suffered some type of abuse as children.But, wait. These strippers are going to make the most of selfish, insensitive jerks. How? By being larcenous and cruel and vengeful. What a fun story.This film has no message. SPOILER ALERT: The strippers drugged men, *stripped them* of their money and, when caught, did little or no jail time. Isn't that cool? Ugh. No. Stupid."
    },
    {
      "title": " At least you will have fun while reading reviews",
      "review": "This movie is so bad you can't imagine how bad it is. \"It is not even Apple 4 bad, or Apple Maps bad, it is a Microsoft's Zoom bad!\"I never thought that JLo will come back with a big title movie, and yes, it didn't happen at this time with \"Hustlers\" as well.Usher were in this movie, and it says a lot as well. All these people, question, who were popular two decades ago, are trying to get back on the track?Only one good thing about this movie is after watching it you will have some fun by reading excellent reviews how bad this movie is."
    },
    {
      "title": " Hustlers is a funny feel good film you really do root for them even though they are committing crimes on these rich people to steal their money.",
      "review": "We first meet these people at a strip club in New York where they are strippers trying to make a living, but in order for them to make enough money they need to go into a bit of illegal business. We see these strippers as the hustle gets a lot harder resulting into drugging their clients in the film to try and get them to use their credit cards, signing cheques to spend money on them while hopefully not getting caught in the process, which the precaution is mainly these drugs that play on the clients memory while giving the clients a good time while being conned out of thousands by these strippers. Jennifer Lopez is hilarious the moment she breaks into a split after her strong independent liberating pole dancing scene is just Oscar worthy, which her character Ramona is the main instigator in this side hustling illegal business remaining in complete control over her friends that eventually becomes family. Overall this movie is hilarious, dark, thrilling, well thought out and makes you overall feel good seeing these people come together to help each other in their hard time of need, where you find yourself rooting for these vulnerable strippers that are doing the illegal activities that they are in as you just want them out of this compromising position, then to be happy overall as close friends practically family too. Jennifer Lopez , Constance Wu, Cardi B, Keke Palmer who is especially hilarious, Trayce Lysette and Lili Reinhart has done an amazing job in there acting. Even though Lili's character Annabelle could not stop throwing up randomly which was a bit weird and funny at the same time, also her sitting on Jennifer Lopez's Lap was a bit bizarre too still, cute, warm, sweet and hilarious though just especially shows the close friendly family bond between Lili's character Annabelle and Jennifer Lopez's character Ramona too. I highly recommend you go and see it in a cinema as laughing together while also feeling the emotions the characters are faced with in their unpleasant experiences are just what cinemas are all about experiencing it as a community."
    },
    {
      "title": " Hustlers is a real life story about Wall Street during the Great Recession",
      "review": "Hustlers is a \"uniquely empowering heist drama with depth and intelligence to match its striking visual appeal, and engaging nature\". It makes the viewer identify with flowing money situation that was Wall Street during the lead up to the Great Recession and the consequences to Wall Streeters. The real life story is well portrayed in the movie.scams like this probably happen all over the country. The male victims just too scared of embarrassment to report it. The reviews are right on. I thought this was a very good story and well adapted for big screen drama. It was written by, directed by and stars all women and creates an interesting take on opposite sex exploitation from both sides."
    },
    {
      "title": " Jennifer Lopez makes up for repetitive pacing in Hustlers, a cross between Showgirls, Boogie Nights and The Sting",
      "review": "One of the quotes from today's movie reflects that, \"The entire world is a strip club with some throwing money and the others collecting the money\". It's also the film's reflection of it's setting in the aftermath of the 2007 financial collapse that lead into the Great Recession. It's no secret that a lot of people were affected by it, whether it was average Joes losing their low wage jobs or entire companies going under. It was a time that people reflected just how much they can do and if those at top should receive some type of consequence.Our protagonists certainly thought so and used it as their justification to do the things they felt were right. What makes crime stories fascinating is that we're always going to see a different philosophy on just who the real villain is. Is it the people committing the actions against the law or the people after them who are just as likely to face their own corruption? This is also why several movies about the Great Recession like Up in the Air, The Big Short and 99 Homes have looked explore different viewpoints within a rough era. Hustlers takes it's turn at the time and several women involved in a specific industry.It opens in 2007 where newcomer stripper Destiny (played by Constance Wu) is taken under the wing of veteran stripper/popular attraction Ramona (played by Jennifer Lopez). Ramona teaches Destiny several pole dancing and erotic dancing, along with introducing her to fellow strippers and how to get the most out of the Wall Street types who frequent the club. Destiny not only starts to rank in a lot of money, but she uses her new fortunes to care for her grandmother and newborn daughter. Things come to a halt at the start of the recession.Years of the recession cause fewer people coming to the club and puts Destiny out of work. It doesn't help that her background gives her little chance for other work. She eventually comes across Ramona again where they blame the recession on the same Wall Street guys. To retaliate and to generate an income, they agree to bring in other strippers including Annabelle (played by Lili Reinhart) and Mercedes (played by Keke Palmer) to take advantage of their beautiful nature to lure them into the clubs and take everything on their credit cards. All of this becomes chronicled by writer Elizabeth (played by Julia Stiles).It may be easy to see Hustlers as something as exploitative as Showgirls. But to tell you the truth, I see it more like a cross of Boogie Nights and The Sting, and I ended up like the movie a more then I anticipated. I don't know if I can call it one of the best of 2019, but it has elements that are phenomenal. Speaking of which, I'll start by saying that Jennifer Lopez not only shines, but also gives what may be her best performance in a years. She paints a reflection of her eternal youth within a character whos the prime example of \"looks can be deceiving\".Constance Wu fills in the role similar to Mark Wahlberg from Boogie Nights where she has two goals; to be the innocent whose filled in on the movie's information and to someone the audience can imagine themselves in. Hustlers uses this narrative to make their characters interestingly sympathetic, especially the lengths they go to accomplish their goals. Of course like a lot of crime stories, it all has to topple at some point and the movie has that...though it takes a lot of time to get there.The first half of Hustlers was better then the second half. The con that's set up is a good one, but the pacing causes things to slow down too much. A lot of it is because much of the scenes repeat the con over and over. I know it's to show how much it works, but the movie also has a lot of slow motion edits which heighten moments at the strip club, but can come off as unnecessary during the con. If anything, the best moments from the second half are when the girls get together laugh about what happened and thus, seeing them connect.I'll give this seven stripper poles out of ten. Hustlers is a movie that, regardless of how I felt, is probably going to do good business and have its eye on certain awards. It's too early to determine any guarantees, but I'll remember this; especially for Jennifer Lopez. I do recommend it in general and it'll make a good watch."
    },
    {
      "title": " Very VERY disappointing",
      "review": "I normally love JLO movies and the critic reviews were good, so I was really excited to see this one.What a mistake. BORING.This just reinforced my view that reviews by professional critics are based on their own political agendas, political correctness, snobbery, economic incentives, or other things that have nothing to do with whether the average viewer will actually have a good time.Don't waste your time and money"
    },
    {
      "title": " A Brilliant Slice of Life of Female Survival",
      "review": "Constance Wu who shot to fame for her starring role in the American Asian breakout film Crazy Rich Asian (2018) appears to have the lead role in this movie even though Jennifer Lopez has a starring role and the possibility of her receiving an Oscar nomination that has been talked up. This female directed and written movie by Lorene Scafaria along with co-producing credits going to Lopez and interestingly enough Will Ferrell displays on screen an edgy and authentically, finely balanced mood and tone film imbued with both sharp drama and a genuine comedic humor rarely enveloped into one movie. While there are a lot of titillating suggestive scenes, this movie avoids the glamorization of the striptease unlike that overly stylized in the musical and Oscar winning Chicago (2002). Instead Hustlers focuses on a raw look at women living a life that is both hard and reflective of the struggle that every woman faces, including the responsibility of caring for one another and their children. This amazing and compelling experience of a slice of life is powerful and sensitive portrayal of the connections and the travails of the lives of what seems to amount to be essentially single women living in a high-stakes life in an effort to survive. The only weaknesses that stand out are the absence of a more descriptive understanding of Wu's interaction with her boyfriend and their evolving relationship and Lopez's apparent willingness to retain a connection with one of her more questionable hustlers."
    },
    {
      "title": " J.Lo shines in gritty yet funny stripper drama",
      "review": "\"Hustlers\" (2019 release; 110 min.) is \"Inspired By a True Story\", we are reminded at the beginning. As the movie opens, it is \"2007\" and an Asian-American girl named Dorothy is getting ready for work at a strip club. Then a Latina woman named Ramona makes her grand entrance and does a spectacular pole dance as Fiona Apple's \"Criminal\" blasts from the speakers. Duly impressed, Dorothy reaches out to Ramona for some dancing tips, and the two hit it off. We then go to \"2014\" where we see Dorothy being interviewed by a journalist... At this point we are 10 min. into the movie, but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the latest movie from writer-director Lorene Scafaria, whose \"Seeking a Friend For the End of the World\" some years ago was one of my favorite movies of that year. Here she takes a New York magazine article and turns it into a wild, wild movie. Beware: not much is left to the imagination. The grand entrance of Jennifer Lopez in that opening scene's pole dance is nothing short of stunning. In fact, the same can be said about Lopez's overall performance, which should be Oscar nomination-worthy, and certainly is a career-best performance. Lopez turned 50 this year, and looks about 35. She takes control of the movie, and requests, makes that demands, your attention. You are more than happy to give it to her. Constance Wu, Keke Palmer, and Lili Reinhardt round out the primary performers. Check out Cardi B and Lizzo (part of the strip gang). When a movie's principal set is a strip club, you can expect a lot of fist-pumping music, and the movie more than delivers on that level. In addition to the aforementioned Fiona, there are songs from Britney Spears, Janet Jackson (\"Control\", of course), Fat Joe, Queen She, 50 Cent, and many, many more.\"Hustlers\" premiered a few weeks ago at the Toronto International Film Festival to immediate acclaim, and was released wide last weekend (outperforming expectations at the box office). The Saturday matinee screening where I saw this at here in Cincinnati in its second weekend of release was attended very nicely (a good 30 people in a small room). If you have an interest in seeing a gritty yet funny stripper drama starring an Oscar nomination-worthy Jennifer Lopez, I'd readily suggest you check this out, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion."
    },
    {
      "title": " Don't believe the 1 star reviews",
      "review": "I'm not a movie critic but I can tell you that this movie is not commenting on society in relation to sexism. It's not trying to say that women are greater than men or that all men are horrible and are deserving of any hurt that is brought upon them. It's not commenting on feminism. I don't believe that this movie is meant to exemplify how women should demand power and wealth in the real world. It is a crime movie. There are no forces of good vs. evil. These women took shortcuts to live their lives in luxury by lying, cheating, and stealing.No one is condoning this type of behavior, but most low-rated reviews I've read here seem to have been written by people who have taken offense or feel morally disturbed by the decisions these women have made in the movie and are unable to separate their personal feelings.I think this movie was developed extremely well despite having its source material based on an article. The movie adaptation was funny and warm due to the women's personalities and chemistry with one another. The music was amazing and really caught my ear when they played classical music during non-clubbing scenes. The visuals were cinematic and captivating. The only reason I give this movie a 9 instead of a 10 is because I believe that some sequences ran a bit too long before continuing on with the storyline."
    },
    {
      "title": " Great performances, decent directing, amateur writing, terrible editing",
      "review": "J-Lo was amazing in this role, as was Constance Wu, but novice writer and director Lorene Scafaria did an ok job directing, but the screenplay was garbage, with many plot and technical issues, especially towards the end. The pacing was too slow for the story, and the 110 min run-time felt like 3 hours. And the abrupt scene cuts by editor Kayla Emter... a kindergartener with plastic scissors could've done a better job. Aside from this being based on real events and (surprisingly also cast) Cardi B's acknowledgement she's done this, I do agree that this \"girl power\" garbage has got out of hand. I wasn't impressed with all the gal's playing victims and none of the men they robbed weren't. Clearly a one sided opinion coming from an entirely all-female production. That alone lost points from me. This film is not even close to the fake 10's - it's barely at best a 7/10, but also not worthy of all the 1's and 2's (production value alone is at least a 4). It's an honest 6/10 from me, most points for the leads performances."
    },
    {
      "title": " Bland and boring DESPITE J-Lo's good performance",
      "review": "When I first saw the trailer for the Jennifer Lopez \"strippers get back at scummy Wall Street-types\" film, HUSTLERS, I wasn't at all interested in seeing it But then I got wind of strong early reviews with some (very faint) Oscar talk about J-Lo's performance in this film, so I thought I'd check it out.I should have trusted my instincts.What a lame disappointment this film is. It starts out flat and then flattens out even further to produce a movie that starts at one (fairly low) level and then stays there the entire time.HUSTLERS stars Constance Wu (CRAZY, RICH ASIANS) as a a young stripper who is taught the ropes of the stripping game by uber-stripper Jennifer Lopez (if you don't know who this is, then go ahead and skip to the rating of this film at the bottom of this review and move on). When J-Lo's character, Ramona, comes up with an idea to get back at the scummy Wall Street types AND make some money along the way, Wu's character, Destiny (of course) is a reluctant participant becoming - over time - the leader.A potentially interesting, \"based on True Events\" story (this film is based on the real life exploits of Ramona as described in a New York Magazine story), this film just falls flat and I put the blame for this in 2 places.Lets start with Director and Writer of the screenplay, Lorene Scafaria (SEEKING A FRIEND AT THE END OF THE WORLD). She wrote - and directed - this film like it is a modest-scaled, low-key independent film (much like the very good SEEKING A FRIEND...), but the second that this film cast Jennifer Lopez as the flashy leader Ramona, words like modest and low-key should have been thrown out the window but Scafaria chose not to do this, she downplays the best asset in her movie and plunks most of her effort on a lead who could not match Lopez star power wattage.And that lead is Constance Wu - the other weak link in this chain. I thought she was \"just fine\" in CRAZY RICH ASIANS, blending into the scenery when more flamboyant personalities were on the screen (in CRA it was Michelle Yeoh's \"tiger mom\") and she blends into the scenery whenever J-Lo is on the screen in this film - and that just doesn't work here. She needed to step up and step out and match J-Lo blow for blow, but she backs up and backs away in these crucial moments, so when her character is on the screen alone - trying to get the audience's sympathies - I just didn't care.What I did care about is Jennifer Lopez's performance as Ramona. She is the brightest spot in this film and brings her star power and natural charisma to the screen. The ultimate problem with this performance (and NO, it is NOT Oscar-worthy) is it feels that she is fighting the \"low-key\" headwinds of writer/director Scafaria the entire time.Former Disney star Keke Palmer and current RIVERDALE star Lili Reinhart bring some fun and energy to the screen as the 3rd and 4th partners in this quartet of stripper Robin Hoods, but they are all too often sentenced to strut around in the background in tight outfits. I would have loved to see a movie with Lopez, Palmer and Reinhart that was more \"out there\" and less restrained.Finally, two very good actresses - Julia Styles and Mercedes Ruehl - are in this film in \"what-the-heck-are they-doing-in-this-film\" roles that are underwritten and underutilized the talents of these actresses - another missed opportunity by Writer/Director Scafaria.I've heard this film called a \"female empowerment\" film or \"the stripper version of Goodfellas\" and I couldn't disagree more. The only \"empowering\" part of this film is when the credits rolled and I could leave.Letter Grade: C4 stars (out of 10) and you can take that to the Bank(OfMarquis)"
    },
    {
      "title": " Women Hos Why?",
      "review": "Why would women be in a show like this. It is degrading. Have respect."
    },
    {
      "title": " Another jlo movie who cares",
      "review": "Another Jennifer Lopez movie about her attitude which is way too big I'm just done with Jennifer Lopez The Prodigy of her"
    },
    {
      "title": " Nooo",
      "review": "Hell no this movie is bad ,jlo can act for shiiiit just like they rest of the crew"
    },
    {
      "title": " Uneven, but noteworthy",
      "review": "Hustlers starts fast, a naive dancer, Wu, is taken on by the old pro, Lopez, who shows her the ropes. But there's only one problem, the teacher doesn't know where to stop.When the recession of 2009 hit the narrative quickly becomes Bridesmaids meets Goodfellas... And if that sounds strange it's because it's a little odd. It jumps from slapstick to serious, and doesn't quite know where to fit.That being said, Hustlers is DEFINITELY worth the watch. While it's unusual it's also original enough, in that it's a common folk revenge film about the greedy and crooked men who caused the 2009 meltdown.Lopez is great, just fantastic. However, overall, there were just too many characters. Wu and J Lo, never quite connect. The overall feeling is just a bit disorienting."
    },
    {
      "title": " Its an okay, yeah thats it.",
      "review": "Sex workers Hollywood style, they shed some light but doesn't seem completely original nor does it deserve to be on such a high pedestal by critics, do critics these days just go the opposite of what viewers say? We go right they go left we say yes they say no, Its such a weird movie they tried saying girl power throughout the movie, if they were male actors probably would call it rape and disgusting, they tried making strippers that they're these sexy irresistible girls. I'll give this movie a failing grade, a Magic Mike remake into girls basically."
    }
  ]
}