{
  "Joker(I)(2019)": [
    {
      "title": " good but overrated",
      "review": "It is a good movie with some caveats, I think they overestimated the movie by saying that it is intimate, given that the character flies before 1 hour on screen and there are not many scenes that make this construction, besides the several script flaws to the address a serious topic. Joaquim's performance is the great protagonist."
    },
    {
      "title": " No Joke, Joker Is A Comic-Book Masterpiece, Send In The Clowns",
      "review": "PROS:Joaquin Phoenix's Joker Is Going To Be IconicTodd Phillip's Masterful Directing (Yes I Mean That)Solid Supporting Cast (Especially From Robert De Niro)The Psychological DramaLawrence Sher's Gritty And Beautiful CinematographyThe Musical ScoreThe Realistic ToneIts Gets Really Creepy And DisturbingSome Moments Of HumorThere Are Some Genuine SurprisesThe Messages And Subtext Is Done WellIt Makes You Question What Was Real Or NotThe 1970's Homages (The Scorsese Influence Is Obvious But Well Done)CONS:NONE!!!(SJWs are going to tear this movie apart for no reason)"
    },
    {
      "title": " Hahahahaha.......hahahahahahaha.....hahaha....",
      "review": "A game changing film...10 out 10 ...Sad and Dark ...it will move you and every scene is brilliant ...you feel empathy for Its main protagonist..and leave the cinema .. questioning what you have just seen ...."
    },
    {
      "title": " Awesome movie! The most disturbing thing was....",
      "review": "The story was great, acting was suburb! Great depth to the character and arc to becoming the iconic joker!The most disturbing thing was the mother who brought there 7yr old. This is not a kids movie. Disturbing content, that made me (42yr old) winch - even more with knowing a child was there."
    },
    {
      "title": " Joker is Dangerously Incompetent",
      "review": "I read many other reviews before seeing this movie. A few said it was great, some said it sucked, but most just thought it was alright. It was just ok as movies go, but when you add in it's annoying intention to depress you with every frame of every scene of this movie you will ultimately end up questioning why you are subjecting yourself to this unnecessary torture. Here's how you know you have stayed on the Joker train too long; he will literally walk into the funniest moment in the movie. You will laugh because you'll appreciate that fleeting moment of fun before the darkness returns, bludgeoning you to death with depression."
    },
    {
      "title": " You must go and see it for yourself",
      "review": "Overwhelming, Mesmerizing, Disturbing and Beautiful. This is not your typical comic book movie adaptation crap, it is a tragedy. It is the tragedy of Arthur Fleck, his rebirth as Joker, a transformation of someone troubled to a psychopath let loose. Phoenix is surely getting a nomination for his phenomenal performance it is just as if he doesn't simply act but becomes the Joker. A feast for eyes and EARS. Check Hildur Guðnadóttir, her score is amazing for this movie."
    },
    {
      "title": " Oscar-worthy performance from Joaquin Phoenix",
      "review": "In this adaptation of Joker, one of the greatest villain of all time in history, Joaquin Phoenix delivers a magnificent and unforgettable performances as a madman driven into insanity.There has been multiple portrayals of the Joker, and all of them has done the character justice, however, Joaquin Phoenix's Joker has beaten all that had come before him. I used to think that it will be near impossible to surpass Heath Ledger's Joker in The Dark Knight, but this one did. Seeing the commitment Phoenix has for this character really moved me and I believe, after many nominations, this will be where he will finally receive the Oscar.As for the story, it was good but I think it could be better. I was hoping for it to be darker and grittier. The story was depressing, but I wanted it to be even more depressing, so much that it was intolerable. Still, director Todd Phillips has done a great job for a drama film and I hope to see more of this genre from him in the future. The tone and color of the film is also wonderful, and the cinematography is exceptional.All in all, the film is fantastic and the performance from Joaquin Phoenix is absolutely phenomenal. A must-watch!"
    },
    {
      "title": " Forensic psychologist review",
      "review": "Pure magic it's the best movie to depict a descend into madness"
    },
    {
      "title": " Incredible",
      "review": "I haven't went to the movies in 3 years. I went for this one. One of the best movies & performances I've ever seen. Hands down."
    },
    {
      "title": " \"One bad day..\" Then some.",
      "review": "Joker review:Okay, so.. Let's just get in to this shall we? First off, this movie is not your typical, Dark Knight, Batman villian story. It's very much an origin story and by origin I mean the very beginnings of what the joker becomes. That being said, it was nothing short of a masterpiece, I see a few oscar nominations in the future. Joaquin did an amazing job, as did Robert De Niro. This movie pushes the bounadries of what it means to be deranged and mentally ill and suffering. But laughing it off and slowly giving in to madness. This movie makes you uncomfortable at times, makes you feel for this character. Like he isn't a villain, you see the fall and reality of it all. I really don't think I blinked for the whole 2 hours of the movie. It honestly has a The killing Joke vibe, but it's expanded out in to much more than \"One bad day\" Joaquin has the mannerisms and style I would expect the joker to have. It's violent, really violent of a movie. Goodfellas, The godfather type stuff. I recommend this movie for any comic book fan and anyone interested in a good thriller, drama. I will comfortably give this move a 9.5/10 in my personal opinion. It's on par with Heath's joker from the dark knight for various reasons, just gives you a whole new look at the rising up of the crown prince of gotham"
    },
    {
      "title": " Slow Burn",
      "review": "I cannot even find the words to describe this movie, especially the last act of it. Joaquin tore this role to shreds. I was very very afraid that it wouldn't live up to the masterful trailer, but the journey you take with Arthur is so engrossing that by the time you get to the end, you want more.And for an origin story to do that, world-build, character development at its peak, neutral stance on political topics, topped with Joaquin. The late night talk show scene is the Joker I hope to see more of in any kind of way.It definitely takes its time building but by no means is it boring at all, especially when you get to about halfway through. It all makes perfect sense. In reality 8.5/10. It reminds me of \"Batman Begins\" the perfect origin."
    },
    {
      "title": " 8.5 rating",
      "review": "The movie had a amazing acting by joaquin phoenix, great diercting and cinematography but it took alot of things fros taxi driver and the king of comedy and this was the biggest issue in the movie. The second issue that the movie focused on the physiological part of arthur flick we didn't see a real joker except at the last 15 minutes of the movie so the movie is so great and one of the best movies of 2019 but it's still not a masterpiece"
    },
    {
      "title": " Joker as you've never seen him before.",
      "review": "Joaquin Phoenix at his pinnacle.. Never have I seen such a performance from a somehow underrated actor.. Not anymore I guess. The way he portrayed Joker is unreal. One would say that Joaquin was acting himself. The story was good. There were moments where you didn't know what to feel.. Certainly kept me on the edge of my seat at times and confused at other. I believe this is the only proper way of telling Joker's life. A solid 8 from me and a must watch for sure."
    },
    {
      "title": " A masterpiece.",
      "review": "Just saw the #Joker last night in Bahrain and it sent chills down my spine . I think this is a one of a kind movie , something that should be experienced by all movie lovers . A slow burn into reality which is far more haunting than fiction.It is not a Superhero movie nope .... it is a super villain movie .An honest reflection of how we are all responsible in creating monsters .Simply a masterpiece . Oscars ... yes for sure."
    },
    {
      "title": " I don't see how that highly intelligent Joker on Dark Night started from this insane person",
      "review": "The Joker on The Dark Night is a highly intelligent person who holds deep conversations with prominent people, capable of planning a complicated bank robbery and was one step ahead of Batman, the police and intelligence. He has a strong personality free from emotionality and he laughed controllably. I can't see how this mentally unstable person on this Joker becomes that awesome Joker."
    },
    {
      "title": " Worth watch it but is not spectacular",
      "review": "Best you will watch is Joaquin Phoenix 10/10. Art and photography 10/10. Script 6/10."
    },
    {
      "title": " An unnerving masterpiece",
      "review": "'Joker' is an excellent character-piece on a man that gets beaten down in his world and changes into a terrifying symbol for others. Joaquin Pheonix's portrayal is unforgettable, carrying the film and making the character feel as real as possible. Though the movie may be slow for some, it is necessary to show all the events that are necessary to transform a character in this manner. The film is a must-watch due to Joaquin's portrayal of this classic character. An excellent performance, stunning cinematography, and stylistic score makes this film great."
    },
    {
      "title": " Awesome",
      "review": "The best ever it personafiese the joker's in every aspect"
    },
    {
      "title": " Say no more! Just watch it",
      "review": "Watching this movie seems like sitting with dementors for 2 hours (in a good way, obviously). They spread the darkness and eat your soul."
    },
    {
      "title": " Simply Brilliant",
      "review": "The whole movie, starting from the very first scene, connects to you deeply. It is a rare movie, I'd say, these kind of movies are made once in a century. It has all kinds of emotions, lows and highs, ups and downs, everything. The way they connect the story between Arthur Fleck (early Joker) & kid Bruce Wayne (Batman in future) made so much sense and had so much meaning to it. The script, story, screenplay, direction, everything in the movie was on point. The Music Director - Hildur Guðnadóttir completely nailed the BGM.I don't think we can find any fault in the movie, because there was not even one single actor who acted a bit off. Everything in this movie, was simply, perfect.Hence, Simply Brilliant."
    },
    {
      "title": " Brilliant",
      "review": "The supervillain of the batman the Joker there is some nice connection to the batman I absolutely enjoyed the movie and acting this actor phoenix that was the amazing part of the movie I have seen his movie first and I am his fan now brilliant performance."
    },
    {
      "title": " So good",
      "review": "Amazing. Joaquin was amazing. Gonna win an Oscar for sure"
    },
    {
      "title": " Phoenix rising",
      "review": "Joker is a human origin story that dispels the mystery behind the character known only as 'The Joker', or Jack Napier in the rarely referenced comic book lore. In this adaptation, it's a downtrodden Arthur Fleck. To me, this is not a comic book movie, it feeds into what is ultimately a comic book creation, but it offers a gritty realism that makes even 'The Dark Knight' look pretty.These are the days before the Batman dons the mask to save Gotham from itself, but 'Joker' shows how the vigilante may just be settling a longstanding debt that has come back to haunt the Wayne family, it even may suggest why Batman is merciful of The Joker - you'll see just how Batman's greatest nemesis was created - and it will surprise you to great effect; even if it differs from the traditional origin story. Some critics suggest this movie hasn't much to say, but in the context of the overarching Batman story, it absolutely does.It traded the notorious chemical incident and Chelsea smile for something perhaps a little less far-fetched - 'Joker' acknowledges the Batman universe, but the focus is very much on the concept and character that embodies the infamous clown and how the mask is a representation of chaos that can easily be spread, just as a mask can be used for justice. It's the Joker's turn in the limelight, as the Waynes are pushed to near minor characters, and cast in the shadow of moral ambiguity.Did you know that although the Joker was planned to be killed off during his initial appearance, he was spared by editorial intervention? This movie fittingly gives a nod to this part of the character's past in its closing scenes.The movie also offers an explanation for The Joker's hysterical laughing; what was once a tragedy became a comedy - and the rest is history.While fresh concepts carry this movie beyond the box office, it was slow in parts, and lacked a breadth of characters and locations. There weren't many grand sweeping shots of the Gotham landscape. There also weren't many subplots or cutaways to other characters, this isolated the plot into almost entirely Phoenix, where I feel there could have been opportunities to bring in other characters and perspectives.I disliked the subplot with Sophie Dumond as it didn't add much to the story, and also felt as if Arthur's character could have been more eccentric, instead some of his scripting was jarring, perhaps deliberately so - there needed to be more one-liners to reflect the Joker's natural wit and flair, although his outright strangeness was captured quite well, if a bit excessively.This movie delivers a solid punchline, 7.6/10."
    },
    {
      "title": " Beautiful, Mesmerizing and Haunting",
      "review": "I miss Heath Ledger and can't get enough of his portrayal of Joker. He was intimidating, scary, unpredictable and all other things. In 2016, we got Suicide Squad and Jared Leto as Joker both of which disappointed me very much. After that, I thought that I don't want to see another Joker interpretation on the big screen. I was skeptical when I heard that a standalone Joker movie was in works. Then I heard about the casting of Joaquin Phoenix as Joker and I developed an interest in it because I love his work. He is a method actor and has given some of my favorite performances for example in Her (2013) and The Master (2012). I decided to see the movie in the theater after hearing a lot about the movie, good and bad and I am glad that I saw it.This movie is really good, it exceeded my expectations and Joaquin Phoenix should get an Oscar for his work. He is phenomenal and I was blown away by his performance. His performance alone carries the whole movie and lets you experience and understand the character without saying much. His physique, movements, gestures, grace, way of speaking suggests that he gave his everything to make the character compelling and stand out from other Joker portrayals. He lost 52 pounds for the role. He embodied the character of Joker. Comparing his performance with Heath Ledger will be absurd. There is no common ground for comparison. Both interpretations of Joker are significantly different, the story is different, character motivations are different.Now talking about the story, this is a standalone Joker movie that shows how a man beaten up, neglected and humiliated by the society turns into a maniac. This movie follows Arthur Fleck who works as a party clown and lives with his mother. He wants to be a stand-up comic. He suffers from a condition causing him to laugh uncontrollably. We feel his loneliness, depression, and condition and sympathize with him for it. All the other performances were also very good. This movie isn't that much violent as people are saying it to be, but it makes you feel the violence and it is unsettling. It also allows the viewer to form their perspective about the character. Sometimes you will agree with his actions and sometimes you won't. There are also certain funny scenes in the movie but not everyone may find it funny.The movie is directed by Todd Phillips and he has done an outstanding job. I didn't think that the guy who made The Hangover movies can pull this off, but he did it. He showed that as a filmmaker, he can make more than just R rated comedies. The film is set in 1981 and the period is very well reflected in the movie. The cinematography is top-notch. Shot composition, camera placement, camera movement has been handled well. I was surprised by how good the Gotham city looked, beautiful and dirty at the same time. Each scene had a color scheme. The lights in the surroundings like light from streetlights, cars or the sky illuminated everything with their light. Joker/Arthur Fleck's emotions get conveyed through shades of light falling on him which is beautiful to look at. Music is beautiful, chilling, hypnotizing and speak lengths about the inner feelings of the character.I have just a few issues with the plot of the movie and how some things happen which shouldn't have happened or couldn't have happened, rest the movie is flawless."
    },
    {
      "title": " First Viewing 8/ Second Viewing 9",
      "review": "This movie benefits from a second viewing. You can really get into the film rather than getting into what the film does and doesn't do to meet your expectations based on what people are saying.Joaquin Phoenix DOMINATES the screen, this film is also technically great.I recommend seeing it at least twice to get all you can from it.First viewing 8/10 Second Viewing strong 9/10"
    },
    {
      "title": " A great transition in Joker perception",
      "review": "I watched the movie on 2nd October . I was so impressed by Joaquin performance and the way he has lost a significant weight in order to suit into the movie . He studied some aspects of psychiatry to lear how to do an abnormal laughter which is really challenging ! I believe he is the best who performed the joker and I am so far astonished by the high level he has reached in acting and doing a drama . The movie is excellent , it gets more exciting as you watch it and you will be captured by the character . Performance , Directing and scenario all 10/10 . Bravo"
    },
    {
      "title": " Pure MASTERPIECE",
      "review": "I can watch this movie million of times without getting bored."
    },
    {
      "title": " Heath",
      "review": "'Joker' character needed a face and Phoenix gave a perfect one it deserved, heath must be feeling very proud. And I'm currently 1 just for heath."
    },
    {
      "title": " The best Joker till date !",
      "review": "Joker is undoubtedly overwhelming, mind blowing , dazzling, breathtaking one !The movie slowly starts with Arthur's day to day life and completely turns into a chaotic athmosphere towards the end. I am sure of one thing this movie will be marked up as the best of Joaquin and the best Joker ever. I truly wanted to see a performance which overcomes Heath Ledger's Joker and Joaquin just made the wish come true. Joaquin Phoenix you beauty!Truly a masterpiece! Climax portions = Adrenaline Rush'There's no punchline' :)"
    },
    {
      "title": " Phoenix's Perfomance.....",
      "review": "....nothing short of amazing. Absolutely an academy award winning performance, despite anyone's opinion of the story line.....Like Marmite, you can love it or hate it, but Phoenix's acting ability deserves the HIGHEST marks"
    },
    {
      "title": " Joaquin Phoenix, Wow!!",
      "review": "First time ive ever reviewed a movie and this is deserving of my first, Joker was gritty, dark, intense and i absolutely loved it! His life was in fact a tragedy that in the end he saw as a comedy and that itself is heartbreaking to me, and as he got knocked further down by the world and people and events happening around him and descended more and more into madness it was quite sad to see him become Joker which i thought was powerful , but  his acting was incredible, the standard was ridiculous it even made me emotional marvelling at how insanely good he was on screen. Joaquin will win best actor at the 2020 Oscars, as nothing comes close to me in years. Todd Phillips shot a beautiful movie to look at, sleazy and grounded in realism so fair play to a guy no one beforehand believed he could pull this off with the announcement he was directing. And to top it off the score was beautiful and menacing. 9/10 for the film 10/10 for Joaquins performance, cant wait to see it again, And please no sequel it isnt needed atall!"
    },
    {
      "title": " Awesome",
      "review": "The best movie of the year Every one needs to watch it"
    },
    {
      "title": " Joaquin's no joke as the Joker...",
      "review": "Todd Philips' \"Joker\" has spread so many comments and controversy that I don't know exactly where to stand. The film reminded critics of Martin Scorsese's \"Taxi Driver\" and while Joaquin Phoenix' performance channeled the inner angst and alienation that drove the driver Bickle to an extreme -and bloody- corner, I found so many other sources of inspiration that if anything, \"Joker\" is the best tribute to the New Hollywood period.I found \"Network\" in the film, \"Death Wish\", references to \"The King of Comedy\", Marty's underrated movie about a man who wished to exist through the only talent he felt being endowed with... and naturally, there's something of \"A Clockwork Orange\" in the obscene stylishness the Joker embraces his new persona with. In a way, that the film met with controversy is logical, you can't make a social comment about violence and its dangerous appeal by sugarcoating it, violence like its enemies, use symbols and slogan, in fact, revolt is a mask that violence uses to operate undercover or is it the opposite? \"Joker\" is the slap today's audiences needed and that it used the Joker mask in our superhero era makes it even more relevant and accessible. But truth be said, any controversy the film should stir mustn't distract from the real deal.Indeed, any viewer familiar with one tenth of Phoenix' filmography knows the actor's ability to portray enigmatic and troubled characters with a dark side barely hidden, but even with that in mind it's impossible not to be blown away by his performance and compelled by his suffering. He shouldn't be the dark horse of the awards season but the frontrunner because his performance is so rich, so powerful, so intense and so bizarre and grotesque in a captivating way that it's almost like watching a movie within a movie, as if his distortable face was the operation theatre to his acting force, as if his nervous smile slowly turning into cries made a true symphony of pathos and anger. That actor is a treasure to Hollywood and here he's given the kind of rangy performances that can't do without earning awards. His snubbing would be controversy material if you asked me.Now, to the film. The first act immerses us in the life of Arthur Fleck, a clown and wannabe stand-up comedian. At first, I was afraid that the manic laughter scenes would be too redundant and turn themselves to cheap gimmicks, to remind us that we're dealing with the Joker, but no, Phoenix plays his Arthur as a man who's not a bad person. Raised by an over-protective and sickly mother, brutalized by kids who sees in a clown a living sign saying \"kick me\", humiliated by people who can't understand his medical condition, the point isn't to portray Joker as a martyr but a product of a specific environment and education, or lack thereof. Like anyone, he's got dreams, projects, but he's entrapped in a condition that makes it impossible to communicate or connect with the others except through hallucinations and would-happen moments, he's a misfit with a fragile condition that keeps worsening until it offers a platform for his dark psyche to perform.Does the film excuse him? No. Does it justify his actions? Hell, no. It just clarifies the need to perform that way. There's a point of no return reached in that psychological journey, when one humiliation too many triggers a strong desire to express itself through a sort of showmanship, something relevant in our days where people seek any ways to reach posterity. Set in what seems to be the early 80s, it puts Arthur in the same urban alienation context than Travis Bickle but with a passion shared with Rupert Pumpkin's and a \"mad-as-hell\" prophetic rage with Howard Beale's role. Near the end, there's a shot that follows one of the film's most shocking moment and it's an obvious nod to the anticlimactic finale of Lumet's masterpiece.But I can't insist too much on how good Phoenix his, one could see a few impersonations of Malcolm McDowell's dance when he \"punished\" his fellow droogs or get vibes from the two only performances that earned a posthumous Oscar, Peter Finch and Heath Ledger, still, there's something unique in that tormented role he inhabits with such a soul dedication that it makes Nicholon's Joker worse than the cartoon counterpart. ,\"Joker\" isn't dangerous but brave enough to question violence in the way it seems like the only plausible answer, it might titillate a few demagogue instincts but that's an unfair trial in the light of the recent events all over the world and that preceded the film. I walk often at night and see homeless people living in impoverished conditions, drowning their sorrows in alcohol and losing their manners once there's nothing to lose... and perhaps that's leaders' responsibility, praising democratic values while its application contradicts its own ideal. Anything is allowed when nothing is possible, is perhaps the biggest joke of all, and that it goes all downhill when the social budget is cut is perhaps the film's boldest stance against the shift between leaders and people.And that it used Bruce's father Thomas Wayne to connect the final act with a canon we're all familiar with is one of the many narrative delights of that character study and psychological thriller à la \"Woman Under the Influence\" where suspense doesn't come from a bomb but a ticking bomb of a soul. If De Niro's presence ties the plot with its chief inspirations, the film belongs to Joaquin Phoenix who gave a performance for ages, and a character who's relevant in the way he pits democratic ideals against urban reality. And my wish is to see another connection with De Niro with Phoenix winning an Oscar, it would be the second time for a character who already won one after De Niro with \"The Godfather Part II\".As for the glorifying violence trial... we've been there already."
    },
    {
      "title": " The Worst Part of Having a Mental Illness is People Expect You to Behave as if You Don't",
      "review": "Joaquin Phoenix is Arthur Fleck, the man who would be Joker. The entire movie is a character study on this man, with little themes interlaced such as mental illness and the divide between the wealthy and the poor. Unlike other attempts at the Joker's origin, this one did not take one bad day, but years and years of relentless abuse, trauma, and depression. We watch Arthur as he goes from one miserable day to the next, as everything gets worse and worse, and then he gets kicked while he's down for good measure (sometimes literally). This makes it a long, miserable, and uncomfortable viewing experience. The character we all know as Joker is barely present until the film's third act. Until then it's just Arthur Fleck and his descent into madness in a cruel and uncaring world.Joaquin Phoenix deserves every drop of praise he's getting. Every little bit of it. He's dream casting for a role like this, as it feels like Joker was written for him and only him. He's always been fantastic with tormented characters, those who skirt the borders of insanity. And not just movie insanity, but actual insanity. The darkness one's mind goes to when all hope is lost and happiness is an unknowable entity, when waking up every morning feels like stepping into a cold void, where you're trapped in your own head, you can't tell what's real and what's delusion. Phoenix taps into those feelings like a walk in the park. He slips into the role so well you have to keep slapping yourself to remind you you're empathising with a sociopath. His take will divide audiences. Some will find him hilarious, like a dark mirror of Charlie Chaplin, while others will watch him with intense sadness.Nothing encapsulates this better than his laughs. Yes, laughs, plural. Phoenix is not happy with just one iconic laugh. Instead he gives Joker a number of distinct laughs, and each of them are just as unnerving and characterful as the others. His fake laugh is the closest to a typical Joker laugh we get. He uses it at odd, inappropriate moments, or as an attempt to fit in with those around him. The way he cuts from a serious expression to manic laughter, and then back to a serious expression is equal parts hilarious and disturbing. He's lonely and detached from society. He doesn't know what makes a good joke. He doesn't find humour in the same things everyone else does, so in an effort to appear normal he puts on a fake laugh; over-the-top and terrible. His other laugh is an involuntary tick due to a mental condition, either from illness or injury. It's loud and hearty. And yet also grossly inappropriate. This time it isn't Arthur trying to fit in, it's a reflex he can't help, and usually comes out in moments of great stress or sadness. These moments are uncomfortable to watch because you can feel his desperation to make them stop. These are tragic, painful laughs masking tears.The other star of the movie is Hildur Guðnadóttir's haunting and upsetting score. It's a stripped-down orchestral score, centred on a handful of cellos. It evokes the tragic nature of Arthur's life, while also remaining dark and tense, putting you at constant unease. It uses silence and atmospheric lulls brilliantly, allowing the rest of the film to breathe before the overpowering single Cello line bursts back in. Even in Joker's final triumphant moment at the end of the film, the score still feels overpoweringly dark and brooding. This is no hero we're witnessing, this is a villain of pure evil and insanity.Joker is not your average comic book movie. Go in expecting a typical superhero origin and you'll be disappointed. There's no antagonist, no brazen action sequences. It's slow and methodical, the violence is sudden and disturbing, but used incredibly sparingly. Also for a film entitled 'Joker' it's not particularly funny either. It has its moments of genuine humour for sure, but usually the level of comedy is so dark you'd feel bad for laughing at it. There was a guy in my screening who, much like Arthur, was laughing at the most inappropriate moments and literally applauding the violence. It was like Arthur was in the cinema with me watching his own movie. It was unnerving, but mostly I couldn't understand how he didn't see the irony in it. You'll either find this movie a darkly hilarious comedy, or find the experience closer to a deeply upsetting traumatic event. We may never see another film like this, but it may also open the eyes and minds of major studios to what they can achieve with comic book material. An R-rated villain origin, in the style of a gritty indie drama, focussing on the depravity of mental illness. I give Joker a potentially industry-changing 9/10."
    },
    {
      "title": " Best movie for 2019",
      "review": "Best movie, Oscar for Joaquin Phoenix I have enjoy every minute"
    },
    {
      "title": " Brilliant!",
      "review": "Joaquin is superb. Deserves the Oscar for this performance"
    },
    {
      "title": " The best \"comic book\" movie!!!",
      "review": "Darker than dark knight!!! It beats endgame in the race for the best comic book of the year!!!"
    },
    {
      "title": " Worth all the hype",
      "review": "Joaquin absolutely nailed this performance, this is the best acting I've seen in a while (if he doesn't get an Oscar I don't know who will). The movie has a very simple premise, but is executed very well. Every scene looks like a painting and there are not many lines, but every one of them is powerful. Go watch it if you haven't!"
    },
    {
      "title": " THIS IS MAGIC !!!",
      "review": "Can't stop myself from talking about this one......#no_spoilersDark as hell, Joker takes u through the disturbing journey of Arthur Fleck, from being a clown & a wanna be stand- up comedian (with only one joke in his hand.....his life) to become THE \"JOKER\"......this journey never looked unreal though, unlike that of a hulk or a spider man....as this journey was quite human, logical and beautifully graphed and captured(of course) !!!Heath Ledger from the 'Dark Knight' was my personal favourite joker till date & Joaquin Phoenix took the legacy of Heath to another level altogether.....that laugh, that dance, that sprint, that walk....uff....can't get over that !!!Talking about the other aspects of the movie....the background music was the soul of the movie, if not the psyche and the madness of joker itself,,,,,the cinematography, the supporting cast, the direction...everything thing was right on money , the movie very smartly dealt with the then situation of America (the Gotham city),,,,,the unemployment, the raising power in the hands of the rich....all it took was a stand and a voice (be it good or bad) against the established power to become the 'HERO'...which further became the reason of the rise in murders & crime in the city !!!In his small appearance, the legend Robert De Niro was exceptionally awesome, something that u would expect from him everytime u see him on the screen.....that small conversation at the end btwn joker and De Niro was cinematic beauty and looked damn organic....an absolute treat to watch !!!Don't know about the oscars, but it was once in the lifetime performance by Joaquin Phoenix....and would remain in my heart for years & in my brain for days to come,,,may be.....The best portrayal of a psycho character that i have seen...was that of Christian Bale in 'American Psycho'.....Phoenix was right up there too if not above, not only the craziness, disturbance and madness but also the physical transformation was quite commendable.!! IF HEATH HAS GIVEN HIS LIFE FOR THE JOKER THEN I WOULD SAY PHOENIX HAS GIVEN A LIFE TO THE JOKER !!My one of the favourite lines from the movie was...joker saying to himself,,,\"I used to think that my life is a TRAGEDY but now i realise that it is nothing but COMEDY\"....so, u can imagine how disturbing a movie could be with it's theme being 'TRAGEDY=COMEDY'...but it was not that disturbing for me as i am used to of or aware of the ongoing social-political structure of our country !!!It has got those 'Dark Knight' (arguably one of the finest superhero movie ever made) vibes...i had an emotional ride, watching small Bruce Wane (Nolan's batman) meeting Joker, getting to know the pre batman story of the Gotham city and the back story or the building-up of the 'Joker the villain' of dark night.....IT WAS QUITE NOSTALGIC FOR ME IN THAT WAY !!!If i would have maximum of 5 stars to give to this movie, i would have simply divided it by zero (0).....i write about movies all the time but this one has that 'something' that forced me to type and share my views with u guys instead of writing it in my diary.....on that note i would like to finish this review with one line....\"THIS IS THE BEST MOVIE IN LAST SEVERAL YEARS THAT I SAW....& U CAN'T CAN'T CAN'T MISS IT\" !!!#JOKER_2019❤❤'ALL IT TAKES IS ONE BAD DAY'-JOKER😉😛😂"
    },
    {
      "title": " Outstanding!!!",
      "review": "Very intense!!! Superb acting!! If Joaquin Phoenix doesn't get an Oscar for this, I'll never watch them again!!! A definite must see movie!!!"
    },
    {
      "title": " Amazing! A work of art",
      "review": "I can't say anything it hasn't been said. This movie is a work of art. Should win 3 Oscars at least."
    },
    {
      "title": " Cinematic history- 10/10",
      "review": "Joker is perfect, it connects perfectly with DC universe without trying too hard. It's freaky, graphic and dark without coming across as forced or cheap. Overall it's a stunning film. The soundtrack is perfect (Cream-White Room towards end is fitting/awesome). Phoenix is superb, he gives so much poignancy and meaning to literally *every* word he says - \"All I have are negative thoughts\" you can literally see the pain in his eyes when he says it. It's fantastic.Overall, Joker is my new favourite film. Please go and watch it and decide for yourself. It's too good not to...And if it's not for you? That's ok! You probably just watched JP's Oscar nomination film so at least you can still be a part of cinematic history!"
    },
    {
      "title": " Depressing movie",
      "review": "This is a movie that I want to forget. The most disgusting and psychopathic movie I have ever watched.... :["
    },
    {
      "title": " This is not a BATMAN movie",
      "review": "If you are going to watch it thinking that it will be an action movie Well it is not This movie is so deep And that explains why a lot of people didn't get it You can do some readings before watch it Read about Anarchism And is good and bad are objective or subjective And culture and counterculture Also I recommend a book by George Orwell -animal farm- So yah you really need to know stuff to get it"
    },
    {
      "title": " Great movie!",
      "review": "I loved everything about this movie. I'm not a big DC fan, so I can't comment about how it does or doesn't follow the joker/batman story. Joaquin did a phenomenal job!! The music was also fantastic! It's depressing as it is dark and dealt with mental illness so you won't necessarily \"enjoy\" the movie, but it is one of the best movies I've seen this year. I saw this movie 2 weeks ago and I'm still thinking about it. I will be seeing it again."
    },
    {
      "title": " First DC movie i fell inlove with",
      "review": "Amazing movie, sign me up for a sequel. There have been too many great marvel movies and joker is one of the movies that can top that."
    },
    {
      "title": " Dissappointing and Underwhelming",
      "review": "Just to say that the film left me wanting to watch \"The King of Comedy\" and \"Taxi Driver\" the whole time, plus a few of the other films that this film strongly references. Joaquin Phoenix is fantastic however and the film has all the top production values that you'd expect of a big studio picture but it's generic and predicable in my opinion. It takes from so much that it's not it's own film for me. By no means is the film awful, it's just soulless. I'm not trying to be deliberately obtuse and against the tide of support for this film either, there are things as I've mentioned to commend and I'd like to add that going the way of gritty R rated film making is what I've wanted for years, from a more dramatic viewpoint, I thought \"Logan\" did what this film failed to do for me as a darker comic book oriented film. I hope people can respect my opinion just as I respect the free speech of everyone who really liked the film. Finally, I will add that those who have bashed the film for violence do not know what they're talking about. There are far more violent films than this and if one person or even a handful of people were incentivised to cause harm to others, the rest of us shouldn't have to pay for the odd few thank you very much. It's an interesting watch for certain and I'd recommend watching for that reason alone."
    },
    {
      "title": " In a world of horrible re-makes/sequels......",
      "review": "Joker is an original movie that may be slow for some people who cant sit patiently as you are rewarded with dramatic tension. I really do time my rest room breaks appropriately but it had me so focused I held it and ran out of my refreshments not to miss a detail. Yes I'll see it again and yes I'll buy it when it comes out. This is creatively told and shown in a rather clever way and allows you to forget that this man used to be Johnny Cash. Amazing performance!!!"
    },
    {
      "title": " Lives Up To The Hype",
      "review": "Nothing much to say except, this is what cinema should be. An amazing film and the performance of a lifetime by Joaquin Phoenix! Arthur's further descent into madness portrayed perfectly. We can all identify with sadness, Phoenix's performance makes you sympathize with this disturbed, neglected man. This was the best film I have seen in a long time."
    },
    {
      "title": " Just another overrated supervillain movie",
      "review": "Apart from A-Class acting, the story line of the movie is very basic and linear. I think I've expected way too much from this movie but it turned out to be just another in line."
    }
  ]
}