{
  "OnceUponaTime...inHollywood(2019)": [
    {
      "title": " amazing movie",
      "review": "Absolutely beautiful movie didn't expect it to be as good advice everyone to watch it"
    },
    {
      "title": " 2.5 hours of sheer boredom",
      "review": "Long, plodding, dull, confusingly edited, and way too many women's feet. It was exactly as bad as it looked in the trailers. Almost no action and Tarantino's trademark clever dialog is completely absent. Tarantino's self-indulgence has finally caught up with him. The first of his films I genuinely disliked."
    },
    {
      "title": " A time bomb ready to blow up.",
      "review": "The lack of plot forces Tarantino to keep us engaged through his sheer talent as a filmmaker. Thankfully, he has talent to spare. Tarantino makes wait for the bloody conclusion we know he'll give us, making us follow and hang out with the characters as they deal with their everyday life and their own personal issues. Sometimes it may feel like it's going nowhere, until we get there and we discover that the destination is both amazing and surprisingly touching. This is the kind of film that you're not sure what to think of when the credits roll, but the more you think about it, the more you realize that you had way more fun than you thought at first. It's not Tarantino's best, but that's only because we expect certain things from him; we get them, just in a way he's never done it before: detached and restrained. It feels like a ticking bomb; at times he ticking takes so long, it could drive you insane, but when it finally blows up, the damage is unbelievable."
    },
    {
      "title": " The most boring move ever made .",
      "review": "Not the worst movie ever, but the most boring.Over 2 hours only waiting waiting waiting waiting.I still fall a sleep almost when I think about this move."
    },
    {
      "title": " i dont understand, what are they doing..",
      "review": "No plot, boring, boring, very slow.. and everybody sleeep..."
    },
    {
      "title": " Once Upon a Time In Tarantino's world how the old Hollywood was",
      "review": "Last night I went to see with my friend in the movie teather the new Quentin Tarantino movie Once Upon a Time... in Hollywood. Since I reviewd his movie From Dusk Till Dawn (1996) which is my favorite Tarantino movie of all time. I like and enjoy this film a lot. I went watching his first movie in movie teather only for Tarantino him self and I decide to gave my proper review on the movie. I went to see it with my friend from work, my friend felt bored with the film I understood what the dircector was trying to do with this movie and what he try to show us. He bring us 50 years back in the history of Hollywood how it was and i like that.Quentin Tarantino is a brilliant, talented writer, director and actor and I respect his visions in movies so much. Once Upon a Time... in Hollywood it is a satirical, historic, comedy. Quentin Tarantino bringed us back in the past 50 years ago on 9th February 1969 and he show us how the 60's were that time in Hollywood. That year in February 9th my mom was only 25 years old at the time when this time is showed. My mom's birthday was 21st February and my mom turned 26th that year. I respect this movie so much and I respect Quentin Tarantino.I love Brad Pitt in this movie love his character Cliff Booth he was a heart of this movie and he was awesome. Brad Pitt is one of the best actors ever. He was brilliant, the actor is a professional and I absolutelly rooted for his character. Cliff Booth was a good heart likeable hero, he was a bad-ass and he wasn't afraid of no one. I think Brad Pitt is a good human being and I like him a lot. Leonardo DiCaprio was good I like him as a washed up actor Rick Dalton. Margot Robbie was excellent as Sharon Tate the actress really starts to become famous she played Tonya Harding in T, Tonya and now Sharon Tate. Margaret Qualley as Pussycat was hot babe I like her. Dakota Fanning as Squeaky Fromme hippie was also beautiful hot babe. Kurt Russell is in here too and he is excellent.The movie tells three story's: one is about washed up actor Rick Dalton played by Leonardo DiCaprio who used to be famous actor but now he is a drawning actor, who struggles to get a better roles in Hollywood and becoming a rising star once again. The second story is about Cliff Booth played by awesome Brad Pitt who is a stuntman out of work and he is Dalton's employe and friend. The third story evolves more about Sharon Tate played by awesome Margot Robbie in which she struggles with her husband Roman Polanski and her role in her movie The Wrecking Crew (1968) watching in the movie teather.Mostly this movie is also not comic and satirical but also reflects on events that year in 1969 and hippies \"The Manson Family\" that really happened and it is important event in history of Hollywood. I enjoy this film.Quentin Tarantino really surprised me, the problems I have is the movie is too long and lacks on action, I wish there would be more action, the action is only showed in the finale. Brad Pitt was a bad-ass he beat his assailant in the phone. I want to say they are 2 movies I enjoy that also reflects the past in the late 60's and that are Almost Famous (2000) and Zodiac (2007) with Once Upon a Time... in Hollywood they are all three great movies that I enjoy. I would give it 10 if the movie had more action, that is the only problem I had with the film so 9."
    },
    {
      "title": " mediocre",
      "review": "Absolute dross, wasted 2hrs of my life watching this rubbish, I went to watch this based on the review score of 8.0. All I can surmise is that there are a lot of folk that are easily pleased writing reviews on this site"
    },
    {
      "title": " Longest movie that never gets to the point",
      "review": "I was so bored and wasted almost 3 hours of my life."
    },
    {
      "title": " Waiting and waiting",
      "review": "The only reason why i gave it any stars is the climax and acting is good! Bring some pens to poke out your eyes for all the waiting til the end. I couldn't believe how many people loved this. It could have been at least 40 minutes shorter but probably a lot more. Thank god Leo and brad were eye candy in the meantime."
    },
    {
      "title": " Wonderful, simply wonderful",
      "review": "I don't remember laughing out loud so much in a movie. The twist, if it can be called that, at the end is phenomenal. I think the tension that built up throughout the movie explodes out of moviegoers in the last minutes due to an ending that is unexpected and brilliant.Pitt, DeCaprio and Robbie are wonderful. This film deserves Oscars."
    },
    {
      "title": " Not for everyone",
      "review": "If you just want to go to cinema and enjoy a movie with your friends, this film might not be what you're looking for. I am not a film critic and I don't know how to appreciate all aspects of an artistic movie, so since it has no storyline I found it a bit boring."
    },
    {
      "title": " One of the lamest movies of all time",
      "review": "This was the dumbest and most boring movie that I have ever seen until the last 15 minutes. I couldn't believe that DiCaprio and Pitt would waste their time with this nonsense. Inglorious Basterds, Reservoir Dogs and Pulp Fiction are 10s and this is a big fat ZERO. Do not waste your time or money."
    },
    {
      "title": " Excellent epic a throwback to yesterday of a golden era of culture, fame, struggle and friendship.",
      "review": "Once again Quentin Tarantino has done it another long and in depth film(almost three hours long for this one!) as the director mixes plot and stories that blend both drama, comedy, and action all in one. Again as is common in any film of Tarantino's is the cast is always all star and a memorable ensemble and it seems the acting and chemistry is always in top form. And this might be the director's finest film to date for it's look back in time to a memorable yesteryear era!\"Once Upon a Time in Hollywood\" is set in 1969 at the height and end of Hollywood's golden age an era of free spirits and cultural uprising. It follows the life of one Rick Booth(in fine form from Leonardo DiCaprio) a past his prime and faded TV actor who now struggles even to get small parts in TV westerns, and Booth seems hopeless yet he's still friends with his buddy and partner in crime that being his stunt double Cliff Booth(Brad Pitt). The two burn plenty of midnight oil together still a ray of light is found when Rick gets a second chance and a rebirth by doing international pictures and marrying an Italian beauty.In somewhat of a wild card and subplot story Dalton's neighbor is the sexy and young actress Sharon Tate(Margot Robbie) who spices and lightens up the screen as a young star in the making. Also introduced is the strange and notorious Charles Manson. The film even has a surprise and happy ending! Overall excellent well done epic that pays homage to the past as it's a showcase of different stories that connects up with different characters."
    },
    {
      "title": " Further proof that Tarantino does genre like no one else",
      "review": "Vivid, relaxed, nostalgic and indulgent, Tarantino's 9th film is, by its own small stroke of brilliance, a near complete divergence from his previous works. As a slow burner, this film notably values character above plot, and has a loose structure that seems to lack in the urgency that drives works such as Inglorious Basterds or Django Unchained. Nonetheless, in true Tarantino fashion, it delivers an acting masterclass, and serves as proof that Tarantino does genre pieces, and shows versatility in the face of expectation, like no one else.This film isn't for everyone. But don't let that stop you for enjoying you what it is - another brilliant film."
    },
    {
      "title": " Amazing",
      "review": "From places in movie to performances truly a gem Leonardo is Oscar worthy!"
    },
    {
      "title": " You just don't see movies like this anymore",
      "review": "This is classic QT, showing that he is still at the top of his class when it comes to filmmaking. Plot has little to do with most Tarantino films, and this one is no exception. This film has great dialogue and beautiful set design and cinematography. The characters are all fleshed out and the acting is top-notch. Instead of going with a simple Hollywood formula (conventional plot and screenplay), QT sticks to what he knows best and makes a movie similar to his others, while also expanding upon typical Tarantino-isms (the film is more rooted in comedy than his others). Overall, this not a movie you see nowadays in Hollywood. It is sad that we only get one more QT film!"
    },
    {
      "title": " Tarantino's best film by quite a bit",
      "review": "None of the annoying dialogue of his earlier films, not much of the glorious violence of some of his noughties films, this is an odd film from the director. It holds his best qualities - an extreme attention to detail, a complete adoration of everything he puts in frame - but with somehow more maturity, more emotion. Have you ever cried in a Tarantino film before? OUATIH might be the first time that'll happen to you. I do not wish to reveal the ending, but I will say that he manages to deal with a real situation with respect and sophistication. Anyone offended or confused ought to think again about it. If this was to be the final Tarantino film it would be a perfect swan song - I can't think how his tenth could be better than this."
    },
    {
      "title": " No story",
      "review": "I waited months for this movie to come out! The Hateful Eight and Inglorious Bastards are both one of my favorite movies.. But this movie was one of the biggest dissapointments in my movie-watch-life:'(. No story.. Characters with no purpose.. And really boring scenes. Only 2 really good scenes in the entire movie? This movie is a waste of time and should have been a 30 min movie."
    },
    {
      "title": " Utter crap!",
      "review": "Other than to rewrite the Manson murders! What the hell is the point in this movie? There is no plot, no story? Just endless scenes of tarantino trying to be different and failing tragically? Do not waste two and a half hours of your life on this giant, steaming pile of crap!"
    },
    {
      "title": " Future Classic",
      "review": "Like Inglorious B******ds, audiences are invited to join Tarintino in his parallel universe of historic events altered, Tarintino style, which is shown in the last half an hour of the motion picture.Proven to be historically accurate in the first two hours of the film, Quentin's exploration of the life of Sharon Tate in the first 6 months before her death is portrayed beautifully by the performance of Margot Robbie along with the beautiful cinematography of Los Angeles during the last definitive years of Hollywood. We then delve in to the night of her death where the build up intensively reminds those who know of the Charles Manson murders well enough will understand what is about to occur. That's where the fictional characters come in; Rick Dalton (DiCaprio) and Cliff Booth (Pitt). An actor living next door to a famous film director is any actor's dream, but not when you live near one of Manson's targets. Tarintino invites these characters to fight against members of the Charles Manson family with plenty of blood and violence to kill them off Tarintino style, leaving Sharon Tate happily alive to live on.Both historically accurate and fictional fun, Quentin Tarantino juxtaposes his characters along famous movie stars at the right place at the right time, leaving audiences to wish that the events of the last half hour of the film were actually real"
    },
    {
      "title": " loving ode to Hollywood of yesteryear",
      "review": "Just seen QT's latest.I enjoyed every minute of it. Hollywood lates sixties, is pure eye candy. The soundtrack is awesome en the acting second tot none.I must say I love all QT's work. This picture in my opinion, isn't his best, maybe not even top three. What it is, is a well crafted peace of work from the master. It's funny, there's not much action, decent dialogues, but the setting and the entire feel of the movie is great.If you're not familiar with Tarantino's work, you might not want to see it a second time.I love to see it again."
    },
    {
      "title": " BETTER than Typical QT",
      "review": "I dreaded the length of this film & almost waited for DVD. I was pleasantly surprised at how fast it went b/c it is SO VISUALLY RICH & engaging. Admittedly slower pacing than expected from QT, but the pacing weaves a story & visuals that is ultimately rewarding. Perhaps 20-something's won't appreciate (1) the Hollywood & pop-culture nostalgia, (2) the brilliant music placement choices & (3) Leo's multi-layered, complex portrayal of a \"dying breed\" while simultaneously illustrating the character's shallow, short-sighted self-absorption -- VERY tough job to harness a character who is shown \"acting within the acting.\" QT is the master at showing us the most believable fantasy characters & re-imagining how they might interact with our historical realities. I was also dreading the violence b/c wondering how QT could possibly have the stones (and bad taste) to put the real-life murders on the big screen. Everyone knows QT films result in gruesome deaths, but this ending was SO BRILLIANT & satisfying (in a Tarantino way) -- a \"once upon a time\" tale that leaves you wishing it had happened that way in real life. See it on the big screen -- small screen inadequate for enjoying the tightly-packed scenery & depth of textures this film delivers."
    },
    {
      "title": " Beyond Words",
      "review": "Just go watch it. Everything about this film is phenomenal. From the musical choices, the dialogue, camera angles(the box office scene may be my favorite scene of the film), to how the mood changes based on which story you're telling; Quentin has done it again. This film will be studied for years to come, guaranteed."
    },
    {
      "title": " In a world where movies are made for everyone, QT does what he does best, and makes a masterpiece not everyone will appreciate.",
      "review": "I have now seen this movie three times in theatres... and by god I may indulge again tomorrow night. That to me is the very description of the crafted, honed, and mastered skill that QT has.First off let me say that this IS NOT a movie everyone will appreciate. I was reminded by this as I seen this the first time with a \"less appreciative\" relative of mine, then upon leaving the theatre he glanced at the poster next door and mumbled \"shoulda seen Hobbs and Shaw\". *I gasp*This movie shatters everything that makes the films that pour into the cinema. I truly believe it's QT spitting on what \"should\" be. \"Oh you think this scene feels uncomfortable? Well here! Oh this doesn't ring true to the real events? Who said it should?! Oh you're getting bored? WELL FLAMETHROWER. It's NOT story driven (you ask me to tell you what the movie is about and I'm hard pressed to get that into one sentence), it's NOT making you feel stupid by finding ways to introduce characters and situations, every shot DOES NOT have a purpose, every scene DOES NOT lead to further the plot. ...And I love it. (More about that below)This movie to me is simply about life. It does what movies I believe are forgetting they should do, it transports you to another time, another era, and by the last act, another reality. I can't believe after seeing the trailer I expected (well... with a QT movie I can't believe I foolishly set my expectations anywhere) a noir thriller about the Manson murders. When walking out of the theatre I realized Charles Manson has LITERALLY one scene! This isn't a \"wooooow that was so cool when that happened\" type movie, it's a journey through relatively regular lives of a couple of people in an incredible era. It's filled with subtle questions about the social construct we live in, fame, the duality of man, and yet still rings true to the QT movies of the past pulling out a scene that makes you sit up in your seat and go \"...what the living f+%# was that\".Onto the movie itself, it has terrific performances all around. Brad Pitt at the best I believe I've seen him in a long time, Leo does what Leo does he's a great actor. Robbie pulls off a Sharron Tate so ditsy, yet at the same time so kind hearted. Although I believe the REAL star of the show was a 12 *achem* I mean 8 year old girl who stole EVERY SECOND of the few scenes she was in.The dialogue? Crisp. Not the best we've seen from QT, but MORE then enough to remind why he's one of the very best. This isn't a short film, and it doesn't speed along to say the least, but with dialogue like this who needs it to?? I found myself wanting scenes to continue just to hear more back and forth, more witty comments, more punch lines that hang in the air as the conversation moves on.That all paired with BEAUTIFUL shots of the city that brought us anything playing in the local theatre, and a soundtrack. OHHH the soundtrack. From a driving at night shot of Brad Pitts \"Ramblin Gamblin Man\"(Bob Segar) to the ominous \"Out of Time\" wails of the Rolling Stones as Sharron Tate heads home for that fateful evening. If you're not into the vibe of the city the music will get you there quick.A film I truly am proud to say I witnessed released, and will indeed quench the thirst for a Tarantino movie till the 10th and final, and for years to come after."
    },
    {
      "title": " Once Upon a Time Movies had Plots !!",
      "review": "I absolutely agree with the honest reviews regarding lack of story and character development and had their been a plot then this would be worthy of a 9-10 rating and most certainly Tarantino's Best work to date however instead we get a series of stand alone film clips secondary to a visual journey of all the Hollywood Vintage Landmarks successfully capturing the time period with integrity The Acting was top notch and set design was at its best however this fell short of what could of been an awesome story piggy backing off the cinematography and certainly not comparable to Pulp fiction for its intertwining plots which this could of desperately used to become a Gem !! DiCaprio and Pitt (Redford and Newman) need i say more ?? hopefully Tarantino is not serious about retiring because i truly believe his best is yet to come !!"
    },
    {
      "title": " More Misdirection Than Penn and Teller",
      "review": "Tarantino has stated that \"Once\" is not Sharon Tate's movie. It's Rick Dalton's story. Yes, we get to ride the emotional rollercoaster of a man losing his place in his society, then discovering \"too little, too late\" that he may have had the acting chops all along that could have saved him from his plight. While that tempest rages we get to glide along with Cliff Booth, who possesses the self assurance of a man adept at martial arts with the ability to have anyone \"do anything you want to him. Throw him off a building, alright? Light him on fire. Hit him with a Lincoln, right? Get creative. Do whatever you want ...\" Cliff's journey stands in sharp counterpoint to the star he shadows.But what of Sharon Tate? Her little snippets (not even vignettes) pepper the movie, and leads to ..... WHAT?In the movie, had she not been featured the way she was, she would have (as in real life) been viewed as just another blonde bimbo starlet snatched up as so much candy on a successful director's arm. The movie provides us an opportunity to get to know Sharon (unlike real life), as a pretty young woman who has maintained her humanity, her friendliness, her affection for her friends and her public, and her warm affinity for all she meets. Her interaction with the ticket taker and the manager of the theater, her quiet enjoyment of the audience enjoying her point to a woman of depth of character, someone worth knowing. Someone worth grieving over.Reviews have been written about the over the top violence ending this film. Yet none of the violence compares to that actually perpetrated against Sharon and her friends in real life. To know this young woman was repeatedly knifed while her unborn child was carved from her body, to imagine the Manson family reveling in their blood lust, scrawling the word \"PIG\" on the walls in the young mother's blood, to know she begged for mercy having done nothing at all to provoke the mayhem performed on her makes the movie violence seen here a footnote to the atrocity that actually occurred.Understanding this, we're left with a piquancy, a longing sadness, barely buoyed by the ending offered by the film. For those criticizing the film for being too slow, for those debasing this effort as not providing enough tension, for the rabid shoot-em-up fans I suggest they view this as a trick performed by the expert magicians, Penn and Teller. It looks like a revenge fantasy: nope, it's a character study. HA! Fooled you all again! It's a rom-com! And like any Tarantino movie, twisting all our expectations, the ending to his rom-com leaves you with an aching heart."
    },
    {
      "title": " Masterpiece",
      "review": "Amazing! Absolutely brilliant from start to finish. I didn't know what to expect and I was blown away"
    },
    {
      "title": " Disappointed!",
      "review": "I am giving it 5 coz leonardo and brad were awesome. But margot's role was very insignificant. The movie was good in bits and pieces but as a whole there is no meaning that one could make out from the movie. It is very random. It was boring too at many points. I would not recommend you to waste your money on this."
    },
    {
      "title": " Boring until the end",
      "review": "Now I love Tarantino but there was absolutely no need for 3/4 of this film. The last 15 minutes are spectacular. But I almost walked out it was so boring. So boring. great acting of course from Leo and Brad, particularly Leo having a word with himself in his trailer, but the majority of the film is just awful. But the last 15 minutes, are an absolute triumph. Make sure you read up on Charles Manson before you see it though.."
    },
    {
      "title": " What was the point?",
      "review": "During the first 2 Hours of the movie I was more interested in the hair of the man in front of me at the cinema. No storyline or action whatsoever from that. Then it skips to 6 months later or more (I can't honestly remember) and then there's a bit of action but nothing to do with the story so far. The action was pretty funny and gory to be fair but then it ends and you can't quite figure out what you've watched. Brad Pitt was pretty good. Di Caprio and Margot Robbie have been payed to act really well with no intent of giving their characters anything to do. Maybe it was just a movie for older people or fans of westerns, maybe it all went over my head, but most likely it was the most boring movie I have ever watched. I'd say it's not worth watching again to figure it all out. Also if my dad watches this (and he loves westerns), he'll be asleep within the first 10 minutes."
    },
    {
      "title": " Strangely Good",
      "review": "Well, the first two hours is a bit hard to enjoy if you are not used to the American late 60s. The cast is incredible as usual and that was the main reason that kept my attention. Music was unbelievably good and well suited. The events chain is somehow similar with the Pulp Fiction but it's in a bit different style. The brutal action scenes were highly creative and were really brutal, I was shocked when the dog food thing happened. I wonder how the gun is able to fire after it was soaked in that pool. I think both the DiCaprio and Pitt were awesome.Long story short, I recommend."
    },
    {
      "title": " 'The emperor's new clothes' Tarantino style",
      "review": "Lack of strong dialogues. Clue of the movie is trivial No goosebumpsSince Tarentino is a proven genius, this movie must be 'The emperor's new clothes' Tarantino style :)"
    },
    {
      "title": " No plot",
      "review": "This was such a waste of time. It was so boring since there was absolutely no plot. Forced myself to sit through the entire film and regretted it, especially towards the end when things got gruesome and gory. Save your money and your time please."
    },
    {
      "title": " Worst movie since waterworld.",
      "review": "Like the actors but was very boring and felt like the longest movie ever."
    },
    {
      "title": " Brad Pitt is HOT!!! Movie is too long...",
      "review": "Went into this movie without any expectations. In fact, I thought I was going to hate it. The scenes with Leo could've been cut in half but the ones with Brad were amazing. The movie was too long but the ending was fabulous. I highly recommend it."
    },
    {
      "title": " Not Tarantino's best",
      "review": "So much of this movie is excellent just as you would expect from the Master. Only 6 stars as It is slow and I found it boring, very low on entertainment. Albeit no regrets paying to see it on the big screen as it is an authentic look at the 60's. To an old fart like me it worked like a time machine."
    },
    {
      "title": " Controversial view incoming...",
      "review": "Anyone who has watched countless of interviews with the man Quentin Tarantino knows that the violence in his movies aren't funny or entertaining for him explicitly for its visual absurdity alone but for the idea of actually avenging \"bad guys\".Now this concept in movies is of course not only a reflection of Mr. Tarantino himself but a reflection of the average man and his world view. There is a sense of superiority underlying the desire to avenge or desire to hurt someone, not in solely self-defence but actually because they enjoy it.But this phenomena of revenge and all the drama that comes with it could in movies just be an innocent mirror to show how human relationships actually look like in reality but this movie in particular does not innocently capture the essence of man, it might actually glorify violence. We are supposed to be on the side of the \"cool good guys\" just like in Django and Inglorious.This film was also described by many as a love letter to the old age of Hollywood and that sounds very beautiful. To me however, this film was mostly perceived as a sad story. Leonardo DiCaprio plays Rick Dalton who happens to live for... wait for it... pride? Seriously? Is that supposed to be romantic? Pride, the feeling of wanting to desperately hold on to an image of ones self as a fantastic man and the destructive behavioral patterns that manifest themselves as soon as this mental image is threatened. Sounds very beautiful indeed... No but seriously, no wonder there are wars out there in real life when most people actually live their life defending their self image just like Rick Dalton instead of looking at the world without those self-centered pleasure seeking glasses.Brad Pitt played charismatic stuntman Cliff Booth, a man who did not only feel like punching a not so threatening guy for puncturing his car tire but also keep punching him several times for nothing but a show off of superiority.The end of the movie dehumanized people that were ideologically possessed and possibly mentally ill. That doesn't mean that the last scenes weren't funny in its absurdity. But something can be fun and sad at the same time.What makes the violence in this movie somewhat disturbing isn't the violence in itself (we live in a violent world and we can play with violence in a lot of funny ways in popular culture) but how the violence lands in the context of a landscape that to me felt very serious and earnest in the portraying of two guys and their relationship in the world of Hollywood.Otherwise good cinematography and good acting from practically everyone although the longer witty dialogue was missing in this movie in comparison to earlier films by Tarantino. I enjoyed especially the portrayal of Rick Dalton.No need to agree with what I say, I know that I likely will be perceived as a boring person who took this comedy too seriously. Many people enjoyed this movie and that I can't take away from them but I can't help but think of how this movie and its reception really is a reflection of how to the bone sick our culture really is. I'm especially fascinated by some people's view of this movie as \"intelligent\" and \"mature\". It could as I perceive it only be intelligent, mature and deep in a narcissistic culture.We do not seem to want peace, we want to enforce the idea of peace and responsibility on other people and mock those who doesn't agree."
    },
    {
      "title": " A BLAST!",
      "review": "This movie is meant to be watched In theatres it's s 3 hours and I wasn't bored a bit the twist at the end was a great change of history and I cried when Bruce got chucked at a car this was the best time I've had all year especially after seeing Godzilla KOTM and yesterday witch sucked"
    },
    {
      "title": " Slow unlike his previous films and an homage to Sharon Tate",
      "review": "I have seen the previous 8 Tarantino films and he always has A actors in them. I thought I was going to like this one but it was painfully slow and with no sense at all. The acting was great, cinematography too, there were funny scenes including one with a guy playing Bruce Lee (this event never happened in real life) and fans of Lee might be outraged and laugh at the same time with this unreal but funny scene. The last minutes of the film were really a Tarantino movie with some of the gore and violence that´s been in his previous movies (I am not a fan of gory nor violent movies at all, but I find QT´s funny and quite different). it seems OUATIH was made because of his love and nostalgia to good old films from the 60s and 70s and for the ending, he created a timeline on the Sharon Tate fate because I assume, he wanted to do an homage to Sharon and the other unfortunate victims."
    },
    {
      "title": " Wow! This movie was extremely NOT AMAZING!",
      "review": "Once Upon a Time in Hollywood is, by far, the most pointless, meandering, excruciatingly un-entertaining work of the usually reliable master, Quentin Tarantino! Only a handful of good-to-very good performances save this unintentional \"disaster film\" from complete worthlessness! Fortunately for the picture, one of those performances is by one of its stars, Brad Pitt, who is consistently watchable and entertaining throughout, even as the film he inhabits so often isn't! Pitt's fellow co-lead, Leonardo DiCaprio is barely memorable (and not even particularly good) as a character who isn't especially likeable, or compelling, anyway! Most telling of DiCaprio's shortcomings in the film is the way he easily gets his \"thespian clock\" cleaned by a then-9 year old actress, Julia Butters, who dominates scenes with him with a seemingly effortless, naturalistic style (seriously, she is one of the best things about the film)! Also very good is the gorgeous Margaret Qualley (Andie MacDowell's real-life daughter) who plays a comely hitchhiker who brings an unsuspecting Pitt into contact with several Manson family members! The fight scene between Pitt and \"Bruce Lee\" was also entertaining, yet these are all mere moments in a largely overstuffed, hapless mess of a picture! Also, conspicuously absent from the film is writer Tarantino's gift of creating memorable, quotable, dialogue! Not only is the movie crafted in a blandly disposable way, Once Upon a Time in Hollywood has precious little of the inspired genius that has profoundly uplifted so many other Tarantino films before it!"
    },
    {
      "title": " Movie making is an art and Tarantino is Davinci",
      "review": "Although Samuel L jackson and Christopher waltz were majorly missed and would have added cherry on top. This was absolutely are at its finest, Tarantino and his marvelous art of alternate story line is at its finest."
    },
    {
      "title": " A Fairy Tale we can all appreciate.",
      "review": "I came across a very very decent review that mentioned,\" this film is not for everyone..\" and I believe that proves true with this film. The same can be said for almost all Quentin Tarantino's film's. You either see the humor or you don't. You either think they are classics or you don't. You think it's too violent or you don't, and again I think that proves to be the case with Once Upon A Time In Hollywood. As the film begins you are dropped into the world of Hollywood in 1969 and all that that involves. Hippies, drugs, actors and actresses, beautiful sets and images of L.A., movie sets and cameras, and of course lots of cigarettes. But the magic with Tarantino is he shows you just how extraordinary the ordinary can be be even when he has super star Hollywood A list members portraying complex characters. Leo is incredible and brings the same star power he oozed with in \"Wolf of Wall Street\" and that star power never goes dim through the almost three hour film. Brad Pitt was the hero we all deserved and the one we needed And reveals just how magical the actor can be given any type character just like he has throughout his career. What can't be said of Margot Robbie and her Almost literal becoming of the late Sharron Tate. Robbie is truly a student of the game and profession of acting, she brings Mrs. Tate to life again. It's a movie you have to watch to understand why it's so special and of course even involving the manson family murders is incredibly shaky ground, but the way Tarantino ends the film is truly a classy and an even noble way to end a film with the specific context. Simply put this is a story about,\" what if the the fairy tale did exist? What if the bad guy Didn't win?\""
    },
    {
      "title": " Tarantino again writes his own world",
      "review": "This is a movie which, if you'll understand, you'll know how tarantino plays with the real world happening and how the movie tampers with it giving you excitement. First of all you need to know the infamous tragedy of Sharon Tate in 1960s, which will eventually after a point in the movie play on your mind and you'll realise that Tarantino is again rewriting his fantasised history. Tge beauty of the film is that it transcends between real world tragedy and the fantasy fate of it. Tarantino throws in two fictional characters to save a real life character in the movie and if you don't understand this you'll not enjoy the movie. This is what it feels like watching a movie of 2019 where filmamking and storytelling is so advanced that only a few can understand and realize the beauty of it. Just one thing that could have been better if we could have been treated some action of the two main leads a little more somewhere in the middle of the movie, around after 80 minutes of the movie it feels just a little bit slow, that could have been a little more entertaining. But a great movie and a must watch if you watch Tarantino movies and know how he goes by them."
    },
    {
      "title": " \"Baby, baby, baby, you're out of time.\"",
      "review": "Well I'm a big Tarantino fan, but I have to say, this one missed the mark for me. I thought the movie's pacing was excruciating, as most of the time nothing seemed to be happening. I didn't know anything about the story going in, so as it unfolded I was able to figure out that it had something to do with the Manson Gang, which had me prepared for a typically violent crescendo as the story came to a climax. However the film opted for an alternate reality to the actual events of August, 1969. This version had the Manson followers wind up at the wrong house, to be met with a fading television actor and his regular stunt double, dishing out punishment in true Tarantino style. By that time, my only reaction was to laugh at the absurdity of it all, what with Brad Pitt hammering his victim mercilessly into any available furniture, while Leonardo DiCaprio whipped out his trusty flame thrower to nail the chick in the swimming pool. Not bad for the guy who broke down on the set of 'Lancer' when he couldn't deliver his lines right.In passing, the actors who portrayed Steve McQueen and Bruce Lee had an eerie way of channeling the former celebrities. Damian Lewis couldn't have been a better choice to mimic McQueen, he had the look and mannerisms that had me thinking he could have been the real deal. Mike Moh in some ways, looked more like Jason Scott Lee portraying Bruce Lee in the movie \"Dragon: The Bruce Lee Story\". I read that the family of Bruce Lee wasn't happy with the way Tarantino represented the former martial arts star in the film, but if that's the case, the same would have to be said of 'Dragon' because Jason Lee's interpretation to my mind was pretty much the same.For nostalgia fans like myself, the film has some merit in reliving the names of old time TV and movie programs like 'Mannix', and Steve McQueen's 'Wanted:Dead or Alive', reinvented for this picture as 'Bounty Law'. There's also the 'Lancer' spot with Timothy Olyphant portraying that series' star, James Stacy. Margot Robbie was stunning as Sharon Tate, and if Tarantino had been a little sharper, he might have thrown in a plug for the only Sharon Tate film I've ever seen, 1967's \"The Fearless Vampire Killers\". But unfortunately, just like that old horror comedy, this story was sooooo long, with interminable scenes stretching the distance from one point to another, it felt a lot like those old horse chase scenes did in 'B' Westerns from the Thirties and Forties."
    },
    {
      "title": " Very good movie DONT LISTEN TO THE CRITICS",
      "review": "This is a very good movie but its not for Everyone, Tarantino fans would like it a lot."
    },
    {
      "title": " Not what I expected",
      "review": "Im not sure what I expected, this seemed more like a leo acting reel (which is fine) but without him and pitt im not sure how good this movie would have been. People complaining about multiple story lines, its tarantino, you should have stayed home. I love tarantino's flicks but this is down there with deathproof. It has its moments, hell ill watch it a few more times when it comes out. But its one of those movies ill play when im trying to fall asleep for work. I tech gave this a 7.8 imo. The climax was not worth the wait. No hating here just my honest opinion of the flick. Great acting by everyone in the movie, even the nobodies."
    },
    {
      "title": " Amazing film all round!",
      "review": "An excellent portrayal of 1960's Hollywood and so many subtle references that are just amazing. All around the acting was excellent from and excellent cast. I Absolutely loved this movie and believe it has very much done something very unique. Awesome film!"
    },
    {
      "title": " Trying to explain someone why this movie is a masterpiece is like you trying to explain a blind man different colours",
      "review": "I said everything in the title. If you don't like this movie I guess for you is next door screening like Hobbs&Shaw(no offence, it is how it is). I wasn't born yet to experience 60's but Mr. Tarantino took me there for 3 hours. One of the best gifts in my life. Thank you Sir."
    },
    {
      "title": " Masterclass filmmaking.",
      "review": "Every shot, every frame is compelling. The acting down to the bit parts are flawless. DiCaprio will win Best Actor for a clinic he puts on. And only QT could do what he did here. Easily up there with Reservoir Dogs and Pulp Fiction. Easily. Brilliant, shocking and Hilarious. Bravo."
    },
    {
      "title": " Disappointed",
      "review": "I'm a huge QT fan so writing this is disappointing to say the least.I went in expecting a lot but came out slightly confused and very disappointed.There's a lack of plot and story as the film just seems like a load of clips just stick together! Has to be the worst movie of the lot.There were a few note worthy bits but nothing to shout about. It almost feels lazy, as maybe QT has set the bar too high with Pulp Fiction and Kill Bill. It never really gets going and there isn't the usual witty drawn out conversations between the main characters."
    }
  ]
}